/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U01) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_12_1 :
    Uω (aρ 1) (bρ 1) (496117379 / 2000000000000 : ℝ) ≤
      (-(51279014775995128440791 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14822473832053 / 2500000000000000 : ℝ) ≤
      (-(51279014775995128440791 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (14822473832053 / 2500000000000000 : ℝ) = (14822473832053 / 9765625000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14822473832053 / 9765625000000 : ℝ) ≤
            (4172759648004871559209 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (7070394933303 / 1250000000000000 : ℝ)) (q :=
      (14822473832053 / 2500000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_12_2 :
    Uω (aρ 2) (bρ 2) (496117379 / 2000000000000 : ℝ) ≤
      (-(3094041904103170921061 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (141602028099197 / 20000000000000000 : ℝ) ≤
      (-(3094041904103170921061 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (141602028099197 / 20000000000000000 : ℝ) =
            (141602028099197 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (141602028099197 / 78125000000000 : ℝ) ≤
            (371693997396829078939 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (55816384399197 / 10000000000000000 : ℝ)) (q :=
      (141602028099197 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_12_3 :
    Uω (aρ 3) (bρ 3) (496117379 / 2000000000000 : ℝ) ≤
      (-(23350817492635683984117 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (187414745659063 / 20000000000000000 : ℝ) ≤
      (-(23350817492635683984117 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (187414745659063 / 20000000000000000 : ℝ) =
            (187414745659063 / 156250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (187414745659063 / 156250000000000 : ℝ) ≤
            (909333817864316015883 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (54232995609063 / 10000000000000000 : ℝ)) (q :=
      (187414745659063 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_12_4 :
    Uω (aρ 4) (bρ 4) (496117379 / 2000000000000 : ℝ) ≤
      (-(8663759421672724895473 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (131428195324229 / 10000000000000000 : ℝ) ≤
      (-(8663759421672724895473 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (131428195324229 / 10000000000000000 : ℝ) =
            (131428195324229 / 78125000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (131428195324229 / 78125000000000 : ℝ) ≤
            (1040301102527275104527 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (25690229766729 / 5000000000000000 : ℝ)) (q :=
      (131428195324229 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_12_5 :
    Uω (aρ 5) (bρ 5) (496117379 / 2000000000000 : ℝ) ≤
      (-(39733556029110319524967 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (376204149959763 / 20000000000000000 : ℝ) ≤
      (-(39733556029110319524967 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (376204149959763 / 20000000000000000 : ℝ) =
            (376204149959763 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (376204149959763 / 312500000000000 : ℝ) ≤
            (1855274788889680475033 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (46538299509763 / 10000000000000000 : ℝ)) (q :=
      (376204149959763 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_12_6 :
    Uω (aρ 6) (bρ 6) (496117379 / 2000000000000 : ℝ) ≤
      (-(36207282453746924592843 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (535263583817503 / 20000000000000000 : ℝ) ≤
      (-(36207282453746924592843 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (535263583817503 / 20000000000000000 : ℝ) =
            (535263583817503 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (535263583817503 / 312500000000000 : ℝ) ≤
            (5381548364253075407157 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (38357358227503 / 10000000000000000 : ℝ)) (q :=
      (535263583817503 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_12_7 :
    Uω (aρ 7) (bρ 7) (496117379 / 2000000000000 : ℝ) ≤
      (-(32923939525185939772853 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (743295441345089 / 20000000000000000 : ℝ) ≤
      (-(32923939525185939772853 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (743295441345089 / 20000000000000000 : ℝ) =
            (743295441345089 / 625000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (743295441345089 / 625000000000000 : ℝ) ≤
            (1733419489814060227147 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (22727834995089 / 10000000000000000 : ℝ)) (q :=
      (743295441345089 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_12_8 :
    Uω (aρ 8) (bρ 8) (496117379 / 2000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_12_9 :
    Uω (aρ 9) (bρ 9) (496117379 / 2000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_12_10 :
    Uω (aρ 10) (bρ 10) (496117379 / 2000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_12_11 :
    Uω (aρ 11) (bρ 11) (496117379 / 2000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_12_12 :
    Uω (aρ 12) (bρ 12) (496117379 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_12_13 :
    Uω (aρ 13) (bρ 13) (496117379 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_12_14 :
    Uω (aρ 14) (bρ 14) (496117379 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_12_15 :
    Uω (aρ 15) (bρ 15) (496117379 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_12_16 :
    Uω (aρ 16) (bρ 16) (496117379 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_12 :
    Uρ (496117379 / 2000000000000 : ℝ) ≤
      (-(27776595649486878085457 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (496117379 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(51279014775995128440791 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (496117379 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3094041904103170921061 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (496117379 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(23350817492635683984117 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (496117379 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8663759421672724895473 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (496117379 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(39733556029110319524967 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (496117379 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(36207282453746924592843 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (496117379 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(32923939525185939772853 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (496117379 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (496117379 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (496117379 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (496117379 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (496117379 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (496117379 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (496117379 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (496117379 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (496117379 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_12_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_13_1 :
    Uω (aρ 1) (bρ 1) (283911191 / 1000000000000 : ℝ) ≤
      (-(25671310519013681683207 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (117827942579917 / 20000000000000000 : ℝ) ≤
      (-(25671310519013681683207 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (117827942579917 / 20000000000000000 : ℝ) =
            (117827942579917 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (117827942579917 / 78125000000000 : ℝ) ≤
            (2054576692986318316793 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (56169836404917 / 10000000000000000 : ℝ)) (q :=
      (117827942579917 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_13_2 :
    Uω (aρ 2) (bρ 2) (283911191 / 1000000000000 : ℝ) ≤
      (-(9913844635044356752717 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28138178523381 / 4000000000000000 : ℝ) ≤
      (-(9913844635044356752717 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (28138178523381 / 4000000000000000 : ℝ) = (28138178523381 / 15625000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28138178523381 / 15625000000000 : ℝ) ≤
            (1176510249755643247283 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (11052754786381 / 2000000000000000 : ℝ)) (q :=
      (28138178523381 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_13_3 :
    Uω (aρ 3) (bρ 3) (283911191 / 1000000000000 : ℝ) ≤
      (-(46768288274873095600687 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46542429648523 / 5000000000000000 : ℝ) ≤
      (-(46768288274873095600687 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (46542429648523 / 5000000000000000 : ℝ) = (46542429648523 / 39062500000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46542429648523 / 39062500000000 : ℝ) ≤
            (1752014346126904399313 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (13336623389773 / 2500000000000000 : ℝ)) (q :=
      (46542429648523 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_13_4 :
    Uω (aρ 4) (bρ 4) (283911191 / 1000000000000 : ℝ) ≤
      (-(5423700856563990487439 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (65250421395167 / 5000000000000000 : ℝ) ≤
      (-(5423700856563990487439 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (65250421395167 / 5000000000000000 : ℝ) = (65250421395167 / 39062500000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (65250421395167 / 39062500000000 : ℝ) ≤
            (641336971061009512561 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (12471069870167 / 2500000000000000 : ℝ)) (q :=
      (65250421395167 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_13_5 :
    Uω (aρ 5) (bρ 5) (283911191 / 1000000000000 : ℝ) ≤
      (-(39812819146312822009509 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (93308506303549 / 5000000000000000 : ℝ) ≤
      (-(39812819146312822009509 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (93308506303549 / 5000000000000000 : ℝ) = (93308506303549 / 78125000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (93308506303549 / 78125000000000 : ℝ) ≤
            (1776011671687177990491 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (10981674944799 / 2500000000000000 : ℝ)) (q :=
      (93308506303549 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_13_6 :
    Uω (aρ 6) (bρ 6) (283911191 / 1000000000000 : ℝ) ≤
      (-(18153609865494868493647 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (529940946095807 / 20000000000000000 : ℝ) ≤
      (-(18153609865494868493647 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (529940946095807 / 20000000000000000 : ℝ) =
            (529940946095807 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (529940946095807 / 312500000000000 : ℝ) ≤
            (2640805543505131506353 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (33393245520807 / 10000000000000000 : ℝ)) (q :=
      (529940946095807 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_13_7 :
    Uω (aρ 7) (bρ 7) (283911191 / 1000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_13_8 :
    Uω (aρ 8) (bρ 8) (283911191 / 1000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_13_9 :
    Uω (aρ 9) (bρ 9) (283911191 / 1000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_13_10 :
    Uω (aρ 10) (bρ 10) (283911191 / 1000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_13_11 :
    Uω (aρ 11) (bρ 11) (283911191 / 1000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_13_12 :
    Uω (aρ 12) (bρ 12) (283911191 / 1000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_13_13 :
    Uω (aρ 13) (bρ 13) (283911191 / 1000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_13_14 :
    Uω (aρ 14) (bρ 14) (283911191 / 1000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_13_15 :
    Uω (aρ 15) (bρ 15) (283911191 / 1000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_13_16 :
    Uω (aρ 16) (bρ 16) (283911191 / 1000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_13 :
    Uρ (283911191 / 1000000000000 : ℝ) ≤
      (-(5565255693326323982243 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (283911191 / 1000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(25671310519013681683207 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (283911191 / 1000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9913844635044356752717 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (283911191 / 1000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(46768288274873095600687 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (283911191 / 1000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5423700856563990487439 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (283911191 / 1000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(39812819146312822009509 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (283911191 / 1000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(18153609865494868493647 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (283911191 / 1000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (283911191 / 1000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (283911191 / 1000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (283911191 / 1000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (283911191 / 1000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (283911191 / 1000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (283911191 / 1000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (283911191 / 1000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (283911191 / 1000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (283911191 / 1000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_13_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_14_1 :
    Uω (aρ 1) (bρ 1) (170058951 / 500000000000 : ℝ) ≤
      (-(5144324067033277739057 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29162076708097 / 5000000000000000 : ℝ) ≤
      (-(5144324067033277739057 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (29162076708097 / 5000000000000000 : ℝ) = (29162076708097 / 19531250000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29162076708097 / 19531250000000 : ℝ) ≤
            (400853375366722260943 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (13888066941847 / 2500000000000000 : ℝ)) (q :=
      (29162076708097 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_14_2 :
    Uω (aρ 2) (bρ 2) (170058951 / 500000000000 : ℝ) ≤
      (-(496717399318518904317 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13925594310293 / 2000000000000000 : ℝ) ≤
      (-(496717399318518904317 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (13925594310293 / 2000000000000000 : ℝ) = (13925594310293 / 7812500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13925594310293 / 7812500000000 : ℝ) ≤
            (57800344921481095683 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (5439089152793 / 1000000000000000 : ℝ)) (q :=
      (13925594310293 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_14_3 :
    Uω (aρ 3) (bρ 3) (170058951 / 500000000000 : ℝ) ≤
      (-(1875002690401424918243 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5756012276917 / 625000000000000 : ℝ) ≤
      (-(1875002690401424918243 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show (5756012276917 / 625000000000000 : ℝ) = (5756012276917 / 4882812500000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5756012276917 / 4882812500000 : ℝ) ≤
            (65809414438575081757 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (6491404367043 / 1250000000000000 : ℝ)) (q :=
      (5756012276917 / 625000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_14_4 :
    Uω (aρ 4) (bρ 4) (170058951 / 500000000000 : ℝ) ≤
      (-(5438137640616013885629 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (51600921238611 / 4000000000000000 : ℝ) ≤
      (-(5438137640616013885629 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (51600921238611 / 4000000000000000 : ℝ) = (51600921238611 / 31250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (51600921238611 / 31250000000000 : ℝ) ≤
            (626900187008986114371 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (9489853440611 / 2000000000000000 : ℝ)) (q :=
      (51600921238611 / 4000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_14_5 :
    Uω (aρ 5) (bρ 5) (170058951 / 500000000000 : ℝ) ≤
      (-(39947577872317960521831 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (368238108811001 / 20000000000000000 : ℝ) ≤
      (-(39947577872317960521831 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (368238108811001 / 20000000000000000 : ℝ) =
            (368238108811001 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (368238108811001 / 312500000000000 : ℝ) ≤
            (1641252945682039478169 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (39492850486001 / 10000000000000000 : ℝ)) (q :=
      (368238108811001 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_14_6 :
    Uω (aρ 6) (bρ 6) (170058951 / 500000000000 : ℝ) ≤
      (-(36504445610949767396391 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (519591533231167 / 20000000000000000 : ℝ) ≤
      (-(36504445610949767396391 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (519591533231167 / 20000000000000000 : ℝ) =
            (519591533231167 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (519591533231167 / 312500000000000 : ℝ) ≤
            (5084385207050232603609 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (23605899766167 / 10000000000000000 : ℝ)) (q :=
      (519591533231167 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_14_7 :
    Uω (aρ 7) (bρ 7) (170058951 / 500000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_14_8 :
    Uω (aρ 8) (bρ 8) (170058951 / 500000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_14_9 :
    Uω (aρ 9) (bρ 9) (170058951 / 500000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_14_10 :
    Uω (aρ 10) (bρ 10) (170058951 / 500000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_14_11 :
    Uω (aρ 11) (bρ 11) (170058951 / 500000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_14_12 :
    Uω (aρ 12) (bρ 12) (170058951 / 500000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_14_13 :
    Uω (aρ 13) (bρ 13) (170058951 / 500000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_14_14 :
    Uω (aρ 14) (bρ 14) (170058951 / 500000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_14_15 :
    Uω (aρ 15) (bρ 15) (170058951 / 500000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_14_16 :
    Uω (aρ 16) (bρ 16) (170058951 / 500000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_14 :
    Uρ (170058951 / 500000000000 : ℝ) ≤
      (-(13933261935333362960321 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (170058951 / 500000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5144324067033277739057 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (170058951 / 500000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(496717399318518904317 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (170058951 / 500000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1875002690401424918243 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (170058951 / 500000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5438137640616013885629 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (170058951 / 500000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(39947577872317960521831 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (170058951 / 500000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(36504445610949767396391 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (170058951 / 500000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (170058951 / 500000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (170058951 / 500000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (170058951 / 500000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (170058951 / 500000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (170058951 / 500000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (170058951 / 500000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (170058951 / 500000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (170058951 / 500000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (170058951 / 500000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_14_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_15_1 :
    Uω (aρ 1) (bρ 1) (396324613 / 1000000000000 : ℝ) ≤
      (-(10308997249903148058101 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2886686981611 / 500000000000000 : ℝ) ≤
      (-(10308997249903148058101 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show (2886686981611 / 500000000000000 : ℝ) = (2886686981611 / 1953125000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2886686981611 / 1953125000000 : ℝ) ≤
            (781357634896851941899 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (85833605171 / 15625000000000 : ℝ)) (q :=
      (2886686981611 / 500000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_15_2 :
    Uω (aρ 2) (bρ 2) (396324613 / 1000000000000 : ℝ) ≤
      (-(24887961647494144053291 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (137812659217157 / 20000000000000000 : ℝ) ≤
      (-(24887961647494144053291 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (137812659217157 / 20000000000000000 : ℝ) =
            (137812659217157 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (137812659217157 / 78125000000000 : ℝ) ≤
            (2837925564505855946709 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (53509674752157 / 10000000000000000 : ℝ)) (q :=
      (137812659217157 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_15_3 :
    Uω (aρ 3) (bρ 3) (396324613 / 1000000000000 : ℝ) ≤
      (-(11746208074433576911541 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (182181659963663 / 20000000000000000 : ℝ) ≤
      (-(11746208074433576911541 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (182181659963663 / 20000000000000000 : ℝ) =
            (182181659963663 / 156250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (182181659963663 / 156250000000000 : ℝ) ≤
            (383867580816423088459 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (50482569148663 / 10000000000000000 : ℝ)) (q :=
      (182181659963663 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_15_4 :
    Uω (aρ 4) (bρ 4) (396324613 / 1000000000000 : ℝ) ≤
      (-(43626843011011594664449 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5097653032921 / 400000000000000 : ℝ) ≤
      (-(43626843011011594664449 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show (5097653032921 / 400000000000000 : ℝ) = (5097653032921 / 3125000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5097653032921 / 3125000000000 : ℝ) ≤
            (4893459609988405335551 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (897787595321 / 200000000000000 : ℝ)) (q :=
      (5097653032921 / 400000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_15_5 :
    Uω (aρ 5) (bρ 5) (396324613 / 1000000000000 : ℝ) ≤
      (-(20049749814838098711663 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (362686051450057 / 20000000000000000 : ℝ) ≤
      (-(20049749814838098711663 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (362686051450057 / 20000000000000000 : ℝ) =
            (362686051450057 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (362686051450057 / 312500000000000 : ℝ) ≤
            (744665594161901288337 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (34502860235057 / 10000000000000000 : ℝ)) (q :=
      (362686051450057 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_15_6 :
    Uω (aρ 6) (bρ 6) (396324613 / 1000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_15_7 :
    Uω (aρ 7) (bρ 7) (396324613 / 1000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_15_8 :
    Uω (aρ 8) (bρ 8) (396324613 / 1000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_15_9 :
    Uω (aρ 9) (bρ 9) (396324613 / 1000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_15_10 :
    Uω (aρ 10) (bρ 10) (396324613 / 1000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_15_11 :
    Uω (aρ 11) (bρ 11) (396324613 / 1000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_15_12 :
    Uω (aρ 12) (bρ 12) (396324613 / 1000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_15_13 :
    Uω (aρ 13) (bρ 13) (396324613 / 1000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_15_14 :
    Uω (aρ 14) (bρ 14) (396324613 / 1000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_15_15 :
    Uω (aρ 15) (bρ 15) (396324613 / 1000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_15_16 :
    Uω (aρ 16) (bρ 16) (396324613 / 1000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_15 :
    Uρ (396324613 / 1000000000000 : ℝ) ≤
      (-(27930518333896095285283 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (396324613 / 1000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(10308997249903148058101 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (396324613 / 1000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(24887961647494144053291 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (396324613 / 1000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(11746208074433576911541 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (396324613 / 1000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(43626843011011594664449 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (396324613 / 1000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20049749814838098711663 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (396324613 / 1000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (396324613 / 1000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (396324613 / 1000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (396324613 / 1000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (396324613 / 1000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (396324613 / 1000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (396324613 / 1000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (396324613 / 1000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (396324613 / 1000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (396324613 / 1000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (396324613 / 1000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_15_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_16_1 :
    Uω (aρ 1) (bρ 1) (974522519 / 2000000000000 : ℝ) ≤
      (-(51712055896552965688933 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1774287399843 / 312500000000000 : ℝ) ≤
      (-(51712055896552965688933 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show (1774287399843 / 312500000000000 : ℝ) = (1774287399843 / 1220703125000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1774287399843 / 1220703125000 : ℝ) ≤
            (3739718527447034311067 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (3370611756247 / 625000000000000 : ℝ)) (q :=
      (1774287399843 / 312500000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_16_2 :
    Uω (aρ 2) (bρ 2) (974522519 / 2000000000000 : ℝ) ≤
      (-(49948197000145039205691 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (135458842723471 / 20000000000000000 : ℝ) ≤
      (-(49948197000145039205691 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (135458842723471 / 20000000000000000 : ℝ) =
            (135458842723471 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (135458842723471 / 78125000000000 : ℝ) ≤
            (5503577423854960794309 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (52065224723471 / 10000000000000000 : ℝ)) (q :=
      (135458842723471 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_16_3 :
    Uω (aρ 3) (bρ 3) (974522519 / 2000000000000 : ℝ) ≤
      (-(11792350042914402417241 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2794531439597 / 312500000000000 : ℝ) ≤
      (-(11792350042914402417241 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show (2794531439597 / 312500000000000 : ℝ) = (2794531439597 / 2441406250000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2794531439597 / 2441406250000 : ℝ) ≤
            (337725612335597582759 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (3003767986513 / 625000000000000 : ℝ)) (q :=
      (2794531439597 / 312500000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_16_4 :
    Uω (aρ 4) (bρ 4) (974522519 / 2000000000000 : ℝ) ≤
      (-(219200189839688302473 / 50000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (124753098670197 / 10000000000000000 : ℝ) ≤
      (-(219200189839688302473 / 50000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (124753098670197 / 10000000000000000 : ℝ) =
            (124753098670197 / 78125000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (124753098670197 / 78125000000000 : ℝ) ≤
            (23401323265311697527 / 50000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (20211145962697 / 5000000000000000 : ℝ)) (q :=
      (124753098670197 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_16_5 :
    Uω (aρ 5) (bρ 5) (974522519 / 2000000000000 : ℝ) ≤
      (-(808167918466123975469 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (351654077718997 / 20000000000000000 : ℝ) ≤
      (-(808167918466123975469 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (351654077718997 / 20000000000000000 : ℝ) =
            (351654077718997 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (351654077718997 / 312500000000000 : ℝ) ≤
            (23608697893876024531 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (24380252968997 / 10000000000000000 : ℝ)) (q :=
      (351654077718997 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_16_6 :
    Uω (aρ 6) (bρ 6) (974522519 / 2000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_16_7 :
    Uω (aρ 7) (bρ 7) (974522519 / 2000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_16_8 :
    Uω (aρ 8) (bρ 8) (974522519 / 2000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_16_9 :
    Uω (aρ 9) (bρ 9) (974522519 / 2000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_16_10 :
    Uω (aρ 10) (bρ 10) (974522519 / 2000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_16_11 :
    Uω (aρ 11) (bρ 11) (974522519 / 2000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_16_12 :
    Uω (aρ 12) (bρ 12) (974522519 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_16_13 :
    Uω (aρ 13) (bρ 13) (974522519 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_16_14 :
    Uω (aρ 14) (bρ 14) (974522519 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_16_15 :
    Uω (aρ 15) (bρ 15) (974522519 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_16_16 :
    Uω (aρ 16) (bρ 16) (974522519 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_16 :
    Uρ (974522519 / 2000000000000 : ℝ) ≤
      (-(27979010994860448204283 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (974522519 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(51712055896552965688933 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (974522519 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(49948197000145039205691 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (974522519 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(11792350042914402417241 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (974522519 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(219200189839688302473 / 50000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (974522519 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(808167918466123975469 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (974522519 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (974522519 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (974522519 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (974522519 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (974522519 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (974522519 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (974522519 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (974522519 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (974522519 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (974522519 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (974522519 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_16_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_17_1 :
    Uω (aρ 1) (bρ 1) (289098953 / 500000000000 : ℝ) ≤
      (-(1037645395330397781579 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27909474323909 / 5000000000000000 : ℝ) ≤
      (-(1037645395330397781579 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (27909474323909 / 5000000000000000 : ℝ) = (27909474323909 / 19531250000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27909474323909 / 19531250000000 : ℝ) ≤
            (71390093149602218421 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (13230664567659 / 2500000000000000 : ℝ)) (q :=
      (27909474323909 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_17_2 :
    Uω (aρ 2) (bρ 2) (289098953 / 500000000000 : ℝ) ≤
      (-(50125360529440552437197 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (133080139249959 / 20000000000000000 : ℝ) ≤
      (-(50125360529440552437197 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (133080139249959 / 20000000000000000 : ℝ) =
            (133080139249959 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (133080139249959 / 78125000000000 : ℝ) ≤
            (5326413894559447562803 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (50595887714959 / 10000000000000000 : ℝ)) (q :=
      (133080139249959 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_17_3 :
    Uω (aρ 3) (bρ 3) (289098953 / 500000000000 : ℝ) ≤
      (-(47363740868116265483369 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (175407785120543 / 20000000000000000 : ℝ) ≤
      (-(47363740868116265483369 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (175407785120543 / 20000000000000000 : ℝ) =
            (175407785120543 / 156250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (175407785120543 / 156250000000000 : ℝ) ≤
            (1156561752883734516631 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (45527427235543 / 10000000000000000 : ℝ)) (q :=
      (175407785120543 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_17_4 :
    Uω (aρ 4) (bρ 4) (289098953 / 500000000000 : ℝ) ≤
      (-(11019964131301389298539 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48718750950201 / 4000000000000000 : ℝ) ≤
      (-(11019964131301389298539 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (48718750950201 / 4000000000000000 : ℝ) = (48718750950201 / 31250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48718750950201 / 31250000000000 : ℝ) ≤
            (1110111523948610701461 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (7083843160201 / 2000000000000000 : ℝ)) (q :=
      (48718750950201 / 4000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_17_5 :
    Uω (aρ 5) (bρ 5) (289098953 / 500000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_17_6 :
    Uω (aρ 6) (bρ 6) (289098953 / 500000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_17_7 :
    Uω (aρ 7) (bρ 7) (289098953 / 500000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_17_8 :
    Uω (aρ 8) (bρ 8) (289098953 / 500000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_17_9 :
    Uω (aρ 9) (bρ 9) (289098953 / 500000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_17_10 :
    Uω (aρ 10) (bρ 10) (289098953 / 500000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_17_11 :
    Uω (aρ 11) (bρ 11) (289098953 / 500000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_17_12 :
    Uω (aρ 12) (bρ 12) (289098953 / 500000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_17_13 :
    Uω (aρ 13) (bρ 13) (289098953 / 500000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_17_14 :
    Uω (aρ 14) (bρ 14) (289098953 / 500000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_17_15 :
    Uω (aρ 15) (bρ 15) (289098953 / 500000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_17_16 :
    Uω (aρ 16) (bρ 16) (289098953 / 500000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_17 :
    Uρ (289098953 / 500000000000 : ℝ) ≤
      (-(14029924784689781065817 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (289098953 / 500000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1037645395330397781579 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (289098953 / 500000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(50125360529440552437197 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (289098953 / 500000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(47363740868116265483369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (289098953 / 500000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11019964131301389298539 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (289098953 / 500000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (289098953 / 500000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (289098953 / 500000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (289098953 / 500000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (289098953 / 500000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (289098953 / 500000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (289098953 / 500000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (289098953 / 500000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (289098953 / 500000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (289098953 / 500000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (289098953 / 500000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (289098953 / 500000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_17_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_18_1 :
    Uω (aρ 1) (bρ 1) (729961631 / 1000000000000 : ℝ) ≤
      (-(52173705525642853674791 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (54215661123871 / 10000000000000000 : ℝ) ≤
      (-(52173705525642853674791 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (54215661123871 / 10000000000000000 : ℝ) = (54215661123871 / 39062500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (54215661123871 / 39062500000000 : ℝ) ≤
            (3278068898357146325209 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (25616860236371 / 5000000000000000 : ℝ)) (q :=
      (54215661123871 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_18_2 :
    Uω (aρ 2) (bρ 2) (729961631 / 1000000000000 : ℝ) ≤
      (-(157603058690652939389 / 31250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (129048676752739 / 20000000000000000 : ℝ) ≤
      (-(157603058690652939389 / 31250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (129048676752739 / 20000000000000000 : ℝ) =
            (129048676752739 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (129048676752739 / 78125000000000 : ℝ) ≤
            (15683736384347060611 / 31250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (48082062467739 / 10000000000000000 : ℝ)) (q :=
      (129048676752739 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_18_3 :
    Uω (aρ 3) (bρ 3) (729961631 / 1000000000000 : ℝ) ≤
      (-(5964321618170938271907 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33872122933673 / 4000000000000000 : ℝ) ≤
      (-(5964321618170938271907 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (33872122933673 / 4000000000000000 : ℝ) = (33872122933673 / 31250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33872122933673 / 31250000000000 : ℝ) ≤
            (100716209454061728093 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (8199578806673 / 2000000000000000 : ℝ)) (q :=
      (33872122933673 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_18_4 :
    Uω (aρ 4) (bρ 4) (729961631 / 1000000000000 : ℝ) ≤
      (-(44582338407334756483981 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57914011427119 / 5000000000000000 : ℝ) ≤
      (-(44582338407334756483981 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (57914011427119 / 5000000000000000 : ℝ) = (57914011427119 / 39062500000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57914011427119 / 39062500000000 : ℝ) ≤
            (3937964213665243516019 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (6249786002119 / 2500000000000000 : ℝ)) (q :=
      (57914011427119 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_18_5 :
    Uω (aρ 5) (bρ 5) (729961631 / 1000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_18_6 :
    Uω (aρ 6) (bρ 6) (729961631 / 1000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_18_7 :
    Uω (aρ 7) (bρ 7) (729961631 / 1000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_18_8 :
    Uω (aρ 8) (bρ 8) (729961631 / 1000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_18_9 :
    Uω (aρ 9) (bρ 9) (729961631 / 1000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_18_10 :
    Uω (aρ 10) (bρ 10) (729961631 / 1000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_18_11 :
    Uω (aρ 11) (bρ 11) (729961631 / 1000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_18_12 :
    Uω (aρ 12) (bρ 12) (729961631 / 1000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_18_13 :
    Uω (aρ 13) (bρ 13) (729961631 / 1000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_18_14 :
    Uω (aρ 14) (bρ 14) (729961631 / 1000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_18_15 :
    Uω (aρ 15) (bρ 15) (729961631 / 1000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_18_16 :
    Uω (aρ 16) (bρ 16) (729961631 / 1000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_18 :
    Uρ (729961631 / 1000000000000 : ℝ) ≤
      (-(1124651582364191246041 / 400000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (729961631 / 1000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(52173705525642853674791 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (729961631 / 1000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) * (-(157603058690652939389 / 31250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (729961631 / 1000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5964321618170938271907 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (729961631 / 1000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(44582338407334756483981 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (729961631 / 1000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (729961631 / 1000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (729961631 / 1000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (729961631 / 1000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (729961631 / 1000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (729961631 / 1000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (729961631 / 1000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (729961631 / 1000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (729961631 / 1000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (729961631 / 1000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (729961631 / 1000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (729961631 / 1000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_18_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_19_1 :
    Uω (aρ 1) (bρ 1) (1611686987 / 2000000000000 : ℝ) ≤
      (-(26161527144129535042071 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26705986680359 / 5000000000000000 : ℝ) ≤
      (-(26161527144129535042071 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (26705986680359 / 5000000000000000 : ℝ) = (26705986680359 / 19531250000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26705986680359 / 19531250000000 : ℝ) ≤
            (1564360067870464957929 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (12596290892859 / 2500000000000000 : ℝ)) (q :=
      (26705986680359 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_19_2 :
    Uω (aρ 2) (bρ 2) (1611686987 / 2000000000000 : ℝ) ≤
      (-(10118588778586567237301 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (127000771489839 / 20000000000000000 : ℝ) ≤
      (-(10118588778586567237301 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (127000771489839 / 20000000000000000 : ℝ) =
            (127000771489839 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (127000771489839 / 78125000000000 : ℝ) ≤
            (971766106213432762699 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (46792975829839 / 10000000000000000 : ℝ)) (q :=
      (127000771489839 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_19_3 :
    Uω (aρ 3) (bρ 3) (1611686987 / 2000000000000 : ℝ) ≤
      (-(47905346243074077148493 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33232058051079 / 4000000000000000 : ℝ) ≤
      (-(47905346243074077148493 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (33232058051079 / 4000000000000000 : ℝ) = (33232058051079 / 31250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33232058051079 / 31250000000000 : ℝ) ≤
            (614956377925922851507 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (7711277649079 / 2000000000000000 : ℝ)) (q :=
      (33232058051079 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_19_4 :
    Uω (aρ 4) (bρ 4) (1611686987 / 2000000000000 : ℝ) ≤
      (-(8987625693749818873013 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55889713253743 / 5000000000000000 : ℝ) ≤
      (-(8987625693749818873013 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (55889713253743 / 5000000000000000 : ℝ) = (55889713253743 / 39062500000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55889713253743 / 39062500000000 : ℝ) ≤
            (716434830450181126987 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (4415192484993 / 2500000000000000 : ℝ)) (q :=
      (55889713253743 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_19_5 :
    Uω (aρ 5) (bρ 5) (1611686987 / 2000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_19_6 :
    Uω (aρ 6) (bρ 6) (1611686987 / 2000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_19_7 :
    Uω (aρ 7) (bρ 7) (1611686987 / 2000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_19_8 :
    Uω (aρ 8) (bρ 8) (1611686987 / 2000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_19_9 :
    Uω (aρ 9) (bρ 9) (1611686987 / 2000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_19_10 :
    Uω (aρ 10) (bρ 10) (1611686987 / 2000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_19_11 :
    Uω (aρ 11) (bρ 11) (1611686987 / 2000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_19_12 :
    Uω (aρ 12) (bρ 12) (1611686987 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_19_13 :
    Uω (aρ 13) (bρ 13) (1611686987 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_19_14 :
    Uω (aρ 14) (bρ 14) (1611686987 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_19_15 :
    Uω (aρ 15) (bρ 15) (1611686987 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_19_16 :
    Uω (aρ 16) (bρ 16) (1611686987 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_19 :
    Uρ (1611686987 / 2000000000000 : ℝ) ≤
      (-(1126058948715908662283 / 400000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1611686987 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(26161527144129535042071 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1611686987 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10118588778586567237301 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1611686987 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(47905346243074077148493 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1611686987 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8987625693749818873013 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1611686987 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1611686987 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1611686987 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1611686987 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1611686987 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1611686987 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1611686987 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1611686987 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1611686987 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1611686987 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1611686987 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1611686987 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_19_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_20_1 :
    Uω (aρ 1) (bρ 1) (220431339 / 250000000000 : ℝ) ≤
      (-(10494988835400103718169 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (52606829630367 / 10000000000000000 : ℝ) ≤
      (-(10494988835400103718169 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (52606829630367 / 10000000000000000 : ℝ) = (52606829630367 / 39062500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (52606829630367 / 39062500000000 : ℝ) ≤
            (595366049399896281831 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (24766847367867 / 5000000000000000 : ℝ)) (q :=
      (52606829630367 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_20_2 :
    Uω (aρ 2) (bρ 2) (220431339 / 250000000000 : ℝ) ≤
      (-(50757420127736585768143 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12492899522193 / 2000000000000000 : ℝ) ≤
      (-(50757420127736585768143 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (12492899522193 / 2000000000000000 : ℝ) = (12492899522193 / 7812500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12492899522193 / 7812500000000 : ℝ) ≤
            (4694354296263414231857 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (4548001818693 / 1000000000000000 : ℝ)) (q :=
      (12492899522193 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_20_3 :
    Uω (aρ 3) (bρ 3) (220431339 / 250000000000 : ℝ) ≤
      (-(24054501625710163523737 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (162810545224097 / 20000000000000000 : ℝ) ≤
      (-(24054501625710163523737 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (162810545224097 / 20000000000000000 : ℝ) =
            (162810545224097 / 156250000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (162810545224097 / 156250000000000 : ℝ) ≤
            (205649684789836476263 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (35965461839097 / 10000000000000000 : ℝ)) (q :=
      (162810545224097 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_20_4 :
    Uω (aρ 4) (bρ 4) (220431339 / 250000000000 : ℝ) ≤
      (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_4]) (by norm_num [bρ_4])]; exact Lmid_4

lemma U_20_5 :
    Uω (aρ 5) (bρ 5) (220431339 / 250000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_20_6 :
    Uω (aρ 6) (bρ 6) (220431339 / 250000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_20_7 :
    Uω (aρ 7) (bρ 7) (220431339 / 250000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_20_8 :
    Uω (aρ 8) (bρ 8) (220431339 / 250000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_20_9 :
    Uω (aρ 9) (bρ 9) (220431339 / 250000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_20_10 :
    Uω (aρ 10) (bρ 10) (220431339 / 250000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_20_11 :
    Uω (aρ 11) (bρ 11) (220431339 / 250000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_20_12 :
    Uω (aρ 12) (bρ 12) (220431339 / 250000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_20_13 :
    Uω (aρ 13) (bρ 13) (220431339 / 250000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_20_14 :
    Uω (aρ 14) (bρ 14) (220431339 / 250000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_20_15 :
    Uω (aρ 15) (bρ 15) (220431339 / 250000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_20_16 :
    Uω (aρ 16) (bρ 16) (220431339 / 250000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_20 :
    Uρ (220431339 / 250000000000 : ℝ) ≤
      (-(7054177370793323835461 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (220431339 / 250000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(10494988835400103718169 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (220431339 / 250000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(50757420127736585768143 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (220431339 / 250000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(24054501625710163523737 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (220431339 / 250000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (220431339 / 250000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (220431339 / 250000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (220431339 / 250000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (220431339 / 250000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (220431339 / 250000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (220431339 / 250000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (220431339 / 250000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (220431339 / 250000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (220431339 / 250000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (220431339 / 250000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (220431339 / 250000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (220431339 / 250000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_20_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_21_1 :
    Uω (aρ 1) (bρ 1) (4047462733 / 4000000000000 : ℝ) ≤
      (-(329635258503986697477 / 62500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (102444728028721 / 20000000000000000 : ℝ) ≤
      (-(329635258503986697477 / 62500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (102444728028721 / 20000000000000000 : ℝ) =
            (102444728028721 / 78125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (102444728028721 / 78125000000000 : ℝ) ≤
            (16938331646013302523 / 62500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (48066166776221 / 10000000000000000 : ℝ)) (q :=
      (102444728028721 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_21_2 :
    Uω (aρ 2) (bρ 2) (4047462733 / 4000000000000 : ℝ) ≤
      (-(25525528995361187317657 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12131394246941 / 2000000000000000 : ℝ) ≤
      (-(25525528995361187317657 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (12131394246941 / 2000000000000000 : ℝ) = (12131394246941 / 7812500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12131394246941 / 7812500000000 : ℝ) ≤
            (2200358216638812682343 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (4316636870691 / 1000000000000000 : ℝ)) (q :=
      (12131394246941 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_21_3 :
    Uω (aρ 3) (bρ 3) (4047462733 / 4000000000000 : ℝ) ≤
      (-(48497352170934822805119 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (78304506299861 / 10000000000000000 : ℝ) ≤
      (-(48497352170934822805119 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 7
        (show
          (78304506299861 / 10000000000000000 : ℝ) = (78304506299861 / 78125000000000 : ℝ) / 2 ^ 7
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (78304506299861 / 78125000000000 : ℝ) ≤
            (22950450065177194881 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (15532666243611 / 5000000000000000 : ℝ)) (q :=
      (78304506299861 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_21_4 :
    Uω (aρ 4) (bρ 4) (4047462733 / 4000000000000 : ℝ) ≤
      (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_4]) (by norm_num [bρ_4])]; exact Lmid_4

lemma U_21_5 :
    Uω (aρ 5) (bρ 5) (4047462733 / 4000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_21_6 :
    Uω (aρ 6) (bρ 6) (4047462733 / 4000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_21_7 :
    Uω (aρ 7) (bρ 7) (4047462733 / 4000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_21_8 :
    Uω (aρ 8) (bρ 8) (4047462733 / 4000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_21_9 :
    Uω (aρ 9) (bρ 9) (4047462733 / 4000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_21_10 :
    Uω (aρ 10) (bρ 10) (4047462733 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_21_11 :
    Uω (aρ 11) (bρ 11) (4047462733 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_21_12 :
    Uω (aρ 12) (bρ 12) (4047462733 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_21_13 :
    Uω (aρ 13) (bρ 13) (4047462733 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_21_14 :
    Uω (aρ 14) (bρ 14) (4047462733 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_21_15 :
    Uω (aρ 15) (bρ 15) (4047462733 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_21_16 :
    Uω (aρ 16) (bρ 16) (4047462733 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_21 :
    Uρ (4047462733 / 4000000000000 : ℝ) ≤
      (-(28244841495459020605873 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4047462733 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(329635258503986697477 / 62500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4047462733 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(25525528995361187317657 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4047462733 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(48497352170934822805119 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4047462733 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4047462733 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4047462733 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4047462733 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4047462733 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4047462733 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4047462733 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4047462733 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4047462733 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4047462733 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4047462733 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4047462733 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4047462733 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_21_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_22_1 :
    Uω (aρ 1) (bρ 1) (2284012021 / 2000000000000 : ℝ) ≤
      (-(2650831856230185575557 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49832962239517 / 10000000000000000 : ℝ) ≤
      (-(2650831856230185575557 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (49832962239517 / 10000000000000000 : ℝ) = (49832962239517 / 39062500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49832962239517 / 39062500000000 : ℝ) ≤
            (121756864969814424443 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (23294383249517 / 5000000000000000 : ℝ)) (q :=
      (49832962239517 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_22_2 :
    Uω (aρ 2) (bρ 2) (2284012021 / 2000000000000 : ℝ) ≤
      (-(51361201358950362094901 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58804608871521 / 10000000000000000 : ℝ) ≤
      (-(51361201358950362094901 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (58804608871521 / 10000000000000000 : ℝ) = (58804608871521 / 39062500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58804608871521 / 39062500000000 : ℝ) ≤
            (4090573065049637905099 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (20381523626521 / 5000000000000000 : ℝ)) (q :=
      (58804608871521 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_22_3 :
    Uω (aρ 3) (bρ 3) (2284012021 / 2000000000000 : ℝ) ≤
      (-(979184520167902038687 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37385038657803 / 5000000000000000 : ℝ) ≤
      (-(979184520167902038687 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (37385038657803 / 5000000000000000 : ℝ) = (37385038657803 / 19531250000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37385038657803 / 19531250000000 : ℝ) ≤
            (129850968312097961313 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (6324469447803 / 2500000000000000 : ℝ)) (q :=
      (37385038657803 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_22_4 :
    Uω (aρ 4) (bρ 4) (2284012021 / 2000000000000 : ℝ) ≤
      (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_4]) (by norm_num [bρ_4])]; exact Lmid_4

lemma U_22_5 :
    Uω (aρ 5) (bρ 5) (2284012021 / 2000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_22_6 :
    Uω (aρ 6) (bρ 6) (2284012021 / 2000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_22_7 :
    Uω (aρ 7) (bρ 7) (2284012021 / 2000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_22_8 :
    Uω (aρ 8) (bρ 8) (2284012021 / 2000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_22_9 :
    Uω (aρ 9) (bρ 9) (2284012021 / 2000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_22_10 :
    Uω (aρ 10) (bρ 10) (2284012021 / 2000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_22_11 :
    Uω (aρ 11) (bρ 11) (2284012021 / 2000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_22_12 :
    Uω (aρ 12) (bρ 12) (2284012021 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_22_13 :
    Uω (aρ 13) (bρ 13) (2284012021 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_22_14 :
    Uω (aρ 14) (bρ 14) (2284012021 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_22_15 :
    Uω (aρ 15) (bρ 15) (2284012021 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_22_16 :
    Uω (aρ 16) (bρ 16) (2284012021 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_22 :
    Uρ (2284012021 / 2000000000000 : ℝ) ≤
      (-(2827670396385794487423 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2284012021 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2650831856230185575557 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2284012021 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(51361201358950362094901 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2284012021 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(979184520167902038687 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2284012021 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2284012021 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2284012021 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2284012021 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2284012021 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2284012021 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2284012021 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2284012021 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2284012021 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2284012021 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2284012021 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2284012021 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2284012021 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_22_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_23_1 :
    Uω (aρ 1) (bρ 1) (5088585351 / 4000000000000 : ℝ) ≤
      (-(26650264330778109932447 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48438139215859 / 10000000000000000 : ℝ) ≤
      (-(26650264330778109932447 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (48438139215859 / 10000000000000000 : ℝ) = (48438139215859 / 39062500000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48438139215859 / 39062500000000 : ℝ) ≤
            (1075622881221890067553 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (22550261862109 / 5000000000000000 : ℝ)) (q :=
      (48438139215859 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_23_2 :
    Uω (aρ 2) (bρ 2) (5088585351 / 4000000000000 : ℝ) ≤
      (-(206762531076714809157 / 40000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4551916935163 / 800000000000000 : ℝ) ≤
      (-(206762531076714809157 / 40000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show (4551916935163 / 800000000000000 : ℝ) = (4551916935163 / 3125000000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4551916935163 / 3125000000000 : ℝ) ≤
            (15044566619285190843 / 40000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (1530126246463 / 400000000000000 : ℝ)) (q :=
      (4551916935163 / 800000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_23_3 :
    Uω (aρ 3) (bρ 3) (5088585351 / 4000000000000 : ℝ) ≤
      (-(49562765747407728412987 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35195443021111 / 5000000000000000 : ℝ) ≤
      (-(49562765747407728412987 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 8
        (show
          (35195443021111 / 5000000000000000 : ℝ) = (35195443021111 / 19531250000000 : ℝ) / 2 ^ 8
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35195443021111 / 19531250000000 : ℝ) ≤
            (5889008676592271587013 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_left_certificate (s := (1115056157309 / 625000000000000 : ℝ)) (q :=
      (35195443021111 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_23_4 :
    Uω (aρ 4) (bρ 4) (5088585351 / 4000000000000 : ℝ) ≤
      (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_4]) (by norm_num [bρ_4])]; exact Lmid_4

lemma U_23_5 :
    Uω (aρ 5) (bρ 5) (5088585351 / 4000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_23_6 :
    Uω (aρ 6) (bρ 6) (5088585351 / 4000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_23_7 :
    Uω (aρ 7) (bρ 7) (5088585351 / 4000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_23_8 :
    Uω (aρ 8) (bρ 8) (5088585351 / 4000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_23_9 :
    Uω (aρ 9) (bρ 9) (5088585351 / 4000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_23_10 :
    Uω (aρ 10) (bρ 10) (5088585351 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_23_11 :
    Uω (aρ 11) (bρ 11) (5088585351 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_23_12 :
    Uω (aρ 12) (bρ 12) (5088585351 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_23_13 :
    Uω (aρ 13) (bρ 13) (5088585351 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_23_14 :
    Uω (aρ 14) (bρ 14) (5088585351 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_23_15 :
    Uω (aρ 15) (bρ 15) (5088585351 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_23_16 :
    Uω (aρ 16) (bρ 16) (5088585351 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_23 :
    Uρ (5088585351 / 4000000000000 : ℝ) ≤
      (-(14157655382134504069693 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5088585351 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(26650264330778109932447 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5088585351 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) * (-(206762531076714809157 / 40000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5088585351 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(49562765747407728412987 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5088585351 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11449496158609380585237 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5088585351 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5088585351 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5088585351 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5088585351 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5088585351 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5088585351 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5088585351 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5088585351 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5088585351 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5088585351 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5088585351 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5088585351 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_23_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
