/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U07) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_88_1 :
    Uω (aρ 1) (bρ 1) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(31934091820714900994499 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (131301591905011 / 3200000000000000 : ℝ) ≤
      (-(31934091820714900994499 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (131301591905011 / 3200000000000000 : ℝ) =
            (131301591905011 / 100000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (131301591905011 / 100000000000000 : ℝ) ≤
            (2723267194285099005501 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4099234678821 / 100000000000000 : ℝ)) (q :=
      (131301591905011 / 3200000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_88_2 :
    Uω (aρ 2) (bρ 2) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(254627088457477178169 / 78125000000000000000 : ℝ)) := by
  have hlg :
    Real.log (614689503320911 / 16000000000000000 : ℝ) ≤
      (-(254627088457477178169 / 78125000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (614689503320911 / 16000000000000000 : ℝ) =
            (614689503320911 / 500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (614689503320911 / 500000000000000 : ℝ) ≤
            (16133528847210321831 / 78125000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (9535485253423 / 250000000000000 : ℝ)) (q :=
      (614689503320911 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_88_3 :
    Uω (aρ 3) (bρ 3) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(34164784516352722640813 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2626226911586943 / 80000000000000000 : ℝ) ≤
      (-(34164784516352722640813 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2626226911586943 / 80000000000000000 : ℝ) =
            (2626226911586943 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2626226911586943 / 2500000000000000 : ℝ) ≤
            (492574498647277359187 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (317010365232517 / 10000000000000000 : ℝ)) (q :=
      (2626226911586943 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_88_4 :
    Uω (aρ 4) (bρ 4) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(1928027625307929110733 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1692101728321819 / 80000000000000000 : ℝ) ≤
      (-(1928027625307929110733 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (1692101728321819 / 80000000000000000 : ℝ) =
            (1692101728321819 / 1250000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1692101728321819 / 1250000000000000 : ℝ) ≤
            (151413915592070889267 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (40443312620309 / 2500000000000000 : ℝ)) (q :=
      (1692101728321819 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_88_5 :
    Uω (aρ 5) (bρ 5) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_88_6 :
    Uω (aρ 6) (bρ 6) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_88_7 :
    Uω (aρ 7) (bρ 7) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_88_8 :
    Uω (aρ 8) (bρ 8) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_88_9 :
    Uω (aρ 9) (bρ 9) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_88_10 :
    Uω (aρ 10) (bρ 10) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_88_11 :
    Uω (aρ 11) (bρ 11) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_88_12 :
    Uω (aρ 12) (bρ 12) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_88_13 :
    Uω (aρ 13) (bρ 13) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_88_14 :
    Uω (aρ 14) (bρ 14) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_88_15 :
    Uω (aρ 15) (bρ 15) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_88_16 :
    Uω (aρ 16) (bρ 16) (3041335677499 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_88 :
    Uρ (3041335677499 / 64000000000000 : ℝ) ≤
      (-(826419256172916514983 / 312500000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3041335677499 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(31934091820714900994499 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3041335677499 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) * (-(254627088457477178169 / 78125000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3041335677499 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(34164784516352722640813 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3041335677499 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1928027625307929110733 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3041335677499 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3041335677499 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3041335677499 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3041335677499 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3041335677499 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3041335677499 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3041335677499 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3041335677499 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3041335677499 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3041335677499 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3041335677499 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3041335677499 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_88_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_89_1 :
    Uω (aρ 1) (bρ 1) (191579824301 / 4000000000000 : ℝ) ≤
      (-(796081223438251080513 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (414061898909553 / 10000000000000000 : ℝ) ≤
      (-(796081223438251080513 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (414061898909553 / 10000000000000000 : ℝ) =
            (414061898909553 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (414061898909553 / 312500000000000 : ℝ) ≤
            (70352751936748919487 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (206835727575803 / 5000000000000000 : ℝ)) (q :=
      (414061898909553 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_89_2 :
    Uω (aρ 2) (bρ 2) (191579824301 / 4000000000000 : ℝ) ≤
      (-(6498934924237707349841 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (387948620148739 / 10000000000000000 : ℝ) ≤
      (-(6498934924237707349841 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (387948620148739 / 10000000000000000 : ℝ) =
            (387948620148739 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (387948620148739 / 312500000000000 : ℝ) ≤
            (432536878762292650159 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (192606955069989 / 5000000000000000 : ℝ)) (q :=
      (387948620148739 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_89_3 :
    Uω (aρ 3) (bρ 3) (191579824301 / 4000000000000 : ℝ) ≤
      (-(17023759633831421878791 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1297463233747 / 39062500000000 : ℝ) ≤
      (-(17023759633831421878791 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show (1297463233747 / 39062500000000 : ℝ) = (1297463233747 / 1220703125000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1297463233747 / 1220703125000 : ℝ) ≤
            (304919873668578121209 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (80253487967741 / 2500000000000000 : ℝ)) (q :=
      (1297463233747 / 39062500000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_89_4 :
    Uω (aρ 4) (bρ 4) (191579824301 / 4000000000000 : ℝ) ≤
      (-(19166747049474907076563 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (216370228340183 / 10000000000000000 : ℝ) ≤
      (-(19166747049474907076563 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (216370228340183 / 10000000000000000 : ℝ) =
            (216370228340183 / 156250000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (216370228340183 / 156250000000000 : ℝ) ≤
            (1627668359525092923437 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (83873706968933 / 5000000000000000 : ℝ)) (q :=
      (216370228340183 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_89_5 :
    Uω (aρ 5) (bρ 5) (191579824301 / 4000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_89_6 :
    Uω (aρ 6) (bρ 6) (191579824301 / 4000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_89_7 :
    Uω (aρ 7) (bρ 7) (191579824301 / 4000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_89_8 :
    Uω (aρ 8) (bρ 8) (191579824301 / 4000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_89_9 :
    Uω (aρ 9) (bρ 9) (191579824301 / 4000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_89_10 :
    Uω (aρ 10) (bρ 10) (191579824301 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_89_11 :
    Uω (aρ 11) (bρ 11) (191579824301 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_89_12 :
    Uω (aρ 12) (bρ 12) (191579824301 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_89_13 :
    Uω (aρ 13) (bρ 13) (191579824301 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_89_14 :
    Uω (aρ 14) (bρ 14) (191579824301 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_89_15 :
    Uω (aρ 15) (bρ 15) (191579824301 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_89_16 :
    Uω (aρ 16) (bρ 16) (191579824301 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_89 :
    Uρ (191579824301 / 4000000000000 : ℝ) ≤
      (-(26423334234748999464827 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (191579824301 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(796081223438251080513 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (191579824301 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6498934924237707349841 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (191579824301 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(17023759633831421878791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (191579824301 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19166747049474907076563 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (191579824301 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (191579824301 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (191579824301 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (191579824301 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (191579824301 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (191579824301 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (191579824301 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (191579824301 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (191579824301 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (191579824301 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (191579824301 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (191579824301 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_89_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_90_1 :
    Uω (aρ 1) (bρ 1) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(31753225403554109637937 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3342450073533213 / 80000000000000000 : ℝ) ≤
      (-(31753225403554109637937 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (3342450073533213 / 80000000000000000 : ℝ) =
            (3342450073533213 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3342450073533213 / 2500000000000000 : ℝ) ≤
            (2904133611445890362063 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (208709657286261 / 5000000000000000 : ℝ)) (q :=
      (3342450073533213 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_90_2 :
    Uω (aρ 2) (bρ 2) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(16199019208965554918851 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3133726249682913 / 80000000000000000 : ℝ) ≤
      (-(16199019208965554918851 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (3133726249682913 / 80000000000000000 : ℝ) =
            (3133726249682913 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3133726249682913 / 2500000000000000 : ℝ) ≤
            (1129660298534445081149 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (389007371119947 / 10000000000000000 : ℝ)) (q :=
      (3133726249682913 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_90_3 :
    Uω (aρ 3) (bρ 3) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(6786341272376926062427 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2688157452933953 / 80000000000000000 : ℝ) ≤
      (-(6786341272376926062427 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2688157452933953 / 80000000000000000 : ℝ) =
            (2688157452933953 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2688157452933953 / 2500000000000000 : ℝ) ≤
            (145130530623073937573 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (325011278282707 / 10000000000000000 : ℝ)) (q :=
      (2688157452933953 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_90_4 :
    Uω (aρ 4) (bρ 4) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(9528575281149508014001 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1769322173922313 / 80000000000000000 : ℝ) ≤
      (-(9528575281149508014001 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (1769322173922313 / 80000000000000000 : ℝ) =
            (1769322173922313 / 1250000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1769322173922313 / 1250000000000000 : ℝ) ≤
            (868632423350491985999 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (173596639594797 / 10000000000000000 : ℝ)) (q :=
      (1769322173922313 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_90_5 :
    Uω (aρ 5) (bρ 5) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_90_6 :
    Uω (aρ 6) (bρ 6) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_90_7 :
    Uω (aρ 7) (bρ 7) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_90_8 :
    Uω (aρ 8) (bρ 8) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_90_9 :
    Uω (aρ 9) (bρ 9) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_90_10 :
    Uω (aρ 10) (bρ 10) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_90_11 :
    Uω (aρ 11) (bρ 11) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_90_12 :
    Uω (aρ 12) (bρ 12) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_90_13 :
    Uω (aρ 13) (bρ 13) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_90_14 :
    Uω (aρ 14) (bρ 14) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_90_15 :
    Uω (aρ 15) (bρ 15) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_90_16 :
    Uω (aρ 16) (bρ 16) (3089218700133 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_90 :
    Uρ (3089218700133 / 64000000000000 : ℝ) ≤
      (-(13200904617235475791283 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3089218700133 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(31753225403554109637937 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3089218700133 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(16199019208965554918851 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3089218700133 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6786341272376926062427 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3089218700133 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9528575281149508014001 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3089218700133 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3089218700133 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3089218700133 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3089218700133 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3089218700133 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3089218700133 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3089218700133 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3089218700133 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3089218700133 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3089218700133 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3089218700133 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3089218700133 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_90_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_91_1 :
    Uω (aρ 1) (bρ 1) (62263204229 / 1280000000000 : ℝ) ≤
      (-(1583200327193589922537 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (67448089160959 / 1600000000000000 : ℝ) ≤
      (-(1583200327193589922537 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (67448089160959 / 1600000000000000 : ℝ) = (67448089160959 / 50000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (67448089160959 / 50000000000000 : ℝ) ≤
            (149667623556410077463 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (16846681982317 / 400000000000000 : ℝ)) (q :=
      (67448089160959 / 1600000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_91_2 :
    Uω (aρ 2) (bρ 2) (62263204229 / 1280000000000 : ℝ) ≤
      (-(16151169947406386751941 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1581929751247923 / 40000000000000000 : ℝ) ≤
      (-(16151169947406386751941 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1581929751247923 / 40000000000000000 : ℝ) =
            (1581929751247923 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1581929751247923 / 1250000000000000 : ℝ) ≤
            (1177509560093613248059 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (392799823179899 / 10000000000000000 : ℝ)) (q :=
      (1581929751247923 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_91_3 :
    Uω (aρ 3) (bρ 3) (62263204229 / 1280000000000 : ℝ) ≤
      (-(1056790878554544750231 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (271908607497609 / 8000000000000000 : ℝ) ≤
      (-(1056790878554544750231 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (271908607497609 / 8000000000000000 : ℝ) =
            (271908607497609 / 250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (271908607497609 / 250000000000000 : ℝ) ≤
            (26251590664205249769 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (8225064316249 / 250000000000000 : ℝ)) (q :=
      (271908607497609 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_91_4 :
    Uω (aρ 4) (bρ 4) (62263204229 / 1280000000000 : ℝ) ≤
      (-(37902304216173367332429 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (903615836022631 / 40000000000000000 : ℝ) ≤
      (-(37902304216173367332429 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (903615836022631 / 40000000000000000 : ℝ) =
            (903615836022631 / 625000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (903615836022631 / 625000000000000 : ℝ) ≤
            (3686526601826632667571 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (179333152982253 / 10000000000000000 : ℝ)) (q :=
      (903615836022631 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_91_5 :
    Uω (aρ 5) (bρ 5) (62263204229 / 1280000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_91_6 :
    Uω (aρ 6) (bρ 6) (62263204229 / 1280000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_91_7 :
    Uω (aρ 7) (bρ 7) (62263204229 / 1280000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_91_8 :
    Uω (aρ 8) (bρ 8) (62263204229 / 1280000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_91_9 :
    Uω (aρ 9) (bρ 9) (62263204229 / 1280000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_91_10 :
    Uω (aρ 10) (bρ 10) (62263204229 / 1280000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_91_11 :
    Uω (aρ 11) (bρ 11) (62263204229 / 1280000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_91_12 :
    Uω (aρ 12) (bρ 12) (62263204229 / 1280000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_91_13 :
    Uω (aρ 13) (bρ 13) (62263204229 / 1280000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_91_14 :
    Uω (aρ 14) (bρ 14) (62263204229 / 1280000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_91_15 :
    Uω (aρ 15) (bρ 15) (62263204229 / 1280000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_91_16 :
    Uω (aρ 16) (bρ 16) (62263204229 / 1280000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_91 :
    Uρ (62263204229 / 1280000000000 : ℝ) ≤
      (-(412199998590688327739 / 156250000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (62263204229 / 1280000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1583200327193589922537 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (62263204229 / 1280000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(16151169947406386751941 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (62263204229 / 1280000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1056790878554544750231 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (62263204229 / 1280000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(37902304216173367332429 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (62263204229 / 1280000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (62263204229 / 1280000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (62263204229 / 1280000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (62263204229 / 1280000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (62263204229 / 1280000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (62263204229 / 1280000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (62263204229 / 1280000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (62263204229 / 1280000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (62263204229 / 1280000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (62263204229 / 1280000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (62263204229 / 1280000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (62263204229 / 1280000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_91_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_92_1 :
    Uω (aρ 1) (bρ 1) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(31575578075022150256599 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3402358357990847 / 80000000000000000 : ℝ) ≤
      (-(31575578075022150256599 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (3402358357990847 / 80000000000000000 : ℝ) =
            (3402358357990847 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3402358357990847 / 2500000000000000 : ℝ) ≤
            (3081780939977849743401 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (26557166462523 / 625000000000000 : ℝ)) (q :=
      (3402358357990847 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_92_2 :
    Uω (aρ 2) (bρ 2) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(16103780395389085637527 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3193988835403747 / 80000000000000000 : ℝ) ≤
      (-(16103780395389085637527 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (3193988835403747 / 80000000000000000 : ℝ) =
            (3193988835403747 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3193988835403747 / 2500000000000000 : ℝ) ≤
            (1224899112110914362473 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (396591295263593 / 10000000000000000 : ℝ)) (q :=
      (3193988835403747 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_92_3 :
    Uω (aρ 3) (bρ 3) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(33704288357139015076803 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2749991436463211 / 80000000000000000 : ℝ) ≤
      (-(33704288357139015076803 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2749991436463211 / 80000000000000000 : ℝ) =
            (2749991436463211 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2749991436463211 / 2500000000000000 : ℝ) ≤
            (953070657860984923197 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (332988051878459 / 10000000000000000 : ℝ)) (q :=
      (2749991436463211 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_92_4 :
    Uω (aρ 4) (bρ 4) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(18848462387150699761219 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1844732269690687 / 80000000000000000 : ℝ) ≤
      (-(18848462387150699761219 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (1844732269690687 / 80000000000000000 : ℝ) =
            (1844732269690687 / 1250000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1844732269690687 / 1250000000000000 : ℝ) ≤
            (1945953021849300238781 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (23120930156291 / 1250000000000000 : ℝ)) (q :=
      (1844732269690687 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_92_5 :
    Uω (aρ 5) (bρ 5) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_92_6 :
    Uω (aρ 6) (bρ 6) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_92_7 :
    Uω (aρ 7) (bρ 7) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_92_8 :
    Uω (aρ 8) (bρ 8) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_92_9 :
    Uω (aρ 9) (bρ 9) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_92_10 :
    Uω (aρ 10) (bρ 10) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_92_11 :
    Uω (aρ 11) (bρ 11) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_92_12 :
    Uω (aρ 12) (bρ 12) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_92_13 :
    Uω (aρ 13) (bρ 13) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_92_14 :
    Uω (aρ 14) (bρ 14) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_92_15 :
    Uω (aρ 15) (bρ 15) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_92_16 :
    Uω (aρ 16) (bρ 16) (3137101722767 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_92 :
    Uρ (3137101722767 / 64000000000000 : ℝ) ≤
      (-(13180135171331573725517 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3137101722767 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(31575578075022150256599 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3137101722767 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(16103780395389085637527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3137101722767 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(33704288357139015076803 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3137101722767 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18848462387150699761219 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3137101722767 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3137101722767 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3137101722767 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3137101722767 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3137101722767 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3137101722767 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3137101722767 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3137101722767 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3137101722767 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3137101722767 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3137101722767 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3137101722767 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_92_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_93_1 :
    Uω (aρ 1) (bρ 1) (790260808521 / 16000000000000 : ℝ) ≤
      (-(31487926091174342905069 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (429038973258891 / 10000000000000000 : ℝ) ≤
      (-(31487926091174342905069 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (429038973258891 / 10000000000000000 : ℝ) =
            (429038973258891 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (429038973258891 / 312500000000000 : ℝ) ≤
            (3169432923825657094931 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (428662159277157 / 10000000000000000 : ℝ)) (q :=
      (429038973258891 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_93_2 :
    Uω (aρ 2) (bρ 2) (790260808521 / 16000000000000 : ℝ) ≤
      (-(32113683379671497832899 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32241143597669 / 800000000000000 : ℝ) ≤
      (-(32113683379671497832899 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (32241143597669 / 800000000000000 : ℝ) = (32241143597669 / 25000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32241143597669 / 25000000000000 : ℝ) ≤
            (2543675635328502167101 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4003818152111 / 100000000000000 : ℝ)) (q :=
      (32241143597669 / 800000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_93_3 :
    Uω (aρ 3) (bρ 3) (790260808521 / 16000000000000 : ℝ) ≤
      (-(1679630618076205600743 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (139043718136819 / 4000000000000000 : ℝ) ≤
      (-(1679630618076205600743 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (139043718136819 / 4000000000000000 : ℝ) =
            (139043718136819 / 125000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (139043718136819 / 125000000000000 : ℝ) ≤
            (53237332673794399257 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33696792230347 / 1000000000000000 : ℝ)) (q :=
      (139043718136819 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_93_4 :
    Uω (aρ 4) (bρ 4) (790260808521 / 16000000000000 : ℝ) ≤
      (-(18748829261004226629189 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (117616265462433 / 5000000000000000 : ℝ) ≤
      (-(18748829261004226629189 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (117616265462433 / 5000000000000000 : ℝ) =
            (117616265462433 / 78125000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (117616265462433 / 78125000000000 : ℝ) ≤
            (2045586147995773370811 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (190508574534107 / 10000000000000000 : ℝ)) (q :=
      (117616265462433 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_93_5 :
    Uω (aρ 5) (bρ 5) (790260808521 / 16000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_93_6 :
    Uω (aρ 6) (bρ 6) (790260808521 / 16000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_93_7 :
    Uω (aρ 7) (bρ 7) (790260808521 / 16000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_93_8 :
    Uω (aρ 8) (bρ 8) (790260808521 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_93_9 :
    Uω (aρ 9) (bρ 9) (790260808521 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_93_10 :
    Uω (aρ 10) (bρ 10) (790260808521 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_93_11 :
    Uω (aρ 11) (bρ 11) (790260808521 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_93_12 :
    Uω (aρ 12) (bρ 12) (790260808521 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_93_13 :
    Uω (aρ 13) (bρ 13) (790260808521 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_93_14 :
    Uω (aρ 14) (bρ 14) (790260808521 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_93_15 :
    Uω (aρ 15) (bρ 15) (790260808521 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_93_16 :
    Uω (aρ 16) (bρ 16) (790260808521 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_93 :
    Uρ (790260808521 / 16000000000000 : ℝ) ≤
      (-(26340189022211827785901 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (790260808521 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(31487926091174342905069 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (790260808521 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(32113683379671497832899 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (790260808521 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1679630618076205600743 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (790260808521 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18748829261004226629189 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (790260808521 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (790260808521 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (790260808521 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (790260808521 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (790260808521 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (790260808521 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (790260808521 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (790260808521 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (790260808521 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (790260808521 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (790260808521 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (790260808521 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_93_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_94_1 :
    Uω (aρ 1) (bρ 1) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(15700518525454701202457 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (692452950911409 / 16000000000000000 : ℝ) ≤
      (-(15700518525454701202457 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (692452950911409 / 16000000000000000 : ℝ) =
            (692452950911409 / 500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (692452950911409 / 500000000000000 : ℝ) ≤
            (1628160982045298797543 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (86481908051071 / 2000000000000000 : ℝ)) (q :=
      (692452950911409 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_94_2 :
    Uω (aρ 2) (bρ 2) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(32020690449308287470393 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3254236182740573 / 80000000000000000 : ℝ) ≤
      (-(32020690449308287470393 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (3254236182740573 / 80000000000000000 : ℝ) =
            (3254236182740573 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3254236182740573 / 2500000000000000 : ℝ) ≤
            (2636668565691712529607 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (404171409811237 / 10000000000000000 : ℝ)) (q :=
      (3254236182740573 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_94_3 :
    Uω (aρ 3) (bρ 3) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(6696449350830705340347 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2811735639464453 / 80000000000000000 : ℝ) ≤
      (-(6696449350830705340347 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2811735639464453 / 80000000000000000 : ℝ) =
            (2811735639464453 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2811735639464453 / 2500000000000000 : ℝ) ≤
            (235022452169294659653 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (340942380342207 / 10000000000000000 : ℝ)) (q :=
      (2811735639464453 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_94_4 :
    Uω (aρ 4) (bρ 4) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(37304062711062346239319 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1918647214652921 / 80000000000000000 : ℝ) ≤
      (-(37304062711062346239319 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (1918647214652921 / 80000000000000000 : ℝ) =
            (1918647214652921 / 1250000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1918647214652921 / 1250000000000000 : ℝ) ≤
            (4284768106937653760681 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (48991113801081 / 2500000000000000 : ℝ)) (q :=
      (1918647214652921 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_94_5 :
    Uω (aρ 5) (bρ 5) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_94_6 :
    Uω (aρ 6) (bρ 6) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_94_7 :
    Uω (aρ 7) (bρ 7) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_94_8 :
    Uω (aρ 8) (bρ 8) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_94_9 :
    Uω (aρ 9) (bρ 9) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_94_10 :
    Uω (aρ 10) (bρ 10) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_94_11 :
    Uω (aρ 11) (bρ 11) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_94_12 :
    Uω (aρ 12) (bρ 12) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_94_13 :
    Uω (aρ 13) (bρ 13) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_94_14 :
    Uω (aρ 14) (bρ 14) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_94_15 :
    Uω (aρ 15) (bρ 15) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_94_16 :
    Uω (aρ 16) (bρ 16) (3184984745401 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_94 :
    Uρ (3184984745401 / 64000000000000 : ℝ) ≤
      (-(6580132024030622994311 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3184984745401 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(15700518525454701202457 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3184984745401 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(32020690449308287470393 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3184984745401 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6696449350830705340347 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3184984745401 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(37304062711062346239319 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3184984745401 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3184984745401 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3184984745401 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3184984745401 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3184984745401 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3184984745401 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3184984745401 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3184984745401 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3184984745401 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3184984745401 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3184984745401 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3184984745401 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_94_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_95_1 :
    Uω (aρ 1) (bρ 1) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(31314897764576203369223 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1746108637647431 / 40000000000000000 : ℝ) ≤
      (-(31314897764576203369223 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1746108637647431 / 40000000000000000 : ℝ) =
            (1746108637647431 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1746108637647431 / 1250000000000000 : ℝ) ≤
            (3342461250423796630777 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (27259800581033 / 625000000000000 : ℝ)) (q :=
      (1746108637647431 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_95_2 :
    Uω (aρ 2) (bρ 2) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(1995535330098219433187 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1642177203736419 / 40000000000000000 : ℝ) ≤
      (-(1995535330098219433187 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1642177203736419 / 40000000000000000 : ℝ) =
            (1642177203736419 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1642177203736419 / 1250000000000000 : ℝ) ≤
            (170549608339280566813 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (203980052425511 / 5000000000000000 : ℝ)) (q :=
      (1642177203736419 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_95_3 :
    Uω (aρ 3) (bρ 3) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(33373159447642545139733 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1421288007529287 / 40000000000000000 : ℝ) ≤
      (-(33373159447642545139733 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1421288007529287 / 40000000000000000 : ℝ) =
            (1421288007529287 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1421288007529287 / 1250000000000000 : ℝ) ≤
            (1284199567357454860267 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (21556975818591 / 625000000000000 : ℝ)) (q :=
      (1421288007529287 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_95_4 :
    Uω (aρ 4) (bρ 4) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(37115746034298764438831 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (977560446800329 / 40000000000000000 : ℝ) ≤
      (-(37115746034298764438831 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (977560446800329 / 40000000000000000 : ℝ) =
            (977560446800329 / 625000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (977560446800329 / 625000000000000 : ℝ) ≤
            (4473084783701235561169 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (201342013797977 / 10000000000000000 : ℝ)) (q :=
      (977560446800329 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_95_5 :
    Uω (aρ 5) (bρ 5) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_95_6 :
    Uω (aρ 6) (bρ 6) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_95_7 :
    Uω (aρ 7) (bρ 7) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_95_8 :
    Uω (aρ 8) (bρ 8) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_95_9 :
    Uω (aρ 9) (bρ 9) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_95_10 :
    Uω (aρ 10) (bρ 10) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_95_11 :
    Uω (aρ 11) (bρ 11) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_95_12 :
    Uω (aρ 12) (bρ 12) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_95_13 :
    Uω (aρ 13) (bρ 13) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_95_14 :
    Uω (aρ 14) (bρ 14) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_95_15 :
    Uω (aρ 15) (bρ 15) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_95_16 :
    Uω (aρ 16) (bρ 16) (1604463128359 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_95 :
    Uρ (1604463128359 / 32000000000000 : ℝ) ≤
      (-(1643828923725105092647 / 625000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1604463128359 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(31314897764576203369223 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1604463128359 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1995535330098219433187 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1604463128359 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(33373159447642545139733 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1604463128359 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(37115746034298764438831 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1604463128359 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1604463128359 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1604463128359 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1604463128359 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1604463128359 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1604463128359 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1604463128359 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1604463128359 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1604463128359 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1604463128359 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1604463128359 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1604463128359 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_95_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_96_1 :
    Uω (aρ 1) (bρ 1) (646573553607 / 12800000000000 : ℝ) ≤
      (-(31229495382192123462893 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (704433871945367 / 16000000000000000 : ℝ) ≤
      (-(31229495382192123462893 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (704433871945367 / 16000000000000000 : ℝ) =
            (704433871945367 / 500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (704433871945367 / 500000000000000 : ℝ) ≤
            (3427863632807876537107 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (10997599231531 / 250000000000000 : ℝ)) (q :=
      (704433871945367 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_96_2 :
    Uω (aρ 2) (bρ 2) (646573553607 / 12800000000000 : ℝ) ≤
      (-(31837291633471834828943 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3314469133291263 / 80000000000000000 : ℝ) ≤
      (-(31837291633471834828943 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (3314469133291263 / 80000000000000000 : ℝ) =
            (3314469133291263 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3314469133291263 / 2500000000000000 : ℝ) ≤
            (2820067381528165171057 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (411747925162347 / 10000000000000000 : ℝ)) (q :=
      (3314469133291263 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_96_3 :
    Uω (aρ 3) (bρ 3) (646573553607 / 12800000000000 : ℝ) ≤
      (-(33265319572434076398587 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (574679240581723 / 16000000000000000 : ℝ) ≤
      (-(33265319572434076398587 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (574679240581723 / 16000000000000000 : ℝ) =
            (574679240581723 / 500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (574679240581723 / 500000000000000 : ℝ) ≤
            (1392039442565923601413 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (69775159783337 / 2000000000000000 : ℝ)) (q :=
      (574679240581723 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_96_4 :
    Uω (aρ 4) (bρ 4) (646573553607 / 12800000000000 : ℝ) ≤
      (-(18466180287477100611297 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1991305742591499 / 80000000000000000 : ℝ) ≤
      (-(18466180287477100611297 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (1991305742591499 / 80000000000000000 : ℝ) =
            (1991305742591499 / 1250000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1991305742591499 / 1250000000000000 : ℝ) ≤
            (2328235121522899388703 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (103323682451203 / 5000000000000000 : ℝ)) (q :=
      (1991305742591499 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_96_5 :
    Uω (aρ 5) (bρ 5) (646573553607 / 12800000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_96_6 :
    Uω (aρ 6) (bρ 6) (646573553607 / 12800000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_96_7 :
    Uω (aρ 7) (bρ 7) (646573553607 / 12800000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_96_8 :
    Uω (aρ 8) (bρ 8) (646573553607 / 12800000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_96_9 :
    Uω (aρ 9) (bρ 9) (646573553607 / 12800000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_96_10 :
    Uω (aρ 10) (bρ 10) (646573553607 / 12800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_96_11 :
    Uω (aρ 11) (bρ 11) (646573553607 / 12800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_96_12 :
    Uω (aρ 12) (bρ 12) (646573553607 / 12800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_96_13 :
    Uω (aρ 13) (bρ 13) (646573553607 / 12800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_96_14 :
    Uω (aρ 14) (bρ 14) (646573553607 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_96_15 :
    Uω (aρ 15) (bρ 15) (646573553607 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_96_16 :
    Uω (aρ 16) (bρ 16) (646573553607 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_96 :
    Uρ (646573553607 / 12800000000000 : ℝ) ≤
      (-(328529636040277536627 / 125000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (646573553607 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(31229495382192123462893 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (646573553607 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(31837291633471834828943 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (646573553607 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(33265319572434076398587 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (646573553607 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18466180287477100611297 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (646573553607 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (646573553607 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (646573553607 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (646573553607 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (646573553607 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (646573553607 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (646573553607 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (646573553607 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (646573553607 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (646573553607 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (646573553607 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (646573553607 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_96_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_97_1 :
    Uω (aρ 1) (bρ 1) (407101159919 / 8000000000000 : ℝ) ≤
      (-(31144817381860143498661 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (222007563681771 / 5000000000000000 : ℝ) ≤
      (-(31144817381860143498661 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (222007563681771 / 5000000000000000 : ℝ) =
            (222007563681771 / 156250000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (222007563681771 / 156250000000000 : ℝ) ≤
            (3512541633139856501339 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (221825511456667 / 5000000000000000 : ℝ)) (q :=
      (222007563681771 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_97_2 :
    Uω (aρ 2) (bρ 2) (407101159919 / 8000000000000 : ℝ) ≤
      (-(1984178357444751687497 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4180725569849 / 100000000000000 : ℝ) ≤
      (-(1984178357444751687497 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show (4180725569849 / 100000000000000 : ℝ) = (4180725569849 / 3125000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4180725569849 / 3125000000000 : ℝ) ≤
            (181906580992748312503 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (8310697893321 / 200000000000000 : ℝ)) (q :=
      (4180725569849 / 100000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_97_3 :
    Uω (aρ 3) (bρ 3) (407101159919 / 8000000000000 : ℝ) ≤
      (-(3315869741376076852277 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9075615260803 / 250000000000000 : ℝ) ≤
      (-(3315869741376076852277 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show (9075615260803 / 250000000000000 : ℝ) = (9075615260803 / 7812500000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9075615260803 / 7812500000000 : ℝ) ≤
            (149866160123923147723 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (35283510791049 / 1000000000000000 : ℝ)) (q :=
      (9075615260803 / 250000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_97_4 :
    Uω (aρ 4) (bρ 4) (407101159919 / 8000000000000 : ℝ) ≤
      (-(36753595311212100745499 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (506805864423637 / 20000000000000000 : ℝ) ≤
      (-(36753595311212100745499 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (506805864423637 / 20000000000000000 : ℝ) =
            (506805864423637 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (506805864423637 / 312500000000000 : ℝ) ≤
            (4835235506787899254501 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (211885932534887 / 10000000000000000 : ℝ)) (q :=
      (506805864423637 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_97_5 :
    Uω (aρ 5) (bρ 5) (407101159919 / 8000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_97_6 :
    Uω (aρ 6) (bρ 6) (407101159919 / 8000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_97_7 :
    Uω (aρ 7) (bρ 7) (407101159919 / 8000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_97_8 :
    Uω (aρ 8) (bρ 8) (407101159919 / 8000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_97_9 :
    Uω (aρ 9) (bρ 9) (407101159919 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_97_10 :
    Uω (aρ 10) (bρ 10) (407101159919 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_97_11 :
    Uω (aρ 11) (bρ 11) (407101159919 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_97_12 :
    Uω (aρ 12) (bρ 12) (407101159919 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_97_13 :
    Uω (aρ 13) (bρ 13) (407101159919 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_97_14 :
    Uω (aρ 14) (bρ 14) (407101159919 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_97_15 :
    Uω (aρ 15) (bρ 15) (407101159919 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_97_16 :
    Uω (aρ 16) (bρ 16) (407101159919 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_97 :
    Uρ (407101159919 / 8000000000000 : ℝ) ≤
      (-(26263832431500510068899 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (407101159919 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(31144817381860143498661 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (407101159919 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1984178357444751687497 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (407101159919 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3315869741376076852277 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (407101159919 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(36753595311212100745499 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (407101159919 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (407101159919 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (407101159919 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (407101159919 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (407101159919 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (407101159919 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (407101159919 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (407101159919 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (407101159919 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (407101159919 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (407101159919 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (407101159919 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_97_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_98_1 :
    Uω (aρ 1) (bρ 1) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(15488793007051782660579 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1806011551951707 / 40000000000000000 : ℝ) ≤
      (-(15488793007051782660579 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1806011551951707 / 40000000000000000 : ℝ) =
            (1806011551951707 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1806011551951707 / 1250000000000000 : ℝ) ≤
            (1839886500448217339421 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (451144821875541 / 10000000000000000 : ℝ)) (q :=
      (1806011551951707 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_98_2 :
    Uω (aρ 2) (bρ 2) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(789210603282412178031 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1702396628433119 / 40000000000000000 : ℝ) ≤
      (-(789210603282412178031 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1702396628433119 / 40000000000000000 : ℝ) =
            (1702396628433119 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1702396628433119 / 1250000000000000 : ℝ) ≤
            (77223372092587821969 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (423106372626247 / 10000000000000000 : ℝ)) (q :=
      (1702396628433119 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_98_3 :
    Uω (aρ 3) (bρ 3) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(32948992811289585472047 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1482871145547441 / 40000000000000000 : ℝ) ≤
      (-(32948992811289585472047 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1482871145547441 / 40000000000000000 : ℝ) =
            (1482871145547441 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1482871145547441 / 1250000000000000 : ℝ) ≤
            (1708366203710414527953 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (11273116797919 / 312500000000000 : ℝ)) (q :=
      (1482871145547441 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_98_4 :
    Uω (aρ 4) (bρ 4) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(9102208735492745651249 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1049166414959979 / 40000000000000000 : ℝ) ≤
      (-(9102208735492745651249 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (1049166414959979 / 40000000000000000 : ℝ) =
            (1049166414959979 / 625000000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1049166414959979 / 625000000000000 : ℝ) ≤
            (1294998969007254348751 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (222181553304677 / 10000000000000000 : ℝ)) (q :=
      (1049166414959979 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_98_5 :
    Uω (aρ 5) (bρ 5) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_98_6 :
    Uω (aρ 6) (bρ 6) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_98_7 :
    Uω (aρ 7) (bρ 7) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_98_8 :
    Uω (aρ 8) (bρ 8) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_98_9 :
    Uω (aρ 9) (bρ 9) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_98_10 :
    Uω (aρ 10) (bρ 10) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_98_11 :
    Uω (aρ 11) (bρ 11) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_98_12 :
    Uω (aρ 12) (bρ 12) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_98_13 :
    Uω (aρ 13) (bρ 13) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_98_14 :
    Uω (aρ 14) (bρ 14) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_98_15 :
    Uω (aρ 15) (bρ 15) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_98_16 :
    Uω (aρ 16) (bρ 16) (1652346150993 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_98 :
    Uρ (1652346150993 / 32000000000000 : ℝ) ≤
      (-(26227745217472389991977 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1652346150993 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(15488793007051782660579 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1652346150993 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(789210603282412178031 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1652346150993 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(32948992811289585472047 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1652346150993 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9102208735492745651249 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1652346150993 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1652346150993 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1652346150993 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1652346150993 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1652346150993 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1652346150993 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1652346150993 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1652346150993 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1652346150993 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1652346150993 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1652346150993 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1652346150993 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_98_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_99_1 :
    Uω (aρ 1) (bρ 1) (167628766231 / 3200000000000 : ℝ) ≤
      (-(30813109637784336635283 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (183596180579089 / 4000000000000000 : ℝ) ≤
      (-(30813109637784336635283 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (183596180579089 / 4000000000000000 : ℝ) =
            (183596180579089 / 125000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (183596180579089 / 125000000000000 : ℝ) ≤
            (3844249377215663364717 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (45863822650857 / 1000000000000000 : ℝ)) (q :=
      (183596180579089 / 4000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_99_2 :
    Uω (aρ 2) (bρ 2) (167628766231 / 3200000000000 : ℝ) ≤
      (-(31393158740030300939493 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43312418864037 / 1000000000000000 : ℝ) ≤
      (-(31393158740030300939493 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (43312418864037 / 1000000000000000 : ℝ) = (43312418864037 / 31250000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43312418864037 / 31250000000000 : ℝ) ≤
            (3264200274969699060507 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (86134942680773 / 2000000000000000 : ℝ)) (q :=
      (43312418864037 / 1000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_99_3 :
    Uω (aρ 3) (bρ 3) (167628766231 / 3200000000000 : ℝ) ≤
      (-(8185957218103774495557 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (75680427309953 / 2000000000000000 : ℝ) ≤
      (-(8185957218103774495557 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (75680427309953 / 2000000000000000 : ℝ) = (75680427309953 / 62500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (75680427309953 / 62500000000000 : ℝ) ≤
            (478382535646225504443 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (73725343114531 / 2000000000000000 : ℝ)) (q :=
      (75680427309953 / 2000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_99_4 :
    Uω (aρ 4) (bρ 4) (167628766231 / 3200000000000 : ℝ) ≤
      (-(9019883879209497377887 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (542145274302063 / 20000000000000000 : ℝ) ≤
      (-(9019883879209497377887 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 6
        (show
          (542145274302063 / 20000000000000000 : ℝ) =
            (542145274302063 / 312500000000000 : ℝ) / 2 ^ 6
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (542145274302063 / 312500000000000 : ℝ) ≤
            (1377323825290502622113 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (58065474460047 / 2500000000000000 : ℝ)) (q :=
      (542145274302063 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_99_5 :
    Uω (aρ 5) (bρ 5) (167628766231 / 3200000000000 : ℝ) ≤
      (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_5]) (by norm_num [bρ_5])]; exact Lmid_5

lemma U_99_6 :
    Uω (aρ 6) (bρ 6) (167628766231 / 3200000000000 : ℝ) ≤
      (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_6]) (by norm_num [bρ_6])]; exact Lmid_6

lemma U_99_7 :
    Uω (aρ 7) (bρ 7) (167628766231 / 3200000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_99_8 :
    Uω (aρ 8) (bρ 8) (167628766231 / 3200000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_99_9 :
    Uω (aρ 9) (bρ 9) (167628766231 / 3200000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_99_10 :
    Uω (aρ 10) (bρ 10) (167628766231 / 3200000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_99_11 :
    Uω (aρ 11) (bρ 11) (167628766231 / 3200000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_99_12 :
    Uω (aρ 12) (bρ 12) (167628766231 / 3200000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_99_13 :
    Uω (aρ 13) (bρ 13) (167628766231 / 3200000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_99_14 :
    Uω (aρ 14) (bρ 14) (167628766231 / 3200000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_99_15 :
    Uω (aρ 15) (bρ 15) (167628766231 / 3200000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_99_16 :
    Uω (aρ 16) (bρ 16) (167628766231 / 3200000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_99 :
    Uρ (167628766231 / 3200000000000 : ℝ) ≤
      (-(3274109383884848166437 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (167628766231 / 3200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(30813109637784336635283 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (167628766231 / 3200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(31393158740030300939493 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (167628766231 / 3200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8185957218103774495557 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (167628766231 / 3200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9019883879209497377887 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (167628766231 / 3200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20577364119368339121527 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (167628766231 / 3200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3698074464695343529243 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (167628766231 / 3200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (167628766231 / 3200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (167628766231 / 3200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (167628766231 / 3200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (167628766231 / 3200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (167628766231 / 3200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (167628766231 / 3200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (167628766231 / 3200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (167628766231 / 3200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (167628766231 / 3200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_99_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
