/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U14) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_172_1 :
    Uω (aρ 1) (bρ 1) (730852490563 / 6400000000000 : ℝ) ≤
      (-(22281181472692134742863 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4309238928484769 / 40000000000000000 : ℝ) ≤
      (-(22281181472692134742863 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4309238928484769 / 40000000000000000 : ℝ) =
            (4309238928484769 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4309238928484769 / 2500000000000000 : ℝ) ≤
            (5444705739307865257137 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1077159665822697 / 10000000000000000 : ℝ)) (q :=
      (4309238928484769 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_172_2 :
    Uω (aρ 2) (bρ 2) (730852490563 / 6400000000000 : ℝ) ≤
      (-(11256214960041973685579 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (842146363578383 / 8000000000000000 : ℝ) ≤
      (-(11256214960041973685579 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (842146363578383 / 8000000000000000 : ℝ) =
            (842146363578383 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (842146363578383 / 500000000000000 : ℝ) ≤
            (2606728645958026314421 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (105167512303627 / 1000000000000000 : ℝ)) (q :=
      (842146363578383 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_172_3 :
    Uω (aρ 3) (bρ 3) (730852490563 / 6400000000000 : ℝ) ≤
      (-(1149991614237294033779 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4010421005056027 / 40000000000000000 : ℝ) ≤
      (-(1149991614237294033779 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4010421005056027 / 40000000000000000 : ℝ) =
            (4010421005056027 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4010421005056027 / 2500000000000000 : ℝ) ≤
            (236302746362705966221 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (499457911484163 / 5000000000000000 : ℝ)) (q :=
      (4010421005056027 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_172_4 :
    Uω (aρ 4) (bρ 4) (730852490563 / 6400000000000 : ℝ) ≤
      (-(11948772902721880539821 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3666086969961161 / 40000000000000000 : ℝ) ≤
      (-(11948772902721880539821 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3666086969961161 / 40000000000000000 : ℝ) =
            (3666086969961161 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3666086969961161 / 2500000000000000 : ℝ) ≤
            (1914170703278119460179 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (905042986485893 / 10000000000000000 : ℝ)) (q :=
      (3666086969961161 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_172_5 :
    Uω (aρ 5) (bρ 5) (730852490563 / 6400000000000 : ℝ) ≤
      (-(199755328482226702363 / 78125000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3101888899973749 / 40000000000000000 : ℝ) ≤
      (-(199755328482226702363 / 78125000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3101888899973749 / 40000000000000000 : ℝ) =
            (3101888899973749 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3101888899973749 / 2500000000000000 : ℝ) ≤
            (16853165361523297637 / 78125000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (741133870827187 / 10000000000000000 : ℝ)) (q :=
      (3101888899973749 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_172_6 :
    Uω (aρ 6) (bρ 6) (730852490563 / 6400000000000 : ℝ) ≤
      (-(1840780699148846481243 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2103558289061037 / 40000000000000000 : ℝ) ≤
      (-(1840780699148846481243 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2103558289061037 / 40000000000000000 : ℝ) =
            (2103558289061037 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2103558289061037 / 1250000000000000 : ℝ) ≤
            (325304239288653518757 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (409208940510831 / 10000000000000000 : ℝ)) (q :=
      (2103558289061037 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_172_7 :
    Uω (aρ 7) (bρ 7) (730852490563 / 6400000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_172_8 :
    Uω (aρ 8) (bρ 8) (730852490563 / 6400000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_172_9 :
    Uω (aρ 9) (bρ 9) (730852490563 / 6400000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_172_10 :
    Uω (aρ 10) (bρ 10) (730852490563 / 6400000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_172_11 :
    Uω (aρ 11) (bρ 11) (730852490563 / 6400000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_172_12 :
    Uω (aρ 12) (bρ 12) (730852490563 / 6400000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_172_13 :
    Uω (aρ 13) (bρ 13) (730852490563 / 6400000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_172_14 :
    Uω (aρ 14) (bρ 14) (730852490563 / 6400000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_172_15 :
    Uω (aρ 15) (bρ 15) (730852490563 / 6400000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_172_16 :
    Uω (aρ 16) (bρ 16) (730852490563 / 6400000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_172 :
    Uρ (730852490563 / 6400000000000 : ℝ) ≤
      (-(23044230349968969239773 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (730852490563 / 6400000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(22281181472692134742863 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (730852490563 / 6400000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11256214960041973685579 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (730852490563 / 6400000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1149991614237294033779 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (730852490563 / 6400000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11948772902721880539821 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (730852490563 / 6400000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(199755328482226702363 / 78125000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (730852490563 / 6400000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1840780699148846481243 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (730852490563 / 6400000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (730852490563 / 6400000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (730852490563 / 6400000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (730852490563 / 6400000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (730852490563 / 6400000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (730852490563 / 6400000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (730852490563 / 6400000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (730852490563 / 6400000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (730852490563 / 6400000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (730852490563 / 6400000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_172_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_173_1 :
    Uω (aρ 1) (bρ 1) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(22248708993169244456213 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8646509680050409 / 80000000000000000 : ℝ) ≤
      (-(22248708993169244456213 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8646509680050409 / 80000000000000000 : ℝ) =
            (8646509680050409 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8646509680050409 / 5000000000000000 : ℝ) ≤
            (5477178218830755543787 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (540332065109973 / 5000000000000000 : ℝ)) (q :=
      (8646509680050409 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_173_2 :
    Uω (aρ 2) (bρ 2) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(22479171954322094534041 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8449518336965521 / 80000000000000000 : ℝ) ≤
      (-(22479171954322094534041 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8449518336965521 / 80000000000000000 : ℝ) =
            (8449518336965521 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8449518336965521 / 5000000000000000 : ℝ) ≤
            (5246715257677905465959 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (263796326739681 / 2500000000000000 : ℝ)) (q :=
      (8449518336965521 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_173_3 :
    Uω (aρ 3) (bρ 3) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(22964821159010354163667 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8048973097240157 / 80000000000000000 : ℝ) ≤
      (-(22964821159010354163667 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8048973097240157 / 80000000000000000 : ℝ) =
            (8048973097240157 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8048973097240157 / 5000000000000000 : ℝ) ≤
            (4761066052989645836333 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1002445103377383 / 10000000000000000 : ℝ)) (q :=
      (8048973097240157 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_173_4 :
    Uω (aρ 4) (bρ 4) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(23858911651480393246513 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7360555964082549 / 80000000000000000 : ℝ) ≤
      (-(23858911651480393246513 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (7360555964082549 / 80000000000000000 : ℝ) =
            (7360555964082549 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7360555964082549 / 5000000000000000 : ℝ) ≤
            (3866975560519606753487 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (908635001152981 / 10000000000000000 : ℝ)) (q :=
      (7360555964082549 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_173_5 :
    Uω (aρ 5) (bρ 5) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(204172253072514234181 / 80000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6233097936164581 / 80000000000000000 : ℝ) ≤
      (-(204172253072514234181 / 80000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (6233097936164581 / 80000000000000000 : ℝ) =
            (6233097936164581 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6233097936164581 / 5000000000000000 : ℝ) ≤
            (17634844623485765819 / 80000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (744960413508489 / 10000000000000000 : ℝ)) (q :=
      (6233097936164581 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_173_6 :
    Uω (aρ 6) (bρ 6) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(5873488781927654282487 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4243049542363997 / 80000000000000000 : ℝ) ≤
      (-(5873488781927654282487 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (4243049542363997 / 80000000000000000 : ℝ) =
            (4243049542363997 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4243049542363997 / 2500000000000000 : ℝ) ≤
            (1057983021072345717513 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (414688690198343 / 10000000000000000 : ℝ)) (q :=
      (4243049542363997 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_173_7 :
    Uω (aρ 7) (bρ 7) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_173_8 :
    Uω (aρ 8) (bρ 8) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_173_9 :
    Uω (aρ 9) (bρ 9) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_173_10 :
    Uω (aρ 10) (bρ 10) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_173_11 :
    Uω (aρ 11) (bρ 11) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_173_12 :
    Uω (aρ 12) (bρ 12) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_173_13 :
    Uω (aρ 13) (bρ 13) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_173_14 :
    Uω (aρ 14) (bρ 14) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_173_15 :
    Uω (aρ 15) (bρ 15) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_173_16 :
    Uω (aρ 16) (bρ 16) (7330947250417 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_173 :
    Uρ (7330947250417 / 64000000000000 : ℝ) ≤
      (-(23029193766167760068613 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (7330947250417 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(22248708993169244456213 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (7330947250417 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(22479171954322094534041 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (7330947250417 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(22964821159010354163667 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (7330947250417 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(23858911651480393246513 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (7330947250417 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(204172253072514234181 / 80000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (7330947250417 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5873488781927654282487 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (7330947250417 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (7330947250417 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (7330947250417 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (7330947250417 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (7330947250417 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (7330947250417 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (7330947250417 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (7330947250417 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (7330947250417 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (7330947250417 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_173_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_174_1 :
    Uω (aρ 1) (bρ 1) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(888653665905254274529 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (216863536949329 / 2000000000000000 : ℝ) ≤
      (-(888653665905254274529 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (216863536949329 / 2000000000000000 : ℝ) =
            (216863536949329 / 125000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (216863536949329 / 125000000000000 : ℝ) ≤
            (220381822574745725471 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (216833717665533 / 2000000000000000 : ℝ)) (q :=
      (216863536949329 / 2000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_174_2 :
    Uω (aρ 2) (bρ 2) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(22446024440442051456091 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1059696607599907 / 10000000000000000 : ℝ) ≤
      (-(22446024440442051456091 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1059696607599907 / 10000000000000000 : ℝ) =
            (1059696607599907 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1059696607599907 / 625000000000000 : ℝ) ≤
            (5279862771557948543909 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1058695446544189 / 10000000000000000 : ℝ)) (q :=
      (1059696607599907 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_174_3 :
    Uω (aρ 3) (bρ 3) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(22929933076480730785293 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2019275865800773 / 20000000000000000 : ℝ) ≤
      (-(22929933076480730785293 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2019275865800773 / 20000000000000000 : ℝ) =
            (2019275865800773 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2019275865800773 / 1250000000000000 : ℝ) ≤
            (4795954135519269214707 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (251493550873787 / 2500000000000000 : ℝ)) (q :=
      (2019275865800773 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_174_4 :
    Uω (aρ 4) (bρ 4) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(4764085982108051921477 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1847233808506427 / 20000000000000000 : ℝ) ≤
      (-(4764085982108051921477 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1847233808506427 / 20000000000000000 : ℝ) =
            (1847233808506427 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1847233808506427 / 1250000000000000 : ℝ) ≤
            (781091460291948078523 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (456113163632901 / 5000000000000000 : ℝ)) (q :=
      (1847233808506427 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_174_5 :
    Uω (aρ 5) (bρ 5) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(12737311347516656082539 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (782800677835541 / 10000000000000000 : ℝ) ≤
      (-(12737311347516656082539 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (782800677835541 / 10000000000000000 : ℝ) =
            (782800677835541 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (782800677835541 / 625000000000000 : ℝ) ≤
            (1125632258483343917461 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (748783793765457 / 10000000000000000 : ℝ)) (q :=
      (782800677835541 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_174_6 :
    Uω (aρ 6) (bρ 6) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(29283508847027304206383 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (213940674387349 / 4000000000000000 : ℝ) ≤
      (-(29283508847027304206383 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (213940674387349 / 4000000000000000 : ℝ) =
            (213940674387349 / 125000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (213940674387349 / 125000000000000 : ℝ) ≤
            (5373850167972695793617 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5251577314639 / 125000000000000 : ℝ)) (q :=
      (213940674387349 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_174_7 :
    Uω (aρ 7) (bρ 7) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_174_8 :
    Uω (aρ 8) (bρ 8) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_174_9 :
    Uω (aρ 9) (bρ 9) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_174_10 :
    Uω (aρ 10) (bρ 10) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_174_11 :
    Uω (aρ 11) (bρ 11) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_174_12 :
    Uω (aρ 12) (bρ 12) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_174_13 :
    Uω (aρ 13) (bρ 13) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_174_14 :
    Uω (aρ 14) (bρ 14) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_174_15 :
    Uω (aρ 15) (bρ 15) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_174_16 :
    Uω (aρ 16) (bρ 16) (1838342398801 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_174 :
    Uρ (1838342398801 / 16000000000000 : ℝ) ≤
      (-(23014280091458413181989 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1838342398801 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(888653665905254274529 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1838342398801 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(22446024440442051456091 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1838342398801 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(22929933076480730785293 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1838342398801 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4764085982108051921477 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1838342398801 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(12737311347516656082539 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1838342398801 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(29283508847027304206383 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1838342398801 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1838342398801 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1838342398801 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1838342398801 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1838342398801 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1838342398801 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1838342398801 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1838342398801 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1838342398801 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1838342398801 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_174_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_175_1 :
    Uω (aρ 1) (bρ 1) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(22151919650023756881351 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4365302499656941 / 40000000000000000 : ℝ) ≤
      (-(22151919650023756881351 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4365302499656941 / 40000000000000000 : ℝ) =
            (4365302499656941 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4365302499656941 / 2500000000000000 : ℝ) ≤
            (5573967561976243118649 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (272794371479227 / 2500000000000000 : ℝ)) (q :=
      (4365302499656941 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_175_2 :
    Uω (aρ 2) (bρ 2) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(11190028922637405674731 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4266840691716199 / 40000000000000000 : ℝ) ≤
      (-(11190028922637405674731 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4266840691716199 / 40000000000000000 : ℝ) =
            (4266840691716199 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4266840691716199 / 2500000000000000 : ℝ) ≤
            (2672914683362594325269 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1065715594456537 / 10000000000000000 : ℝ)) (q :=
      (4266840691716199 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_175_3 :
    Uω (aρ 3) (bρ 3) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(11430261289115545831809 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4066681030890477 / 40000000000000000 : ℝ) ≤
      (-(11430261289115545831809 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4066681030890477 / 40000000000000000 : ℝ) =
            (4066681030890477 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4066681030890477 / 2500000000000000 : ℝ) ≤
            (2432682316884454168191 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (253257967598419 / 2500000000000000 : ℝ)) (q :=
      (4066681030890477 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_175_4 :
    Uω (aρ 4) (bρ 4) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(23743918776680516836079 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3722842820177343 / 40000000000000000 : ℝ) ≤
      (-(23743918776680516836079 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3722842820177343 / 40000000000000000 : ℝ) =
            (3722842820177343 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3722842820177343 / 2500000000000000 : ℝ) ≤
            (3981968435319483163921 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (919406946102109 / 10000000000000000 : ℝ)) (q :=
      (3722842820177343 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_175_5 :
    Uω (aρ 5) (bρ 5) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(5076303731562824760583 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3160491606868909 / 40000000000000000 : ℝ) ≤
      (-(5076303731562824760583 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3160491606868909 / 40000000000000000 : ℝ) =
            (3160491606868909 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3160491606868909 / 2500000000000000 : ℝ) ≤
            (468873710837175239417 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (189105314695723 / 2500000000000000 : ℝ)) (q :=
      (3160491606868909 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_175_6 :
    Uω (aρ 6) (bρ 6) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(14559415015712096654269 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2174929933788829 / 40000000000000000 : ℝ) ≤
      (-(14559415015712096654269 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2174929933788829 / 40000000000000000 : ℝ) =
            (2174929933788829 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2174929933788829 / 1250000000000000 : ℝ) ≤
            (2769264491787903345731 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (107720199345713 / 2500000000000000 : ℝ)) (q :=
      (2174929933788829 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_175_7 :
    Uω (aρ 7) (bρ 7) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_175_8 :
    Uω (aρ 8) (bρ 8) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_175_9 :
    Uω (aρ 9) (bρ 9) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_175_10 :
    Uω (aρ 10) (bρ 10) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_175_11 :
    Uω (aρ 11) (bρ 11) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_175_12 :
    Uω (aρ 12) (bρ 12) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_175_13 :
    Uω (aρ 13) (bρ 13) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_175_14 :
    Uω (aρ 14) (bρ 14) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_175_15 :
    Uω (aρ 15) (bρ 15) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_175_16 :
    Uω (aρ 16) (bρ 16) (3699107142389 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_175 :
    Uρ (3699107142389 / 32000000000000 : ℝ) ≤
      (-(11492404364136263761547 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3699107142389 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(22151919650023756881351 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3699107142389 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11190028922637405674731 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3699107142389 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(11430261289115545831809 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3699107142389 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(23743918776680516836079 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3699107142389 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5076303731562824760583 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3699107142389 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14559415015712096654269 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3699107142389 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3699107142389 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3699107142389 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3699107142389 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3699107142389 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3699107142389 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3699107142389 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3699107142389 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3699107142389 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3699107142389 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_175_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_176_1 :
    Uω (aρ 1) (bρ 1) (465191185897 / 4000000000000 : ℝ) ≤
      (-(22087910127931218969373 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2196667105724981 / 20000000000000000 : ℝ) ≤
      (-(22087910127931218969373 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2196667105724981 / 20000000000000000 : ℝ) =
            (2196667105724981 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2196667105724981 / 1250000000000000 : ℝ) ≤
            (5637977084068781030627 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1098186359067481 / 10000000000000000 : ℝ)) (q :=
      (2196667105724981 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_176_2 :
    Uω (aρ 2) (bρ 2) (465191185897 / 4000000000000 : ℝ) ≤
      (-(5578631090169752076037 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (536861826092047 / 5000000000000000 : ℝ) ≤
      (-(5578631090169752076037 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (536861826092047 / 5000000000000000 : ℝ) =
            (536861826092047 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (536861826092047 / 312500000000000 : ℝ) ≤
            (1352840712830247923963 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (67045973138793 / 625000000000000 : ℝ)) (q :=
      (536861826092047 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_176_3 :
    Uω (aρ 3) (bρ 3) (465191185897 / 4000000000000 : ℝ) ≤
      (-(22791593955763525787333 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1023702233136753 / 10000000000000000 : ℝ) ≤
      (-(22791593955763525787333 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1023702233136753 / 10000000000000000 : ℝ) =
            (1023702233136753 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1023702233136753 / 625000000000000 : ℝ) ≤
            (4934293256236474212667 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (510044419238003 / 5000000000000000 : ℝ)) (q :=
      (1023702233136753 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_176_4 :
    Uω (aρ 4) (bρ 4) (465191185897 / 4000000000000 : ℝ) ≤
      (-(23668002770991622080457 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (234450794126107 / 2500000000000000 : ℝ) ≤
      (-(23668002770991622080457 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (234450794126107 / 2500000000000000 : ℝ) =
            (234450794126107 / 156250000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (234450794126107 / 156250000000000 : ℝ) ≤
            (4057884441008377919543 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (231646226569089 / 2500000000000000 : ℝ)) (q :=
      (234450794126107 / 2500000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_176_5 :
    Uω (aρ 5) (bρ 5) (465191185897 / 4000000000000 : ℝ) ≤
      (-(6322337309009206611799 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (318975633373579 / 4000000000000000 : ℝ) ≤
      (-(6322337309009206611799 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (318975633373579 / 4000000000000000 : ℝ) =
            (318975633373579 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (318975633373579 / 250000000000000 : ℝ) ≤
            (609134493990793388201 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (152809327894079 / 2000000000000000 : ℝ)) (q :=
      (318975633373579 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_176_6 :
    Uω (aρ 6) (bρ 6) (465191185897 / 4000000000000 : ℝ) ≤
      (-(2895818328965296759049 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (552537907396753 / 10000000000000000 : ℝ) ≤
      (-(2895818328965296759049 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (552537907396753 / 10000000000000000 : ℝ) =
            (552537907396753 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (552537907396753 / 312500000000000 : ℝ) ≤
            (569917572534703240951 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (220742331268003 / 5000000000000000 : ℝ)) (q :=
      (552537907396753 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_176_7 :
    Uω (aρ 7) (bρ 7) (465191185897 / 4000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_176_8 :
    Uω (aρ 8) (bρ 8) (465191185897 / 4000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_176_9 :
    Uω (aρ 9) (bρ 9) (465191185897 / 4000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_176_10 :
    Uω (aρ 10) (bρ 10) (465191185897 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_176_11 :
    Uω (aρ 11) (bρ 11) (465191185897 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_176_12 :
    Uω (aρ 12) (bρ 12) (465191185897 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_176_13 :
    Uω (aρ 13) (bρ 13) (465191185897 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_176_14 :
    Uω (aρ 14) (bρ 14) (465191185897 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_176_15 :
    Uω (aρ 15) (bρ 15) (465191185897 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_176_16 :
    Uω (aρ 16) (bρ 16) (465191185897 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_176 :
    Uρ (465191185897 / 4000000000000 : ℝ) ≤
      (-(22955792340828882002671 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (465191185897 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(22087910127931218969373 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (465191185897 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5578631090169752076037 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (465191185897 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(22791593955763525787333 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (465191185897 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(23668002770991622080457 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (465191185897 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6322337309009206611799 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (465191185897 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2895818328965296759049 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (465191185897 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (465191185897 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (465191185897 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (465191185897 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (465191185897 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (465191185897 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (465191185897 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (465191185897 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (465191185897 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (465191185897 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_176_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_177_1 :
    Uω (aρ 1) (bρ 1) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(11012153915808991134077 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (884273175059109 / 8000000000000000 : ℝ) ≤
      (-(11012153915808991134077 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (884273175059109 / 8000000000000000 : ℝ) =
            (884273175059109 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (884273175059109 / 500000000000000 : ℝ) ≤
            (2850789690191008865923 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (221039041648867 / 2000000000000000 : ℝ)) (q :=
      (884273175059109 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_177_2 :
    Uω (aρ 2) (bρ 2) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(22249418326153667549627 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4322948188175437 / 40000000000000000 : ℝ) ≤
      (-(22249418326153667549627 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4322948188175437 / 40000000000000000 : ℝ) =
            (4322948188175437 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4322948188175437 / 2500000000000000 : ℝ) ≤
            (5476468885846332450373 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1079755377194281 / 10000000000000000 : ℝ)) (q :=
      (4322948188175437 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_177_3 :
    Uω (aρ 3) (bρ 3) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(1136157025908839802787 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (824587093075663 / 8000000000000000 : ℝ) ≤
      (-(1136157025908839802787 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (824587093075663 / 8000000000000000 : ℝ) =
            (824587093075663 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (824587093075663 / 500000000000000 : ℝ) ≤
            (250137334691160197213 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (25678628053643 / 250000000000000 : ℝ)) (q :=
      (824587093075663 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_177_4 :
    Uω (aρ 4) (bρ 4) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(5898168123465075345177 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3779577397159251 / 40000000000000000 : ℝ) ≤
      (-(5898168123465075345177 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3779577397159251 / 40000000000000000 : ℝ) =
            (3779577397159251 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3779577397159251 / 2500000000000000 : ℝ) ≤
            (1033303679534924654823 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (233440067275297 / 2500000000000000 : ℝ)) (q :=
      (3779577397159251 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_177_5 :
    Uω (aρ 5) (bρ 5) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(25198094437116484192507 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3218997608431433 / 40000000000000000 : ℝ) ≤
      (-(25198094437116484192507 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3218997608431433 / 40000000000000000 : ℝ) =
            (3218997608431433 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3218997608431433 / 2500000000000000 : ℝ) ≤
            (2527792774883515807493 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (771660294072279 / 10000000000000000 : ℝ)) (q :=
      (3218997608431433 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_177_6 :
    Uω (aρ 6) (bρ 6) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(14400662417436316917723 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2245093052986399 / 40000000000000000 : ℝ) ≤
      (-(14400662417436316917723 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2245093052986399 / 40000000000000000 : ℝ) =
            (2245093052986399 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2245093052986399 / 1250000000000000 : ℝ) ≤
            (2928017090063683082277 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (225974195744881 / 5000000000000000 : ℝ)) (q :=
      (2245093052986399 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_177_7 :
    Uω (aρ 7) (bρ 7) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_177_8 :
    Uω (aρ 8) (bρ 8) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_177_9 :
    Uω (aρ 9) (bρ 9) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_177_10 :
    Uω (aρ 10) (bρ 10) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_177_11 :
    Uω (aρ 11) (bρ 11) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_177_12 :
    Uω (aρ 12) (bρ 12) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_177_13 :
    Uω (aρ 13) (bρ 13) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_177_14 :
    Uω (aρ 14) (bρ 14) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_177_15 :
    Uω (aρ 15) (bρ 15) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_177_16 :
    Uω (aρ 16) (bρ 16) (3743951831963 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_177 :
    Uρ (3743951831963 / 32000000000000 : ℝ) ≤
      (-(716475289508359637971 / 312500000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3743951831963 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(11012153915808991134077 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3743951831963 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(22249418326153667549627 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3743951831963 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1136157025908839802787 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3743951831963 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5898168123465075345177 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3743951831963 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(25198094437116484192507 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3743951831963 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14400662417436316917723 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3743951831963 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3743951831963 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3743951831963 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3743951831963 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3743951831963 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3743951831963 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3743951831963 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3743951831963 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3743951831963 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3743951831963 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_177_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_178_1 :
    Uω (aρ 1) (bρ 1) (15065496707 / 128000000000 : ℝ) ≤
      (-(21961107610964149289349 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (556174686512519 / 5000000000000000 : ℝ) ≤
      (-(21961107610964149289349 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (556174686512519 / 5000000000000000 : ℝ) =
            (556174686512519 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (556174686512519 / 312500000000000 : ℝ) ≤
            (5764779601035850710651 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1112204033900701 / 10000000000000000 : ℝ)) (q :=
      (556174686512519 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_178_2 :
    Uω (aρ 2) (bρ 2) (15065496707 / 128000000000 : ℝ) ≤
      (-(5546183547911107213653 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2175500718287497 / 20000000000000000 : ℝ) ≤
      (-(5546183547911107213653 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2175500718287497 / 20000000000000000 : ℝ) =
            (2175500718287497 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2175500718287497 / 1250000000000000 : ℝ) ≤
            (1385288255088892786347 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (543387509324061 / 5000000000000000 : ℝ)) (q :=
      (2175500718287497 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_178_3 :
    Uω (aρ 3) (bρ 3) (15065496707 / 128000000000 : ℝ) ≤
      (-(5663788928473910630479 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1037765164350651 / 10000000000000000 : ℝ) ≤
      (-(5663788928473910630479 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1037765164350651 / 10000000000000000 : ℝ) =
            (1037765164350651 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1037765164350651 / 625000000000000 : ℝ) ≤
            (1267682874526089369521 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1034200735411927 / 10000000000000000 : ℝ)) (q :=
      (1037765164350651 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_178_4 :
    Uω (aρ 4) (bρ 4) (15065496707 / 128000000000 : ℝ) ≤
      (-(23517918771318664380059 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (380793701244309 / 4000000000000000 : ℝ) ≤
      (-(23517918771318664380059 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (380793701244309 / 4000000000000000 : ℝ) =
            (380793701244309 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (380793701244309 / 250000000000000 : ℝ) ≤
            (4207968440681335619941 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (94093309399717 / 1000000000000000 : ℝ)) (q :=
      (380793701244309 / 4000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_178_5 :
    Uω (aρ 5) (bρ 5) (15065496707 / 128000000000 : ℝ) ≤
      (-(6276933735209036880089 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1624108059181271 / 20000000000000000 : ℝ) ≤
      (-(6276933735209036880089 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1624108059181271 / 20000000000000000 : ℝ) =
            (1624108059181271 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1624108059181271 / 1250000000000000 : ℝ) ≤
            (654538067790963119911 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (97407820786487 / 1250000000000000 : ℝ)) (q :=
      (1624108059181271 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_178_6 :
    Uω (aρ 6) (bρ 6) (15065496707 / 128000000000 : ℝ) ≤
      (-(572960694532787081867 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1139886618028413 / 20000000000000000 : ℝ) ≤
      (-(572960694532787081867 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (1139886618028413 / 20000000000000000 : ℝ) =
            (1139886618028413 / 625000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1139886618028413 / 625000000000000 : ℝ) ≤
            (120186485767212918133 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (231140750139519 / 5000000000000000 : ℝ)) (q :=
      (1139886618028413 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_178_7 :
    Uω (aρ 7) (bρ 7) (15065496707 / 128000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_178_8 :
    Uω (aρ 8) (bρ 8) (15065496707 / 128000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_178_9 :
    Uω (aρ 9) (bρ 9) (15065496707 / 128000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_178_10 :
    Uω (aρ 10) (bρ 10) (15065496707 / 128000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_178_11 :
    Uω (aρ 11) (bρ 11) (15065496707 / 128000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_178_12 :
    Uω (aρ 12) (bρ 12) (15065496707 / 128000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_178_13 :
    Uω (aρ 13) (bρ 13) (15065496707 / 128000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_178_14 :
    Uω (aρ 14) (bρ 14) (15065496707 / 128000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_178_15 :
    Uω (aρ 15) (bρ 15) (15065496707 / 128000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_178_16 :
    Uω (aρ 16) (bρ 16) (15065496707 / 128000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_178 :
    Uρ (15065496707 / 128000000000 : ℝ) ≤
      (-(22899039784404335583777 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (15065496707 / 128000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(21961107610964149289349 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (15065496707 / 128000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5546183547911107213653 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (15065496707 / 128000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5663788928473910630479 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (15065496707 / 128000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(23517918771318664380059 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (15065496707 / 128000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6276933735209036880089 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (15065496707 / 128000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(572960694532787081867 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (15065496707 / 128000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (15065496707 / 128000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (15065496707 / 128000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (15065496707 / 128000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (15065496707 / 128000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (15065496707 / 128000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (15065496707 / 128000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (15065496707 / 128000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (15065496707 / 128000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (15065496707 / 128000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_178_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_179_1 :
    Uω (aρ 1) (bρ 1) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(5474576103240136115701 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (895485812549507 / 8000000000000000 : ℝ) ≤
      (-(5474576103240136115701 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (895485812549507 / 8000000000000000 : ℝ) =
            (895485812549507 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (895485812549507 / 500000000000000 : ℝ) ≤
            (1456895699759863884299 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (223842567295691 / 2000000000000000 : ℝ)) (q :=
      (895485812549507 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_179_2 :
    Uω (aρ 2) (bρ 2) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(11060233257341866518873 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4379054360308581 / 40000000000000000 : ℝ) ≤
      (-(11060233257341866518873 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4379054360308581 / 40000000000000000 : ℝ) =
            (4379054360308581 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4379054360308581 / 2500000000000000 : ℝ) ≤
            (2802710348658133481127 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (546897248884489 / 5000000000000000 : ℝ)) (q :=
      (4379054360308581 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_179_3 :
    Uω (aρ 3) (bρ 3) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(2258763312680448441801 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4179184535876051 / 40000000000000000 : ℝ) ≤
      (-(2258763312680448441801 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4179184535876051 / 40000000000000000 : ℝ) =
            (4179184535876051 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4179184535876051 / 2500000000000000 : ℝ) ≤
            (513825408519551558199 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1041255691902713 / 10000000000000000 : ℝ)) (q :=
      (4179184535876051 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_179_4 :
    Uω (aρ 4) (bρ 4) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(468874652954865998573 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3836291667072607 / 40000000000000000 : ℝ) ≤
      (-(468874652954865998573 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3836291667072607 / 40000000000000000 : ℝ) =
            (3836291667072607 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3836291667072607 / 2500000000000000 : ℝ) ≤
            (85643091285134001427 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (948103438565991 / 10000000000000000 : ℝ)) (q :=
      (3836291667072607 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_179_5 :
    Uω (aρ 5) (bρ 5) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(2501825206824387380069 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3277412523361897 / 40000000000000000 : ℝ) ≤
      (-(2501825206824387380069 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3277412523361897 / 40000000000000000 : ℝ) =
            (3277412523361897 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3277412523361897 / 2500000000000000 : ℝ) ≤
            (270763514375612619931 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (196713446511409 / 2500000000000000 : ℝ)) (q :=
      (3277412523361897 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_179_6 :
    Uω (aρ 6) (bρ 6) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(14249056853658479258529 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2314209318428351 / 40000000000000000 : ℝ) ≤
      (-(14249056853658479258529 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (2314209318428351 / 40000000000000000 : ℝ) =
            (2314209318428351 / 1250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2314209318428351 / 1250000000000000 : ℝ) ≤
            (3079622653841520741471 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (472492558718863 / 10000000000000000 : ℝ)) (q :=
      (2314209318428351 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_179_7 :
    Uω (aρ 7) (bρ 7) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_179_8 :
    Uω (aρ 8) (bρ 8) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_179_9 :
    Uω (aρ 9) (bρ 9) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_179_10 :
    Uω (aρ 10) (bρ 10) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_179_11 :
    Uω (aρ 11) (bρ 11) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_179_12 :
    Uω (aρ 12) (bρ 12) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_179_13 :
    Uω (aρ 13) (bρ 13) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_179_14 :
    Uω (aρ 14) (bρ 14) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_179_15 :
    Uω (aρ 15) (bρ 15) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_179_16 :
    Uω (aρ 16) (bρ 16) (3788796521537 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_179 :
    Uρ (3788796521537 / 32000000000000 : ℝ) ≤
      (-(11435632942680119457883 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3788796521537 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5474576103240136115701 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3788796521537 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11060233257341866518873 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3788796521537 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2258763312680448441801 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3788796521537 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(468874652954865998573 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3788796521537 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2501825206824387380069 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3788796521537 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14249056853658479258529 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3788796521537 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3788796521537 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3788796521537 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3788796521537 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3788796521537 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3788796521537 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3788796521537 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3788796521537 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3788796521537 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3788796521537 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_179_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_180_1 :
    Uω (aρ 1) (bρ 1) (952804716581 / 8000000000000 : ℝ) ≤
      (-(5458973319820460563247 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2252730294049721 / 20000000000000000 : ℝ) ≤
      (-(5458973319820460563247 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2252730294049721 / 20000000000000000 : ℝ) =
            (2252730294049721 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2252730294049721 / 1250000000000000 : ℝ) ≤
            (1472498483179539436753 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1126221616408471 / 10000000000000000 : ℝ)) (q :=
      (2252730294049721 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_180_2 :
    Uω (aρ 2) (bρ 2) (952804716581 / 8000000000000 : ℝ) ≤
      (-(11028304978811575276189 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (220355348279351 / 2000000000000000 : ℝ) ≤
      (-(11028304978811575276189 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (220355348279351 / 2000000000000000 : ℝ) =
            (220355348279351 / 125000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (220355348279351 / 125000000000000 : ℝ) ≤
            (2834638627188424723811 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (55040690883113 / 500000000000000 : ℝ)) (q :=
      (220355348279351 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_180_3 :
    Uω (aρ 3) (bρ 3) (952804716581 / 8000000000000 : ℝ) ≤
      (-(11260283236257531228509 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (420730712731861 / 4000000000000000 : ℝ) ≤
      (-(11260283236257531228509 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (420730712731861 / 4000000000000000 : ℝ) =
            (420730712731861 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (420730712731861 / 250000000000000 : ℝ) ≤
            (2602660369742468771491 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (209662000975611 / 2000000000000000 : ℝ)) (q :=
      (420730712731861 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_180_4 :
    Uω (aρ 4) (bρ 4) (952804716581 / 8000000000000 : ℝ) ≤
      (-(23370105378852098455103 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (966160368188257 / 10000000000000000 : ℝ) ≤
      (-(23370105378852098455103 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (966160368188257 / 10000000000000000 : ℝ) =
            (966160368188257 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (966160368188257 / 625000000000000 : ℝ) ≤
            (4355781833147901544897 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (119408919832533 / 1250000000000000 : ℝ)) (q :=
      (966160368188257 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_180_5 :
    Uω (aρ 5) (bρ 5) (952804716581 / 8000000000000 : ℝ) ≤
      (-(99718511009526859259 / 40000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1653293728550453 / 20000000000000000 : ℝ) ≤
      (-(99718511009526859259 / 40000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1653293728550453 / 20000000000000000 : ℝ) =
            (1653293728550453 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1653293728550453 / 1250000000000000 : ℝ) ≤
            (11185037838473140741 / 40000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (794434270169203 / 10000000000000000 : ℝ)) (q :=
      (1653293728550453 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_180_6 :
    Uω (aρ 6) (bρ 6) (952804716581 / 8000000000000 : ℝ) ≤
      (-(7087845139958546029759 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (587104198732817 / 10000000000000000 : ℝ) ≤
      (-(7087845139958546029759 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (587104198732817 / 10000000000000000 : ℝ) =
            (587104198732817 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (587104198732817 / 312500000000000 : ℝ) ≤
            (1576494613791453970241 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1885114508689 / 39062500000000 : ℝ)) (q :=
      (587104198732817 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_180_7 :
    Uω (aρ 7) (bρ 7) (952804716581 / 8000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_180_8 :
    Uω (aρ 8) (bρ 8) (952804716581 / 8000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_180_9 :
    Uω (aρ 9) (bρ 9) (952804716581 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_180_10 :
    Uω (aρ 10) (bρ 10) (952804716581 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_180_11 :
    Uω (aρ 11) (bρ 11) (952804716581 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_180_12 :
    Uω (aρ 12) (bρ 12) (952804716581 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_180_13 :
    Uω (aρ 13) (bρ 13) (952804716581 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_180_14 :
    Uω (aρ 14) (bρ 14) (952804716581 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_180_15 :
    Uω (aρ 15) (bρ 15) (952804716581 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_180_16 :
    Uω (aρ 16) (bρ 16) (952804716581 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_180 :
    Uρ (952804716581 / 8000000000000 : ℝ) ≤
      (-(5710967759615853715893 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (952804716581 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5458973319820460563247 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (952804716581 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11028304978811575276189 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (952804716581 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(11260283236257531228509 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (952804716581 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(23370105378852098455103 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (952804716581 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(99718511009526859259 / 40000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (952804716581 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7087845139958546029759 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (952804716581 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (952804716581 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (952804716581 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (952804716581 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (952804716581 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (952804716581 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (952804716581 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (952804716581 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (952804716581 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (952804716581 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_180_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_181_1 :
    Uω (aρ 1) (bρ 1) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(21773869343935046491781 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4533492068996301 / 40000000000000000 : ℝ) ≤
      (-(21773869343935046491781 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4533492068996301 / 40000000000000000 : ℝ) =
            (4533492068996301 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4533492068996301 / 2500000000000000 : ℝ) ≤
            (5952017868064953508219 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1133230374110963 / 10000000000000000 : ℝ)) (q :=
      (4533492068996301 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_181_2 :
    Uω (aρ 2) (bρ 2) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(21993159284954283541103 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (887031851692717 / 8000000000000000 : ℝ) ≤
      (-(21993159284954283541103 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (887031851692717 / 8000000000000000 : ℝ) =
            (887031851692717 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (887031851692717 / 500000000000000 : ℝ) ≤
            (5732727927045716458897 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (221566596270921 / 2000000000000000 : ℝ)) (q :=
      (887031851692717 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_181_3 :
    Uω (aρ 3) (bρ 3) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(11226974797381275692259 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (847085691507757 / 8000000000000000 : ℝ) ≤
      (-(11226974797381275692259 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (847085691507757 / 8000000000000000 : ℝ) =
            (847085691507757 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (847085691507757 / 500000000000000 : ℝ) ≤
            (2635968808618724307741 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (211072737448441 / 2000000000000000 : ℝ)) (q :=
      (847085691507757 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_181_4 :
    Uω (aρ 4) (bρ 4) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(1164851421249206849263 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3892986537824593 / 40000000000000000 : ℝ) ≤
      (-(1164851421249206849263 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3892986537824593 / 40000000000000000 : ℝ) =
            (3892986537824593 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3892986537824593 / 2500000000000000 : ℝ) ≤
            (221442939350793150737 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (962436908450109 / 10000000000000000 : ℝ)) (q :=
      (3892986537824593 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_181_5 :
    Uω (aρ 5) (bρ 5) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(24841844510715917490201 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3335741528413867 / 40000000000000000 : ℝ) ≤
      (-(24841844510715917490201 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3335741528413867 / 40000000000000000 : ℝ) =
            (3335741528413867 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3335741528413867 / 2500000000000000 : ℝ) ≤
            (2884042701284082509799 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (401002161539873 / 5000000000000000 : ℝ)) (q :=
      (3335741528413867 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_181_6 :
    Uω (aρ 6) (bρ 6) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(28207669885361066139551 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (476481944676323 / 8000000000000000 : ℝ) ≤
      (-(28207669885361066139551 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (476481944676323 / 8000000000000000 : ℝ) =
            (476481944676323 / 250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (476481944676323 / 250000000000000 : ℝ) ≤
            (6449689129638933860449 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (24628939785181 / 500000000000000 : ℝ)) (q :=
      (476481944676323 / 8000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_181_7 :
    Uω (aρ 7) (bρ 7) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_181_8 :
    Uω (aρ 8) (bρ 8) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_181_9 :
    Uω (aρ 9) (bρ 9) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_181_10 :
    Uω (aρ 10) (bρ 10) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_181_11 :
    Uω (aρ 11) (bρ 11) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_181_12 :
    Uω (aρ 12) (bρ 12) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_181_13 :
    Uω (aρ 13) (bρ 13) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_181_14 :
    Uω (aρ 14) (bρ 14) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_181_15 :
    Uω (aρ 15) (bρ 15) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_181_16 :
    Uω (aρ 16) (bρ 16) (3833641211111 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_181 :
    Uρ (3833641211111 / 32000000000000 : ℝ) ≤
      (-(22816840024414922085761 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3833641211111 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(21773869343935046491781 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3833641211111 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(21993159284954283541103 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3833641211111 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(11226974797381275692259 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3833641211111 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1164851421249206849263 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3833641211111 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(24841844510715917490201 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3833641211111 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(28207669885361066139551 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3833641211111 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3833641211111 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3833641211111 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3833641211111 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3833641211111 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3833641211111 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3833641211111 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3833641211111 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3833641211111 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3833641211111 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_181_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_182_1 :
    Uω (aρ 1) (bρ 1) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(542805695774513738577 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2280761753128937 / 20000000000000000 : ℝ) ≤
      (-(542805695774513738577 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2280761753128937 / 20000000000000000 : ℝ) =
            (2280761753128937 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2280761753128937 / 1250000000000000 : ℝ) ≤
            (150341484525486261423 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (285059777498953 / 2500000000000000 : ℝ)) (q :=
      (2280761753128937 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_182_2 :
    Uω (aρ 2) (bρ 2) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(10965054680357433308143 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (557901405604871 / 5000000000000000 : ℝ) ≤
      (-(10965054680357433308143 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (557901405604871 / 5000000000000000 : ℝ) =
            (557901405604871 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (557901405604871 / 312500000000000 : ℝ) ≤
            (2897888925642566691857 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1114851991796359 / 10000000000000000 : ℝ)) (q :=
      (557901405604871 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_182_3 :
    Uω (aρ 3) (bρ 3) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(22387776461924809992277 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2131774275828701 / 20000000000000000 : ℝ) ≤
      (-(22387776461924809992277 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2131774275828701 / 20000000000000000 : ℝ) =
            (2131774275828701 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2131774275828701 / 1250000000000000 : ℝ) ≤
            (5338110750075190007723 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (132802093944447 / 1250000000000000 : ℝ)) (q :=
      (2131774275828701 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_182_4 :
    Uω (aρ 4) (bρ 4) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(11612246722324450860351 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1960663483694801 / 20000000000000000 : ℝ) ≤
      (-(11612246722324450860351 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1960663483694801 / 20000000000000000 : ℝ) =
            (1960663483694801 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1960663483694801 / 1250000000000000 : ℝ) ≤
            (2250696883675549139649 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (242400035121669 / 2500000000000000 : ℝ)) (q :=
      (1960663483694801 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_182_5 :
    Uω (aρ 5) (bρ 5) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(6188721354787161308899 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (210304707658777 / 2500000000000000 : ℝ) ≤
      (-(6188721354787161308899 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (210304707658777 / 2500000000000000 : ℝ) =
            (210304707658777 / 156250000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (210304707658777 / 156250000000000 : ℝ) ≤
            (742750448212838691101 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (809564237397091 / 10000000000000000 : ℝ)) (q :=
      (210304707658777 / 2500000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_182_6 :
    Uω (aρ 6) (bρ 6) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(14033415111008318688351 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (151012556253559 / 2500000000000000 : ℝ) ≤
      (-(14033415111008318688351 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (151012556253559 / 2500000000000000 : ℝ) =
            (151012556253559 / 78125000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (151012556253559 / 78125000000000 : ℝ) ≤
            (3295264396491681311649 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (502467401295347 / 10000000000000000 : ℝ)) (q :=
      (151012556253559 / 2500000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_182_7 :
    Uω (aρ 7) (bρ 7) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_182_8 :
    Uω (aρ 8) (bρ 8) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_182_9 :
    Uω (aρ 9) (bρ 9) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_182_10 :
    Uω (aρ 10) (bρ 10) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_182_11 :
    Uω (aρ 11) (bρ 11) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_182_12 :
    Uω (aρ 12) (bρ 12) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_182_13 :
    Uω (aρ 13) (bρ 13) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_182_14 :
    Uω (aρ 14) (bρ 14) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_182_15 :
    Uω (aρ 15) (bρ 15) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_182_16 :
    Uω (aρ 16) (bρ 16) (1928031777949 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_182 :
    Uρ (1928031777949 / 16000000000000 : ℝ) ≤
      (-(11395079391242920398171 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1928031777949 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(542805695774513738577 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1928031777949 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10965054680357433308143 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1928031777949 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(22387776461924809992277 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1928031777949 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11612246722324450860351 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1928031777949 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6188721354787161308899 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1928031777949 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14033415111008318688351 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1928031777949 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1928031777949 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1928031777949 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1928031777949 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1928031777949 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1928031777949 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1928031777949 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1928031777949 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1928031777949 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1928031777949 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_182_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_183_1 :
    Uω (aρ 1) (bρ 1) (121903382671 / 1000000000000 : ℝ) ≤
      (-(431801468111400782417 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2308793126527319 / 20000000000000000 : ℝ) ≤
      (-(431801468111400782417 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2308793126527319 / 20000000000000000 : ℝ) =
            (2308793126527319 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2308793126527319 / 1250000000000000 : ℝ) ≤
            (122716276128599217583 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1154256517902319 / 10000000000000000 : ℝ)) (q :=
      (2308793126527319 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_183_2 :
    Uω (aρ 2) (bρ 2) (121903382671 / 1000000000000 : ℝ) ≤
      (-(10902595848206565310453 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2259657160477287 / 20000000000000000 : ℝ) ≤
      (-(10902595848206565310453 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2259657160477287 / 20000000000000000 : ℝ) =
            (2259657160477287 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2259657160477287 / 1250000000000000 : ℝ) ≤
            (2960347757793434689547 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1128889564362287 / 10000000000000000 : ℝ)) (q :=
      (2259657160477287 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_183_3 :
    Uω (aρ 3) (bρ 3) (121903382671 / 1000000000000 : ℝ) ≤
      (-(5564184476913954951537 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (107994628219273 / 1000000000000000 : ℝ) ≤
      (-(5564184476913954951537 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (107994628219273 / 1000000000000000 : ℝ) =
            (107994628219273 / 62500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (107994628219273 / 62500000000000 : ℝ) ≤
            (1367287326086045048463 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (53826053731023 / 500000000000000 : ℝ)) (q :=
      (107994628219273 / 1000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_183_4 :
    Uω (aρ 4) (bρ 4) (121903382671 / 1000000000000 : ℝ) ≤
      (-(23081016992543017206069 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1988997162470901 / 20000000000000000 : ℝ) ≤
      (-(23081016992543017206069 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1988997162470901 / 20000000000000000 : ℝ) =
            (1988997162470901 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1988997162470901 / 1250000000000000 : ℝ) ≤
            (4644870219456982793931 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (983919853770901 / 10000000000000000 : ℝ)) (q :=
      (1988997162470901 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_183_5 :
    Uω (aρ 5) (bρ 5) (121903382671 / 1000000000000 : ℝ) ≤
      (-(196666997090944639807 / 80000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (213942769321833 / 2500000000000000 : ℝ) ≤
      (-(196666997090944639807 / 80000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (213942769321833 / 2500000000000000 : ℝ) =
            (213942769321833 / 156250000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (213942769321833 / 156250000000000 : ℝ) ≤
            (25140100605055360193 / 80000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (12885230706401 / 156250000000000 : ℝ)) (q :=
      (213942769321833 / 2500000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_183_6 :
    Uω (aρ 6) (bρ 6) (121903382671 / 1000000000000 : ℝ) ≤
      (-(27793218382762658487643 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (620805937068547 / 10000000000000000 : ℝ) ≤
      (-(27793218382762658487643 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (620805937068547 / 10000000000000000 : ℝ) =
            (620805937068547 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (620805937068547 / 312500000000000 : ℝ) ≤
            (6864140632237341512357 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (260982429956047 / 5000000000000000 : ℝ)) (q :=
      (620805937068547 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_183_7 :
    Uω (aρ 7) (bρ 7) (121903382671 / 1000000000000 : ℝ) ≤
      (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_7]) (by norm_num [bρ_7])]; exact Lmid_7

lemma U_183_8 :
    Uω (aρ 8) (bρ 8) (121903382671 / 1000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_183_9 :
    Uω (aρ 9) (bρ 9) (121903382671 / 1000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_183_10 :
    Uω (aρ 10) (bρ 10) (121903382671 / 1000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_183_11 :
    Uω (aρ 11) (bρ 11) (121903382671 / 1000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_183_12 :
    Uω (aρ 12) (bρ 12) (121903382671 / 1000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_183_13 :
    Uω (aρ 13) (bρ 13) (121903382671 / 1000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_183_14 :
    Uω (aρ 14) (bρ 14) (121903382671 / 1000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_183_15 :
    Uω (aρ 15) (bρ 15) (121903382671 / 1000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_183_16 :
    Uω (aρ 16) (bρ 16) (121903382671 / 1000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_183 :
    Uρ (121903382671 / 1000000000000 : ℝ) ≤
      (-(22737794411188599503227 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (121903382671 / 1000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(431801468111400782417 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (121903382671 / 1000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10902595848206565310453 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (121903382671 / 1000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5564184476913954951537 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (121903382671 / 1000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(23081016992543017206069 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (121903382671 / 1000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(196666997090944639807 / 80000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (121903382671 / 1000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(27793218382762658487643 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (121903382671 / 1000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(33239459906384759787341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (121903382671 / 1000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (121903382671 / 1000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (121903382671 / 1000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (121903382671 / 1000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (121903382671 / 1000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (121903382671 / 1000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (121903382671 / 1000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (121903382671 / 1000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (121903382671 / 1000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_183_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
