/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U16) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_196_1 :
    Uω (aρ 1) (bρ 1) (242277170987 / 1600000000000 : ℝ) ≤
      (-(2414101464838475762107 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (181202947067443 / 1250000000000000 : ℝ) ≤
      (-(2414101464838475762107 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (181202947067443 / 1250000000000000 : ℝ) =
            (181202947067443 / 156250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (181202947067443 / 156250000000000 : ℝ) ≤
            (185200461286524237893 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (724756026247669 / 5000000000000000 : ℝ)) (q :=
      (181202947067443 / 1250000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_196_2 :
    Uω (aρ 2) (bρ 2) (242277170987 / 1600000000000 : ℝ) ≤
      (-(19482577160501416685469 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (356305423431271 / 2500000000000000 : ℝ) ≤
      (-(19482577160501416685469 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (356305423431271 / 2500000000000000 : ℝ) =
            (356305423431271 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (356305423431271 / 312500000000000 : ℝ) ≤
            (1311838248498583314531 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (712238649688209 / 5000000000000000 : ℝ)) (q :=
      (356305423431271 / 2500000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_196_3 :
    Uω (aρ 3) (bρ 3) (242277170987 / 1600000000000 : ℝ) ≤
      (-(4958726199469246675321 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2751762988469771 / 20000000000000000 : ℝ) ≤
      (-(4958726199469246675321 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2751762988469771 / 20000000000000000 : ℝ) =
            (2751762988469771 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2751762988469771 / 2500000000000000 : ℝ) ≤
            (239877652780753324679 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1373193006746021 / 10000000000000000 : ℝ)) (q :=
      (2751762988469771 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_196_4 :
    Uω (aρ 4) (bρ 4) (242277170987 / 1600000000000 : ℝ) ≤
      (-(10231450584493624514443 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1292133819311667 / 10000000000000000 : ℝ) ≤
      (-(10231450584493624514443 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1292133819311667 / 10000000000000000 : ℝ) =
            (1292133819311667 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1292133819311667 / 1250000000000000 : ℝ) ≤
            (165757120006375485557 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (160498979745573 / 1250000000000000 : ℝ)) (q :=
      (1292133819311667 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_196_5 :
    Uω (aρ 5) (bρ 5) (242277170987 / 1600000000000 : ℝ) ≤
      (-(2154930242961830379761 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2318225516752991 / 20000000000000000 : ℝ) ≤
      (-(2154930242961830379761 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2318225516752991 / 20000000000000000 : ℝ) =
            (2318225516752991 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2318225516752991 / 1250000000000000 : ℝ) ≤
            (617658478238169620239 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1136139635429241 / 10000000000000000 : ℝ)) (q :=
      (2318225516752991 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_196_6 :
    Uω (aρ 6) (bρ 6) (242277170987 / 1600000000000 : ℝ) ≤
      (-(5883976514400672601683 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (380109372357853 / 4000000000000000 : ℝ) ≤
      (-(5883976514400672601683 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (380109372357853 / 4000000000000000 : ℝ) =
            (380109372357853 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (380109372357853 / 250000000000000 : ℝ) ≤
            (1047495288599327398317 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (177140271121103 / 2000000000000000 : ℝ)) (q :=
      (380109372357853 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_196_7 :
    Uω (aρ 7) (bρ 7) (242277170987 / 1600000000000 : ℝ) ≤
      (-(28835587643811316305909 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (559353474134973 / 10000000000000000 : ℝ) ≤
      (-(28835587643811316305909 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (559353474134973 / 10000000000000000 : ℝ) =
            (559353474134973 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (559353474134973 / 312500000000000 : ℝ) ≤
            (5821771371188683694091 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (81880705711549 / 2500000000000000 : ℝ)) (q :=
      (559353474134973 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_196_8 :
    Uω (aρ 8) (bρ 8) (242277170987 / 1600000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_196_9 :
    Uω (aρ 9) (bρ 9) (242277170987 / 1600000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_196_10 :
    Uω (aρ 10) (bρ 10) (242277170987 / 1600000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_196_11 :
    Uω (aρ 11) (bρ 11) (242277170987 / 1600000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_196_12 :
    Uω (aρ 12) (bρ 12) (242277170987 / 1600000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_196_13 :
    Uω (aρ 13) (bρ 13) (242277170987 / 1600000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_196_14 :
    Uω (aρ 14) (bρ 14) (242277170987 / 1600000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_196_15 :
    Uω (aρ 15) (bρ 15) (242277170987 / 1600000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_196_16 :
    Uω (aρ 16) (bρ 16) (242277170987 / 1600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_196 :
    Uρ (242277170987 / 1600000000000 : ℝ) ≤
      (-(21470082810998145944539 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (242277170987 / 1600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2414101464838475762107 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (242277170987 / 1600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(19482577160501416685469 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (242277170987 / 1600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4958726199469246675321 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (242277170987 / 1600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10231450584493624514443 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (242277170987 / 1600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2154930242961830379761 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (242277170987 / 1600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5883976514400672601683 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (242277170987 / 1600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(28835587643811316305909 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (242277170987 / 1600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (242277170987 / 1600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (242277170987 / 1600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (242277170987 / 1600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (242277170987 / 1600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (242277170987 / 1600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (242277170987 / 1600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (242277170987 / 1600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (242277170987 / 1600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_196_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_197_1 :
    Uω (aρ 1) (bρ 1) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(9625896157689089085363 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11667969083933543 / 80000000000000000 : ℝ) ≤
      (-(9625896157689089085363 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11667969083933543 / 80000000000000000 : ℝ) =
            (11667969083933543 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11667969083933543 / 10000000000000000 : ℝ) ≤
            (771311546810910914637 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (729192644944271 / 5000000000000000 : ℝ)) (q :=
      (11667969083933543 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_197_2 :
    Uω (aρ 2) (bρ 2) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(9710244426699519995267 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11472785453890199 / 80000000000000000 : ℝ) ≤
      (-(9710244426699519995267 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11472785453890199 / 80000000000000000 : ℝ) =
            (11472785453890199 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11472785453890199 / 10000000000000000 : ℝ) ≤
            (686963277800480004733 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (716679197443853 / 5000000000000000 : ℝ)) (q :=
      (11472785453890199 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_197_3 :
    Uω (aρ 3) (bρ 3) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(9885252872164051723893 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (443126602470863 / 3200000000000000 : ℝ) ≤
      (-(9885252872164051723893 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (443126602470863 / 3200000000000000 : ℝ) =
            (443126602470863 / 400000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (443126602470863 / 400000000000000 : ℝ) ≤
            (511954832335948276107 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (27641988064161 / 200000000000000 : ℝ)) (q :=
      (443126602470863 / 3200000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_197_4 :
    Uω (aρ 4) (bρ 4) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(5098511423100886032829 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10408492554054399 / 80000000000000000 : ℝ) ≤
      (-(5098511423100886032829 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10408492554054399 / 80000000000000000 : ℝ) =
            (10408492554054399 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10408492554054399 / 10000000000000000 : ℝ) ≤
            (100092429149113967171 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (323243864335939 / 2500000000000000 : ℝ)) (q :=
      (10408492554054399 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_197_5 :
    Uω (aρ 5) (bρ 5) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(5367882483107103412791 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1869060181804003 / 16000000000000000 : ℝ) ≤
      (-(5367882483107103412791 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1869060181804003 / 16000000000000000 : ℝ) =
            (1869060181804003 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1869060181804003 / 1000000000000000 : ℝ) ≤
            (1563589319892896587209 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1789636664719 / 15625000000000 : ℝ)) (q :=
      (1869060181804003 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_197_6 :
    Uω (aρ 6) (bρ 6) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(5859077040181952131849 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7678281948881963 / 80000000000000000 : ℝ) ≤
      (-(5859077040181952131849 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (7678281948881963 / 80000000000000000 : ℝ) =
            (7678281948881963 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7678281948881963 / 5000000000000000 : ℝ) ≤
            (1072394762818047868151 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (895853100525647 / 10000000000000000 : ℝ)) (q :=
      (7678281948881963 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_197_7 :
    Uω (aρ 7) (bρ 7) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(7143266057875241232323 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4593858074959487 / 80000000000000000 : ℝ) ≤
      (-(7143266057875241232323 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (4593858074959487 / 80000000000000000 : ℝ) =
            (4593858074959487 / 2500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4593858074959487 / 2500000000000000 : ℝ) ≤
            (1521073695874758767677 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (87102128201257 / 2500000000000000 : ℝ)) (q :=
      (4593858074959487 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_197_8 :
    Uω (aρ 8) (bρ 8) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_197_9 :
    Uω (aρ 9) (bρ 9) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_197_10 :
    Uω (aρ 10) (bρ 10) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_197_11 :
    Uω (aρ 11) (bρ 11) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_197_12 :
    Uω (aρ 12) (bρ 12) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_197_13 :
    Uω (aρ 13) (bρ 13) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_197_14 :
    Uω (aρ 14) (bρ 14) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_197_15 :
    Uω (aρ 15) (bρ 15) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_197_16 :
    Uω (aρ 16) (bρ 16) (9747866874751 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_197 :
    Uρ (9747866874751 / 64000000000000 : ℝ) ≤
      (-(2678167143913165181433 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (9747866874751 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9625896157689089085363 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (9747866874751 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9710244426699519995267 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (9747866874751 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(9885252872164051723893 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (9747866874751 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5098511423100886032829 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (9747866874751 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5367882483107103412791 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (9747866874751 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5859077040181952131849 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (9747866874751 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7143266057875241232323 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (9747866874751 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (9747866874751 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (9747866874751 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (9747866874751 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (9747866874751 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (9747866874751 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (9747866874751 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (9747866874751 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (9747866874751 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_197_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_198_1 :
    Uω (aρ 1) (bρ 1) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(19191143047661083763181 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5869474744954929 / 40000000000000000 : ℝ) ≤
      (-(19191143047661083763181 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5869474744954929 / 40000000000000000 : ℝ) =
            (5869474744954929 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5869474744954929 / 5000000000000000 : ℝ) ≤
            (1603272361338916236819 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1467258510871527 / 10000000000000000 : ℝ)) (q :=
      (5869474744954929 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_198_2 :
    Uω (aρ 2) (bρ 2) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(9679392028817212299531 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5771898452129227 / 40000000000000000 : ℝ) ≤
      (-(9679392028817212299531 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5771898452129227 / 40000000000000000 : ℝ) =
            (5771898452129227 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5771898452129227 / 5000000000000000 : ℝ) ≤
            (717815675682787700469 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (360559844242169 / 2500000000000000 : ℝ)) (q :=
      (5771898452129227 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_198_3 :
    Uω (aρ 3) (bρ 3) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(492663008624633561373 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5574638202543499 / 40000000000000000 : ℝ) ≤
      (-(492663008624633561373 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5574638202543499 / 40000000000000000 : ℝ) =
            (5574638202543499 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5574638202543499 / 5000000000000000 : ℝ) ≤
            (27197376600366438627 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (347751339631453 / 2500000000000000 : ℝ)) (q :=
      (5574638202543499 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_198_4 :
    Uω (aρ 4) (bρ 4) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(20325666932152984631853 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5239954211957913 / 40000000000000000 : ℝ) ≤
      (-(20325666932152984631853 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5239954211957913 / 40000000000000000 : ℝ) =
            (5239954211957913 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5239954211957913 / 5000000000000000 : ℝ) ≤
            (468748476847015368147 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1301957544298019 / 10000000000000000 : ℝ)) (q :=
      (5239954211957913 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_198_5 :
    Uω (aρ 5) (bρ 5) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(42788762652914107141 / 20000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4708838715589633 / 40000000000000000 : ℝ) ≤
      (-(42788762652914107141 / 20000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4708838715589633 / 40000000000000000 : ℝ) =
            (4708838715589633 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4708838715589633 / 2500000000000000 : ℝ) ≤
            (12663011771085892859 / 20000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1154589715448879 / 10000000000000000 : ℝ)) (q :=
      (4708838715589633 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_198_6 :
    Uω (aρ 6) (bρ 6) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(23337831090964090934793 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3877134477197451 / 40000000000000000 : ℝ) ≤
      (-(23337831090964090934793 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3877134477197451 / 40000000000000000 : ℝ) =
            (3877134477197451 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3877134477197451 / 2500000000000000 : ℝ) ≤
            (4388056121035909065207 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (226494492848197 / 2500000000000000 : ℝ)) (q :=
      (3877134477197451 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_198_7 :
    Uω (aρ 7) (bρ 7) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(113301949068643981267 / 40000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (470901099739561 / 8000000000000000 : ℝ) ≤
      (-(113301949068643981267 / 40000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (470901099739561 / 8000000000000000 : ℝ) =
            (470901099739561 / 250000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (470901099739561 / 250000000000000 : ℝ) ≤
            (25327486991356018733 / 40000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (73664972580593 / 2000000000000000 : ℝ)) (q :=
      (470901099739561 / 8000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_198_8 :
    Uω (aρ 8) (bρ 8) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_198_9 :
    Uω (aρ 9) (bρ 9) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_198_10 :
    Uω (aρ 10) (bρ 10) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_198_11 :
    Uω (aρ 11) (bρ 11) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_198_12 :
    Uω (aρ 12) (bρ 12) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_198_13 :
    Uω (aρ 13) (bρ 13) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_198_14 :
    Uω (aρ 14) (bρ 14) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_198_15 :
    Uω (aρ 15) (bρ 15) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_198_16 :
    Uω (aρ 16) (bρ 16) (4902323455011 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_198 :
    Uρ (4902323455011 / 32000000000000 : ℝ) ≤
      (-(10691025983055117798807 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4902323455011 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(19191143047661083763181 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4902323455011 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9679392028817212299531 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4902323455011 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(492663008624633561373 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4902323455011 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(20325666932152984631853 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4902323455011 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(42788762652914107141 / 20000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4902323455011 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(23337831090964090934793 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4902323455011 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(113301949068643981267 / 40000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4902323455011 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4902323455011 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4902323455011 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4902323455011 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4902323455011 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4902323455011 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4902323455011 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4902323455011 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4902323455011 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_198_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_199_1 :
    Uω (aρ 1) (bρ 1) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(19130859451563604787399 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (472397193257161 / 3200000000000000 : ℝ) ≤
      (-(19130859451563604787399 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (472397193257161 / 3200000000000000 : ℝ) =
            (472397193257161 / 400000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (472397193257161 / 400000000000000 : ℝ) ≤
            (1663555957436395212601 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (59045268629609 / 400000000000000 : ℝ)) (q :=
      (472397193257161 / 3200000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_199_2 :
    Uω (aρ 2) (bρ 2) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(2412182257464382172739 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11614807909235877 / 80000000000000000 : ℝ) ≤
      (-(2412182257464382172739 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11614807909235877 / 80000000000000000 : ℝ) =
            (11614807909235877 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11614807909235877 / 10000000000000000 : ℝ) ≤
            (187119668660617827261 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (725560123850969 / 5000000000000000 : ℝ)) (q :=
      (11614807909235877 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_199_3 :
    Uω (aρ 3) (bρ 3) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(19642943299792789663527 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11220386017503029 / 80000000000000000 : ℝ) ≤
      (-(19642943299792789663527 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11220386017503029 / 80000000000000000 : ℝ) =
            (11220386017503029 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11220386017503029 / 10000000000000000 : ℝ) ≤
            (1151472109207210336473 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (699955440559363 / 5000000000000000 : ℝ)) (q :=
      (11220386017503029 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_199_4 :
    Uω (aρ 4) (bρ 4) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(20257758253733241645161 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10551318290073249 / 80000000000000000 : ℝ) ≤
      (-(20257758253733241645161 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10551318290073249 / 80000000000000000 : ℝ) =
            (10551318290073249 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10551318290073249 / 10000000000000000 : ℝ) ≤
            (536657155266758354839 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1310938130326281 / 10000000000000000 : ℝ)) (q :=
      (10551318290073249 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_199_5 :
    Uω (aρ 5) (bρ 5) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(5329461579391329115803 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1898006432818281 / 16000000000000000 : ℝ) ≤
      (-(5329461579391329115803 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1898006432818281 / 16000000000000000 : ℝ) =
            (1898006432818281 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1898006432818281 / 1000000000000000 : ℝ) ≤
            (1602010223608670884197 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (58190325908291 / 500000000000000 : ℝ)) (q :=
      (1898006432818281 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_199_6 :
    Uω (aρ 6) (bρ 6) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(23240447077305945546461 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7830152027979093 / 80000000000000000 : ℝ) ≤
      (-(23240447077305945546461 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (7830152027979093 / 80000000000000000 : ℝ) =
            (7830152027979093 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7830152027979093 / 5000000000000000 : ℝ) ≤
            (4485440134694054453539 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (458038429638871 / 5000000000000000 : ℝ)) (q :=
      (7830152027979093 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_199_7 :
    Uω (aρ 7) (bρ 7) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(28090691845157120020427 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (964176930281977 / 16000000000000000 : ℝ) ≤
      (-(28090691845157120020427 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (964176930281977 / 16000000000000000 : ℝ) =
            (964176930281977 / 500000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (964176930281977 / 500000000000000 : ℝ) ≤
            (6566667169842879979573 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4842767448693 / 125000000000000 : ℝ)) (q :=
      (964176930281977 / 16000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_199_8 :
    Uω (aρ 8) (bρ 8) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_199_9 :
    Uω (aρ 9) (bρ 9) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_199_10 :
    Uω (aρ 10) (bρ 10) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_199_11 :
    Uω (aρ 11) (bρ 11) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_199_12 :
    Uω (aρ 12) (bρ 12) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_199_13 :
    Uω (aρ 13) (bρ 13) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_199_14 :
    Uω (aρ 14) (bρ 14) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_199_15 :
    Uω (aρ 15) (bρ 15) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_199_16 :
    Uω (aρ 16) (bρ 16) (9861426945293 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_199 :
    Uρ (9861426945293 / 64000000000000 : ℝ) ≤
      (-(5335009962320976159597 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (9861426945293 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(19130859451563604787399 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (9861426945293 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2412182257464382172739 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (9861426945293 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19642943299792789663527 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (9861426945293 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(20257758253733241645161 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (9861426945293 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5329461579391329115803 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (9861426945293 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(23240447077305945546461 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (9861426945293 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(28090691845157120020427 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (9861426945293 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (9861426945293 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (9861426945293 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (9861426945293 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (9861426945293 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (9861426945293 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (9861426945293 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (9861426945293 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (9861426945293 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_199_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_200_1 :
    Uω (aρ 1) (bρ 1) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(9535468571688656894177 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (148511376370581 / 1000000000000000 : ℝ) ≤
      (-(9535468571688656894177 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (148511376370581 / 1000000000000000 : ℝ) =
            (148511376370581 / 125000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (148511376370581 / 125000000000000 : ℝ) ≤
            (861739132811343105823 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (297000980956699 / 2000000000000000 : ℝ)) (q :=
      (148511376370581 / 1000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_200_2 :
    Uω (aρ 2) (bρ 2) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(19236506232599800661231 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (292145461923753 / 2000000000000000 : ℝ) ≤
      (-(19236506232599800661231 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (292145461923753 / 2000000000000000 : ℝ) =
            (292145461923753 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (292145461923753 / 250000000000000 : ℝ) ≤
            (1557909176400199338769 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (292000201823881 / 2000000000000000 : ℝ)) (q :=
      (292145461923753 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_200_3 :
    Uω (aρ 3) (bρ 3) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(19579769410281550678357 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1411436741480521 / 10000000000000000 : ℝ) ≤
      (-(19579769410281550678357 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1411436741480521 / 10000000000000000 : ℝ) =
            (1411436741480521 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1411436741480521 / 1250000000000000 : ℝ) ≤
            (1214645998718449321643 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1408815979192917 / 10000000000000000 : ℝ)) (q :=
      (1411436741480521 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_200_4 :
    Uω (aρ 4) (bρ 4) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(2019031316175803607789 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2655680568768123 / 20000000000000000 : ℝ) ≤
      (-(2019031316175803607789 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2655680568768123 / 20000000000000000 : ℝ) =
            (2655680568768123 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2655680568768123 / 2500000000000000 : ℝ) ≤
            (60410224724196392211 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (659958623032499 / 5000000000000000 : ℝ)) (q :=
      (2655680568768123 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_200_5 :
    Uω (aρ 5) (bρ 5) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(21241914872470499005599 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1195295702671639 / 10000000000000000 : ℝ) ≤
      (-(21241914872470499005599 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1195295702671639 / 10000000000000000 : ℝ) =
            (1195295702671639 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1195295702671639 / 625000000000000 : ℝ) ≤
            (6483972339529500994401 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1173018001975153 / 10000000000000000 : ℝ)) (q :=
      (1195295702671639 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_200_6 :
    Uω (aρ 6) (bρ 6) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(23144129448493782607159 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (395296728475251 / 4000000000000000 : ℝ) ≤
      (-(23144129448493782607159 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (395296728475251 / 4000000000000000 : ℝ) =
            (395296728475251 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (395296728475251 / 250000000000000 : ℝ) ≤
            (4581757763506217392841 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (92615061414813 / 1000000000000000 : ℝ)) (q :=
      (395296728475251 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_200_7 :
    Uω (aρ 7) (bρ 7) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(13933497005570068083757 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (77030344441781 / 1250000000000000 : ℝ) ≤
      (-(13933497005570068083757 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (77030344441781 / 1250000000000000 : ℝ) = (77030344441781 / 39062500000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (77030344441781 / 39062500000000 : ℝ) ≤
            (3395182501929931916243 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (405813863600371 / 10000000000000000 : ℝ)) (q :=
      (77030344441781 / 1250000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_200_8 :
    Uω (aρ 8) (bρ 8) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_200_9 :
    Uω (aρ 9) (bρ 9) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_200_10 :
    Uω (aρ 10) (bρ 10) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_200_11 :
    Uω (aρ 11) (bρ 11) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_200_12 :
    Uω (aρ 12) (bρ 12) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_200_13 :
    Uω (aρ 13) (bρ 13) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_200_14 :
    Uω (aρ 14) (bρ 14) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_200_15 :
    Uω (aρ 15) (bρ 15) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_200_16 :
    Uω (aρ 16) (bρ 16) (2479551745141 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_200 :
    Uρ (2479551745141 / 16000000000000 : ℝ) ≤
      (-(21299154326957743988867 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2479551745141 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9535468571688656894177 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2479551745141 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(19236506232599800661231 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2479551745141 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19579769410281550678357 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2479551745141 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2019031316175803607789 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2479551745141 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(21241914872470499005599 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2479551745141 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(23144129448493782607159 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2479551745141 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(13933497005570068083757 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2479551745141 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2479551745141 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2479551745141 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2479551745141 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2479551745141 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2479551745141 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2479551745141 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2479551745141 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2479551745141 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_200_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_201_1 :
    Uω (aρ 1) (bρ 1) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(3808222024764513750947 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23832800450741223 / 160000000000000000 : ℝ) ≤
      (-(3808222024764513750947 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23832800450741223 / 160000000000000000 : ℝ) =
            (23832800450741223 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23832800450741223 / 20000000000000000 : ℝ) ≤
            (350661057035486249053 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1489441493458981 / 10000000000000000 : ℝ)) (q :=
      (23832800450741223 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_201_2 :
    Uω (aρ 2) (bρ 2) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(19206169210263464948851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23442647198638999 / 160000000000000000 : ℝ) ≤
      (-(19206169210263464948851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23442647198638999 / 160000000000000000 : ℝ) =
            (23442647198638999 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23442647198638999 / 20000000000000000 : ℝ) ≤
            (1588246198736535051149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1464441349456203 / 10000000000000000 : ℝ)) (q :=
      (23442647198638999 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_201_3 :
    Uω (aρ 3) (bρ 3) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(9774166025761886195709 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22654094524535327 / 160000000000000000 : ℝ) ≤
      (-(9774166025761886195709 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (22654094524535327 / 160000000000000000 : ℝ) =
            (22654094524535327 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22654094524535327 / 20000000000000000 : ℝ) ≤
            (623041678738113804291 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (353317092885811 / 2500000000000000 : ℝ)) (q :=
      (22654094524535327 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_201_4 :
    Uω (aρ 4) (bρ 4) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(20156762467954930955953 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21316844199038367 / 160000000000000000 : ℝ) ≤
      (-(20156762467954930955953 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (21316844199038367 / 160000000000000000 : ℝ) =
            (21316844199038367 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21316844199038367 / 20000000000000000 : ℝ) ≤
            (637652941045069044047 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (331101565480281 / 2500000000000000 : ℝ)) (q :=
      (21316844199038367 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_201_5 :
    Uω (aρ 5) (bρ 5) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(10602086210028209019321 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19197049055365631 / 160000000000000000 : ℝ) ≤
      (-(10602086210028209019321 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19197049055365631 / 160000000000000000 : ℝ) =
            (19197049055365631 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19197049055365631 / 10000000000000000 : ℝ) ≤
            (3260857395971790980679 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (147202723537129 / 1250000000000000 : ℝ)) (q :=
      (19197049055365631 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_201_6 :
    Uω (aρ 6) (bρ 6) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(23096362479439773573517 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3177515664269971 / 32000000000000000 : ℝ) ≤
      (-(23096362479439773573517 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3177515664269971 / 32000000000000000 : ℝ) =
            (3177515664269971 / 2000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3177515664269971 / 2000000000000000 : ℝ) ≤
            (4629524732560226426483 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (46558916084253 / 500000000000000 : ℝ)) (q :=
      (3177515664269971 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_201_7 :
    Uω (aρ 7) (bρ 7) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(27758876997846690296493 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9967064568070847 / 160000000000000000 : ℝ) ≤
      (-(27758876997846690296493 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (9967064568070847 / 160000000000000000 : ℝ) =
            (9967064568070847 / 5000000000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9967064568070847 / 5000000000000000 : ℝ) ≤
            (6898482017153309703507 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6480866926331 / 156250000000000 : ℝ)) (q :=
      (9967064568070847 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_201_8 :
    Uω (aρ 8) (bρ 8) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_201_9 :
    Uω (aρ 9) (bρ 9) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_201_10 :
    Uω (aρ 10) (bρ 10) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_201_11 :
    Uω (aρ 11) (bρ 11) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_201_12 :
    Uω (aρ 12) (bρ 12) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_201_13 :
    Uω (aρ 13) (bρ 13) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_201_14 :
    Uω (aρ 14) (bρ 14) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_201_15 :
    Uω (aρ 15) (bρ 15) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_201_16 :
    Uω (aρ 16) (bρ 16) (19893193996399 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_201 :
    Uρ (19893193996399 / 128000000000000 : ℝ) ≤
      (-(1063954824476878769469 / 500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (19893193996399 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3808222024764513750947 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (19893193996399 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(19206169210263464948851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (19893193996399 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(9774166025761886195709 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (19893193996399 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(20156762467954930955953 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (19893193996399 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10602086210028209019321 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (19893193996399 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(23096362479439773573517 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (19893193996399 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(27758876997846690296493 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (19893193996399 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (19893193996399 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (19893193996399 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (19893193996399 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (19893193996399 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (19893193996399 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (19893193996399 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (19893193996399 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (19893193996399 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_201_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_202_1 :
    Uω (aρ 1) (bρ 1) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(19011371817764254291277 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11951890325690203 / 80000000000000000 : ℝ) ≤
      (-(19011371817764254291277 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11951890325690203 / 80000000000000000 : ℝ) =
            (11951890325690203 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11951890325690203 / 10000000000000000 : ℝ) ≤
            (1783043591235745708723 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (373469519570833 / 2500000000000000 : ℝ)) (q :=
      (11951890325690203 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_202_2 :
    Uω (aρ 2) (bρ 2) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(19175924033595514993157 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11756828615332171 / 80000000000000000 : ℝ) ≤
      (-(19175924033595514993157 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11756828615332171 / 80000000000000000 : ℝ) =
            (11756828615332171 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11756828615332171 / 10000000000000000 : ℝ) ≤
            (1618491375404485006843 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (91805103950239 / 625000000000000 : ℝ)) (q :=
      (11756828615332171 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_202_3 :
    Uω (aρ 3) (bρ 3) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(19516993576980804934593 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11362600180108659 / 80000000000000000 : ℝ) ≤
      (-(19516993576980804934593 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11362600180108659 / 80000000000000000 : ℝ) =
            (11362600180108659 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11362600180108659 / 10000000000000000 : ℝ) ≤
            (1277421832019195065407 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (708860330373973 / 5000000000000000 : ℝ)) (q :=
      (11362600180108659 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_202_4 :
    Uω (aρ 4) (bρ 4) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(10061662648026687643777 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10694120498127499 / 80000000000000000 : ℝ) ≤
      (-(10061662648026687643777 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10694120498127499 / 80000000000000000 : ℝ) =
            (10694120498127499 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10694120498127499 / 10000000000000000 : ℝ) ≤
            (335545056473312356223 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (166111865164707 / 1250000000000000 : ℝ)) (q :=
      (10694120498127499 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_202_5 :
    Uω (aρ 5) (bρ 5) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(2645822151221018910863 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1926935660068307 / 16000000000000000 : ℝ) ≤
      (-(2645822151221018910863 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1926935660068307 / 16000000000000000 : ℝ) =
            (1926935660068307 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1926935660068307 / 1000000000000000 : ℝ) ≤
            (819913750278981089137 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (236444858241233 / 2000000000000000 : ℝ)) (q :=
      (1926935660068307 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_202_6 :
    Uω (aρ 6) (bρ 6) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(5762213143197609709187 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7981619824227011 / 80000000000000000 : ℝ) ≤
      (-(5762213143197609709187 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (7981619824227011 / 80000000000000000 : ℝ) =
            (7981619824227011 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7981619824227011 / 5000000000000000 : ℝ) ≤
            (1169258659802390290813 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (468100023658767 / 5000000000000000 : ℝ)) (q :=
      (7981619824227011 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_202_7 :
    Uω (aρ 7) (bρ 7) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(13826526486999273842053 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5036550062220967 / 80000000000000000 : ℝ) ≤
      (-(13826526486999273842053 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (5036550062220967 / 80000000000000000 : ℝ) =
            (5036550062220967 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5036550062220967 / 5000000000000000 : ℝ) ≤
            (36417119000726157947 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (423593987576023 / 10000000000000000 : ℝ)) (q :=
      (5036550062220967 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_202_8 :
    Uω (aρ 8) (bρ 8) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_202_9 :
    Uω (aρ 9) (bρ 9) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_202_10 :
    Uω (aρ 10) (bρ 10) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_202_11 :
    Uω (aρ 11) (bρ 11) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_202_12 :
    Uω (aρ 12) (bρ 12) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_202_13 :
    Uω (aρ 13) (bρ 13) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_202_14 :
    Uω (aρ 14) (bρ 14) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_202_15 :
    Uω (aρ 15) (bρ 15) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_202_16 :
    Uω (aρ 16) (bρ 16) (1994997403167 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_202 :
    Uρ (1994997403167 / 12800000000000 : ℝ) ≤
      (-(21259278159574063461509 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1994997403167 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(19011371817764254291277 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1994997403167 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(19175924033595514993157 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1994997403167 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19516993576980804934593 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1994997403167 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10061662648026687643777 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1994997403167 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2645822151221018910863 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1994997403167 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5762213143197609709187 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1994997403167 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(13826526486999273842053 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1994997403167 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1994997403167 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1994997403167 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1994997403167 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1994997403167 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1994997403167 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1994997403167 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1994997403167 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1994997403167 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_202_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_203_1 :
    Uω (aρ 1) (bρ 1) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(18981721698975795827751 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4794952164296841 / 32000000000000000 : ℝ) ≤
      (-(18981721698975795827751 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4794952164296841 / 32000000000000000 : ℝ) =
            (4794952164296841 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4794952164296841 / 4000000000000000 : ℝ) ≤
            (1812693710024204172249 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (37457866482269 / 250000000000000 : ℝ)) (q :=
      (4794952164296841 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_203_2 :
    Uω (aρ 2) (bρ 2) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(3829154029520808723151 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23584667051899501 / 160000000000000000 : ℝ) ≤
      (-(3829154029520808723151 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23584667051899501 / 160000000000000000 : ℝ) =
            (23584667051899501 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23584667051899501 / 20000000000000000 : ℝ) ≤
            (329729052279191276849 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (92082621912667 / 625000000000000 : ℝ)) (q :=
      (23584667051899501 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_203_3 :
    Uω (aρ 3) (bρ 3) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(19485753364276007235131 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22796305378484141 / 160000000000000000 : ℝ) ≤
      (-(19485753364276007235131 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (22796305378484141 / 160000000000000000 : ℝ) =
            (22796305378484141 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22796305378484141 / 20000000000000000 : ℝ) ≤
            (1308662044723992764869 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (177771605971969 / 1250000000000000 : ℝ)) (q :=
      (22796305378484141 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_203_4 :
    Uω (aρ 4) (bρ 4) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(4018000174308122372943 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4291926994118857 / 32000000000000000 : ℝ) ≤
      (-(4018000174308122372943 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4291926994118857 / 32000000000000000 : ℝ) =
            (4291926994118857 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4291926994118857 / 4000000000000000 : ℝ) ≤
            (140882907491877627057 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33334580696363 / 250000000000000 : ℝ)) (q :=
      (4291926994118857 / 32000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_203_5 :
    Uω (aρ 5) (bρ 5) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(4225825611375491178981 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19341653998148173 / 160000000000000000 : ℝ) ≤
      (-(4225825611375491178981 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19341653998148173 / 160000000000000000 : ℝ) =
            (19341653998148173 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19341653998148173 / 10000000000000000 : ℝ) ≤
            (1319351831024508821019 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (296706381408439 / 2500000000000000 : ℝ)) (q :=
      (19341653998148173 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_203_6 :
    Uω (aρ 6) (bρ 6) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(1437599792363333804987 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16038853886297317 / 160000000000000000 : ℝ) ≤
      (-(1437599792363333804987 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (16038853886297317 / 160000000000000000 : ℝ) =
            (16038853886297317 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16038853886297317 / 10000000000000000 : ℝ) ≤
            (295268158386666195013 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (941215886792399 / 10000000000000000 : ℝ)) (q :=
      (16038853886297317 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_203_7 :
    Uω (aρ 7) (bρ 7) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(27549393096344733901133 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10178060827909021 / 160000000000000000 : ℝ) ≤
      (-(27549393096344733901133 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (10178060827909021 / 160000000000000000 : ℝ) =
            (10178060827909021 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10178060827909021 / 10000000000000000 : ℝ) ≤
            (176494115655266098867 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (216139067626931 / 5000000000000000 : ℝ)) (q :=
      (10178060827909021 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_203_8 :
    Uω (aρ 8) (bρ 8) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_203_9 :
    Uω (aρ 9) (bρ 9) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_203_10 :
    Uω (aρ 10) (bρ 10) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_203_11 :
    Uω (aρ 11) (bρ 11) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_203_12 :
    Uω (aρ 12) (bρ 12) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_203_13 :
    Uω (aρ 13) (bρ 13) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_203_14 :
    Uω (aρ 14) (bρ 14) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_203_15 :
    Uω (aρ 15) (bρ 15) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_203_16 :
    Uω (aρ 16) (bρ 16) (20006754066941 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_203 :
    Uρ (20006754066941 / 128000000000000 : ℝ) ≤
      (-(21239687987825780551489 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20006754066941 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18981721698975795827751 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20006754066941 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3829154029520808723151 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20006754066941 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19485753364276007235131 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20006754066941 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4018000174308122372943 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20006754066941 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4225825611375491178981 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20006754066941 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1437599792363333804987 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20006754066941 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(27549393096344733901133 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20006754066941 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20006754066941 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20006754066941 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20006754066941 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20006754066941 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20006754066941 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20006754066941 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (20006754066941 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20006754066941 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_203_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_204_1 :
    Uω (aρ 1) (bρ 1) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(18952159245899628942921 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6011435240330763 / 40000000000000000 : ℝ) ≤
      (-(18952159245899628942921 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6011435240330763 / 40000000000000000 : ℝ) =
            (6011435240330763 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6011435240330763 / 5000000000000000 : ℝ) ≤
            (1842256163100371057079 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1502751236515069 / 10000000000000000 : ℝ)) (q :=
      (6011435240330763 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_204_2 :
    Uω (aρ 2) (bρ 2) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(2389463375289662657993 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5913919166061143 / 40000000000000000 : ℝ) ≤
      (-(2389463375289662657993 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5913919166061143 / 40000000000000000 : ℝ) =
            (5913919166061143 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5913919166061143 / 5000000000000000 : ℝ) ≤
            (209838550835337342007 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1477762211890259 / 10000000000000000 : ℝ)) (q :=
      (5913919166061143 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_204_3 :
    Uω (aρ 3) (bρ 3) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(19454610796911121675621 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5716852396747183 / 40000000000000000 : ℝ) ≤
      (-(19454610796911121675621 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5716852396747183 / 40000000000000000 : ℝ) =
            (5716852396747183 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5716852396747183 / 5000000000000000 : ℝ) ≤
            (1339804612088878324379 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1426624933583279 / 10000000000000000 : ℝ)) (q :=
      (5716852396747183 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_204_4 :
    Uω (aρ 4) (bρ 4) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(20056788427891101095629 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5382756537616719 / 40000000000000000 : ℝ) ≤
      (-(20056788427891101095629 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5382756537616719 / 40000000000000000 : ℝ) =
            (5382756537616719 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5382756537616719 / 5000000000000000 : ℝ) ≤
            (737626981108898904371 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1337871185083047 / 10000000000000000 : ℝ)) (q :=
      (5382756537616719 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_204_5 :
    Uω (aρ 5) (bρ 5) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(4218364758269121785757 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4853485341333163 / 40000000000000000 : ℝ) ≤
      (-(4218364758269121785757 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4853485341333163 / 40000000000000000 : ℝ) =
            (4853485341333163 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4853485341333163 / 2500000000000000 : ℝ) ≤
            (1326812684130878214243 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1191425506276269 / 10000000000000000 : ℝ)) (q :=
      (4853485341333163 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_204_6 :
    Uω (aρ 6) (bρ 6) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(22954591801955800902821 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4028605445931183 / 40000000000000000 : ℝ) ≤
      (-(22954591801955800902821 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4028605445931183 / 40000000000000000 : ℝ) =
            (4028605445931183 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4028605445931183 / 2500000000000000 : ℝ) ≤
            (4771295410044199097179 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (946225933715279 / 10000000000000000 : ℝ)) (q :=
      (4028605445931183 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_204_7 :
    Uω (aρ 7) (bρ 7) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(68619450712148196321 / 25000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2570502550129551 / 40000000000000000 : ℝ) ≤
      (-(68619450712148196321 / 25000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2570502550129551 / 40000000000000000 : ℝ) =
            (2570502550129551 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2570502550129551 / 2500000000000000 : ℝ) ≤
            (695267317851803679 / 25000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (440835866574463 / 10000000000000000 : ℝ)) (q :=
      (2570502550129551 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_204_8 :
    Uω (aρ 8) (bρ 8) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_204_9 :
    Uω (aρ 9) (bρ 9) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_204_10 :
    Uω (aρ 10) (bρ 10) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_204_11 :
    Uω (aρ 11) (bρ 11) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_204_12 :
    Uω (aρ 12) (bρ 12) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_204_13 :
    Uω (aρ 13) (bρ 13) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_204_14 :
    Uω (aρ 14) (bρ 14) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_204_15 :
    Uω (aρ 15) (bρ 15) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_204_16 :
    Uω (aρ 16) (bρ 16) (5015883525553 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_204 :
    Uρ (5015883525553 / 32000000000000 : ℝ) ≤
      (-(848812625190008480521 / 400000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5015883525553 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18952159245899628942921 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5015883525553 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2389463375289662657993 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5015883525553 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19454610796911121675621 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5015883525553 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(20056788427891101095629 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5015883525553 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4218364758269121785757 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5015883525553 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22954591801955800902821 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5015883525553 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(68619450712148196321 / 25000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5015883525553 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5015883525553 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5015883525553 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5015883525553 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5015883525553 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5015883525553 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5015883525553 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5015883525553 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5015883525553 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_204_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_205_1 :
    Uω (aρ 1) (bρ 1) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(4730670985398022320463 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4823344214232847 / 32000000000000000 : ℝ) ≤
      (-(4730670985398022320463 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4823344214232847 / 32000000000000000 : ℝ) =
            (4823344214232847 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4823344214232847 / 4000000000000000 : ℝ) ≤
            (467932866851977679537 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (150718780998967 / 1000000000000000 : ℝ)) (q :=
      (4823344214232847 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_205_2 :
    Uω (aρ 2) (bρ 2) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(9542867026361629120287 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23726686069576899 / 160000000000000000 : ℝ) ≤
      (-(9542867026361629120287 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23726686069576899 / 160000000000000000 : ℝ) =
            (23726686069576899 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23726686069576899 / 20000000000000000 : ℝ) ≤
            (854340678138370879713 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1482202447301253 / 10000000000000000 : ℝ)) (q :=
      (23726686069576899 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_205_3 :
    Uω (aρ 3) (bρ 3) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(3884713052838447392357 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22938512993288603 / 160000000000000000 : ℝ) ≤
      (-(3884713052838447392357 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (22938512993288603 / 160000000000000000 : ℝ) =
            (22938512993288603 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22938512993288603 / 20000000000000000 : ℝ) ≤
            (274170028961552607643 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (89442307444701 / 625000000000000 : ℝ)) (q :=
      (22938512993288603 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_205_4 :
    Uω (aρ 4) (bρ 4) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(2502960900806985594063 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4320482912780263 / 32000000000000000 : ℝ) ≤
      (-(2502960900806985594063 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4320482912780263 / 32000000000000000 : ℝ) =
            (4320482912780263 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4320482912780263 / 4000000000000000 : ℝ) ≤
            (96341025318014405937 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (268471759301361 / 2000000000000000 : ℝ)) (q :=
      (4320482912780263 / 32000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_205_5 :
    Uω (aρ 5) (bρ 5) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(421093265151500674027 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19486218817967691 / 160000000000000000 : ℝ) ≤
      (-(421093265151500674027 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19486218817967691 / 160000000000000000 : ℝ) =
            (19486218817967691 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19486218817967691 / 10000000000000000 : ℝ) ≤
            (133424479088499325973 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (598012123800051 / 5000000000000000 : ℝ)) (q :=
      (19486218817967691 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_205_6 :
    Uω (aρ 6) (bρ 6) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(22907835009299187804699 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16189944072949099 / 160000000000000000 : ℝ) ≤
      (-(22907835009299187804699 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (16189944072949099 / 160000000000000000 : ℝ) =
            (16189944072949099 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16189944072949099 / 10000000000000000 : ℝ) ≤
            (4818052202700812195301 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (475615139806389 / 5000000000000000 : ℝ)) (q :=
      (16189944072949099 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_205_7 :
    Uω (aρ 7) (bρ 7) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(27348107758450982129949 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10385006033903507 / 160000000000000000 : ℝ) ≤
      (-(27348107758450982129949 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (10385006033903507 / 160000000000000000 : ℝ) =
            (10385006033903507 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10385006033903507 / 10000000000000000 : ℝ) ≤
            (377779453549017870051 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (449274405492079 / 10000000000000000 : ℝ)) (q :=
      (10385006033903507 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_205_8 :
    Uω (aρ 8) (bρ 8) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_205_9 :
    Uω (aρ 9) (bρ 9) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_205_10 :
    Uω (aρ 10) (bρ 10) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_205_11 :
    Uω (aρ 11) (bρ 11) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_205_12 :
    Uω (aρ 12) (bρ 12) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_205_13 :
    Uω (aρ 13) (bρ 13) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_205_14 :
    Uω (aρ 14) (bρ 14) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_205_15 :
    Uω (aρ 15) (bρ 15) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_205_16 :
    Uω (aρ 16) (bρ 16) (20120314137483 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_205 :
    Uρ (20120314137483 / 128000000000000 : ℝ) ≤
      (-(165633997039833799489 / 78125000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20120314137483 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4730670985398022320463 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20120314137483 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9542867026361629120287 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20120314137483 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3884713052838447392357 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20120314137483 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2502960900806985594063 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20120314137483 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(421093265151500674027 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20120314137483 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22907835009299187804699 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20120314137483 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(27348107758450982129949 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20120314137483 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20120314137483 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20120314137483 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20120314137483 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20120314137483 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20120314137483 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20120314137483 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (20120314137483 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20120314137483 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_205_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_206_1 :
    Uω (aρ 1) (bρ 1) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(151146362189353403557 / 80000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12093850575635933 / 80000000000000000 : ℝ) ≤
      (-(151146362189353403557 / 80000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12093850575635933 / 80000000000000000 : ℝ) =
            (12093850575635933 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12093850575635933 / 10000000000000000 : ℝ) ≤
            (15208961082646596443 / 80000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1511624379747577 / 10000000000000000 : ℝ)) (q :=
      (12093850575635933 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_206_2 :
    Uω (aρ 2) (bρ 2) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(1905585075871011538629 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11898847634875677 / 80000000000000000 : ℝ) ≤
      (-(1905585075871011538629 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11898847634875677 / 80000000000000000 : ℝ) =
            (11898847634875677 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11898847634875677 / 10000000000000000 : ℝ) ≤
            (173856465028988461371 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1486642657067513 / 10000000000000000 : ℝ)) (q :=
      (11898847634875677 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_206_3 :
    Uω (aρ 3) (bρ 3) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(775704646446275497539 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11504807802423677 / 80000000000000000 : ℝ) ≤
      (-(775704646446275497539 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11504807802423677 / 80000000000000000 : ℝ) =
            (11504807802423677 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11504807802423677 / 10000000000000000 : ℝ) ≤
            (56071969913724502461 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1435528805304513 / 10000000000000000 : ℝ)) (q :=
      (11504807802423677 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_206_4 :
    Uω (aρ 4) (bρ 4) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(19990696456353944320339 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10836900119275209 / 80000000000000000 : ℝ) ≤
      (-(19990696456353944320339 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10836900119275209 / 80000000000000000 : ℝ) =
            (10836900119275209 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10836900119275209 / 10000000000000000 : ℝ) ≤
            (803718952646055679661 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (336711516395599 / 2500000000000000 : ℝ)) (q :=
      (10836900119275209 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_206_5 :
    Uω (aρ 5) (bρ 5) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(21017645314166303358547 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1955848646998037 / 16000000000000000 : ℝ) ≤
      (-(21017645314166303358547 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1955848646998037 / 16000000000000000 : ℝ) =
            (1955848646998037 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1955848646998037 / 1000000000000000 : ℝ) ≤
            (6708241897833696641453 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (60031088192307 / 500000000000000 : ℝ)) (q :=
      (1955848646998037 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_206_6 :
    Uω (aρ 6) (bρ 6) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(11430661709532966677083 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8132710735015393 / 80000000000000000 : ℝ) ≤
      (-(11430661709532966677083 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8132710735015393 / 80000000000000000 : ℝ) =
            (8132710735015393 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8132710735015393 / 5000000000000000 : ℝ) ≤
            (2432281896467033322917 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (478114506996221 / 5000000000000000 : ℝ)) (q :=
      (8132710735015393 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_206_7 :
    Uω (aρ 7) (bρ 7) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(13625138903623822801247 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5243550540331877 / 80000000000000000 : ℝ) ≤
      (-(13625138903623822801247 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (5243550540331877 / 80000000000000000 : ℝ) =
            (5243550540331877 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5243550540331877 / 5000000000000000 : ℝ) ≤
            (237804702376177198753 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (457600346081563 / 10000000000000000 : ℝ)) (q :=
      (5243550540331877 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_206_8 :
    Uω (aρ 8) (bρ 8) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_206_9 :
    Uω (aρ 9) (bρ 9) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_206_10 :
    Uω (aρ 10) (bρ 10) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_206_11 :
    Uω (aρ 11) (bρ 11) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_206_12 :
    Uω (aρ 12) (bρ 12) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_206_13 :
    Uω (aρ 13) (bρ 13) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_206_14 :
    Uω (aρ 14) (bρ 14) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_206_15 :
    Uω (aρ 15) (bρ 15) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_206_16 :
    Uω (aρ 16) (bρ 16) (10088547086377 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_206 :
    Uρ (10088547086377 / 64000000000000 : ℝ) ≤
      (-(21182187273591068333859 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10088547086377 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(151146362189353403557 / 80000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10088547086377 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1905585075871011538629 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10088547086377 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(775704646446275497539 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10088547086377 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19990696456353944320339 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10088547086377 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(21017645314166303358547 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10088547086377 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11430661709532966677083 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10088547086377 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(13625138903623822801247 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10088547086377 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10088547086377 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10088547086377 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10088547086377 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10088547086377 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10088547086377 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10088547086377 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10088547086377 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10088547086377 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_206_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_207_1 :
    Uω (aρ 1) (bρ 1) (809354968321 / 5120000000000 : ℝ) ≤
      (-(9431996367126526943871 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24258681201906977 / 160000000000000000 : ℝ) ≤
      (-(9431996367126526943871 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24258681201906977 / 160000000000000000 : ℝ) =
            (24258681201906977 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24258681201906977 / 20000000000000000 : ℝ) ≤
            (965211337373473056129 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1516060945821419 / 10000000000000000 : ℝ)) (q :=
      (24258681201906977 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_207_2 :
    Uω (aρ 2) (bρ 2) (809354968321 / 5120000000000 : ℝ) ≤
      (-(4756514146251913096419 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23868704266600737 / 160000000000000000 : ℝ) ≤
      (-(4756514146251913096419 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23868704266600737 / 160000000000000000 : ℝ) =
            (23868704266600737 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23868704266600737 / 20000000000000000 : ℝ) ≤
            (442089705998086903581 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1491082841418139 / 10000000000000000 : ℝ)) (q :=
      (23868704266600737 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_207_3 :
    Uω (aρ 3) (bρ 3) (809354968321 / 5120000000000 : ℝ) ≤
      (-(19361762888502309310361 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23080717429036129 / 160000000000000000 : ℝ) ≤
      (-(19361762888502309310361 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23080717429036129 / 160000000000000000 : ℝ) =
            (23080717429036129 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23080717429036129 / 20000000000000000 : ℝ) ≤
            (1432652520497690689639 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1439980593072563 / 10000000000000000 : ℝ)) (q :=
      (23080717429036129 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_207_4 :
    Uω (aρ 4) (bρ 4) (809354968321 / 5120000000000 : ℝ) ≤
      (-(4989453858591348907371 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (173961465613581 / 1280000000000000 : ℝ) ≤
      (-(4989453858591348907371 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (173961465613581 / 1280000000000000 : ℝ) =
            (173961465613581 / 160000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (173961465613581 / 160000000000000 : ℝ) ≤
            (209149993658651092629 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5405331982881 / 40000000000000 : ℝ)) (q :=
      (173961465613581 / 1280000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_207_5 :
    Uω (aρ 5) (bρ 5) (809354968321 / 5120000000000 : ℝ) ≤
      (-(262259610421003907303 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19630744433529281 / 160000000000000000 : ℝ) ≤
      (-(262259610421003907303 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19630744433529281 / 160000000000000000 : ℝ) =
            (19630744433529281 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19630744433529281 / 10000000000000000 : ℝ) ≤
            (84313979728996092697 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1205218069034207 / 10000000000000000 : ℝ)) (q :=
      (19630744433529281 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_207_6 :
    Uω (aρ 6) (bρ 6) (809354968321 / 5120000000000 : ℝ) ≤
      (-(22815054204177024956727 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16340854675340329 / 160000000000000000 : ℝ) ≤
      (-(22815054204177024956727 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (16340854675340329 / 160000000000000000 : ℝ) =
            (16340854675340329 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16340854675340329 / 10000000000000000 : ℝ) ≤
            (4910833007822975043273 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (240305556100147 / 2500000000000000 : ℝ)) (q :=
      (16340854675340329 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_207_7 :
    Uω (aρ 7) (bρ 7) (809354968321 / 5120000000000 : ℝ) ≤
      (-(1086168029808033831629 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10588343642389297 / 160000000000000000 : ℝ) ≤
      (-(1086168029808033831629 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (10588343642389297 / 160000000000000000 : ℝ) =
            (10588343642389297 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10588343642389297 / 10000000000000000 : ℝ) ≤
            (22867458671966168371 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (465819726041709 / 10000000000000000 : ℝ)) (q :=
      (10588343642389297 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_207_8 :
    Uω (aρ 8) (bρ 8) (809354968321 / 5120000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_207_9 :
    Uω (aρ 9) (bρ 9) (809354968321 / 5120000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_207_10 :
    Uω (aρ 10) (bρ 10) (809354968321 / 5120000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_207_11 :
    Uω (aρ 11) (bρ 11) (809354968321 / 5120000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_207_12 :
    Uω (aρ 12) (bρ 12) (809354968321 / 5120000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_207_13 :
    Uω (aρ 13) (bρ 13) (809354968321 / 5120000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_207_14 :
    Uω (aρ 14) (bρ 14) (809354968321 / 5120000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_207_15 :
    Uω (aρ 15) (bρ 15) (809354968321 / 5120000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_207_16 :
    Uω (aρ 16) (bρ 16) (809354968321 / 5120000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_207 :
    Uρ (809354968321 / 5120000000000 : ℝ) ≤
      (-(169307316687165452409 / 80000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (809354968321 / 5120000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9431996367126526943871 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (809354968321 / 5120000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4756514146251913096419 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (809354968321 / 5120000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19361762888502309310361 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (809354968321 / 5120000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4989453858591348907371 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (809354968321 / 5120000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(262259610421003907303 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (809354968321 / 5120000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22815054204177024956727 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (809354968321 / 5120000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1086168029808033831629 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (809354968321 / 5120000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (809354968321 / 5120000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (809354968321 / 5120000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (809354968321 / 5120000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (809354968321 / 5120000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (809354968321 / 5120000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (809354968321 / 5120000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (809354968321 / 5120000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (809354968321 / 5120000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_207_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
