/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U17) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_208_1 :
    Uω (aρ 1) (bρ 1) (634082945103 / 4000000000000 : ℝ) ≤
      (-(18834775819919365320531 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1520603826457973 / 10000000000000000 : ℝ) ≤
      (-(18834775819919365320531 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1520603826457973 / 10000000000000000 : ℝ) =
            (1520603826457973 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1520603826457973 / 1250000000000000 : ℝ) ≤
            (1959639589080634679469 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (760248754121723 / 5000000000000000 : ℝ)) (q :=
      (1520603826457973 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_208_2 :
    Uω (aρ 2) (bρ 2) (634082945103 / 4000000000000 : ℝ) ≤
      (-(18996351001129505770501 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (598492826548401 / 4000000000000000 : ℝ) ≤
      (-(18996351001129505770501 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (598492826548401 / 4000000000000000 : ℝ) =
            (598492826548401 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (598492826548401 / 500000000000000 : ℝ) ≤
            (1798064407870494229499 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (299104600115901 / 2000000000000000 : ℝ)) (q :=
      (598492826548401 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_208_3 :
    Uω (aρ 3) (bρ 3) (634082945103 / 4000000000000 : ℝ) ≤
      (-(19331004852514832193709 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2893977309141877 / 20000000000000000 : ℝ) ≤
      (-(19331004852514832193709 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2893977309141877 / 20000000000000000 : ℝ) =
            (2893977309141877 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2893977309141877 / 2500000000000000 : ℝ) ≤
            (1463410556485167806291 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1444432283329377 / 10000000000000000 : ℝ)) (q :=
      (2893977309141877 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_208_4 :
    Uω (aρ 4) (bρ 4) (634082945103 / 4000000000000 : ℝ) ≤
      (-(19925043404826570845423 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (681767608758223 / 5000000000000000 : ℝ) ≤
      (-(19925043404826570845423 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (681767608758223 / 5000000000000000 : ℝ) =
            (681767608758223 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (681767608758223 / 625000000000000 : ℝ) ≤
            (869372004173429154577 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (84738724392837 / 625000000000000 : ℝ)) (q :=
      (681767608758223 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_208_5 :
    Uω (aρ 5) (bρ 5) (634082945103 / 4000000000000 : ℝ) ≤
      (-(2618004087800691493427 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (615718525594977 / 5000000000000000 : ℝ) ≤
      (-(2618004087800691493427 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (615718525594977 / 5000000000000000 : ℝ) =
            (615718525594977 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (615718525594977 / 312500000000000 : ℝ) ≤
            (847731813699308506573 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (75613323560463 / 625000000000000 : ℝ)) (q :=
      (615718525594977 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_208_6 :
    Uω (aρ 6) (bρ 6) (634082945103 / 4000000000000 : ℝ) ≤
      (-(22769024589857949647633 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (102601527337529 / 1000000000000000 : ℝ) ≤
      (-(22769024589857949647633 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (102601527337529 / 1000000000000000 : ℝ) =
            (102601527337529 / 62500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (102601527337529 / 62500000000000 : ℝ) ≤
            (4956862622142050352367 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1509703119497 / 15625000000000 : ℝ)) (q :=
      (102601527337529 / 1000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_208_7 :
    Uω (aρ 7) (bρ 7) (634082945103 / 4000000000000 : ℝ) ≤
      (-(27059794013414673404811 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1336097259073869 / 20000000000000000 : ℝ) ≤
      (-(27059794013414673404811 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1336097259073869 / 20000000000000000 : ℝ) =
            (1336097259073869 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1336097259073869 / 1250000000000000 : ℝ) ≤
            (666093198585326595189 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (473938089561369 / 10000000000000000 : ℝ)) (q :=
      (1336097259073869 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_208_8 :
    Uω (aρ 8) (bρ 8) (634082945103 / 4000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_208_9 :
    Uω (aρ 9) (bρ 9) (634082945103 / 4000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_208_10 :
    Uω (aρ 10) (bρ 10) (634082945103 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_208_11 :
    Uω (aρ 11) (bρ 11) (634082945103 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_208_12 :
    Uω (aρ 12) (bρ 12) (634082945103 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_208_13 :
    Uω (aρ 13) (bρ 13) (634082945103 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_208_14 :
    Uω (aρ 14) (bρ 14) (634082945103 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_208_15 :
    Uω (aρ 15) (bρ 15) (634082945103 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_208_16 :
    Uω (aρ 16) (bρ 16) (634082945103 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_208 :
    Uρ (634082945103 / 4000000000000 : ℝ) ≤
      (-(21144826167404248198697 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (634082945103 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18834775819919365320531 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (634082945103 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18996351001129505770501 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (634082945103 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19331004852514832193709 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (634082945103 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19925043404826570845423 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (634082945103 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2618004087800691493427 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (634082945103 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22769024589857949647633 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (634082945103 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(27059794013414673404811 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (634082945103 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (634082945103 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (634082945103 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (634082945103 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (634082945103 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (634082945103 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (634082945103 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (634082945103 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (634082945103 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_208_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_209_1 :
    Uω (aρ 1) (bρ 1) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(9402822015822657623339 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4880128243157723 / 32000000000000000 : ℝ) ≤
      (-(9402822015822657623339 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4880128243157723 / 32000000000000000 : ℝ) =
            (4880128243157723 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4880128243157723 / 4000000000000000 : ℝ) ≤
            (994385688677342376661 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (152493406704553 / 1000000000000000 : ℝ)) (q :=
      (4880128243157723 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_209_2 :
    Uω (aρ 2) (bρ 2) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(18966733481316253290297 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24010721657546831 / 160000000000000000 : ℝ) ≤
      (-(18966733481316253290297 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24010721657546831 / 160000000000000000 : ℝ) =
            (24010721657546831 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24010721657546831 / 20000000000000000 : ℝ) ≤
            (1827681927683746709703 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1499963134775307 / 10000000000000000 : ℝ)) (q :=
      (24010721657546831 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_209_3 :
    Uω (aρ 3) (bρ 3) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(19300341465000340110197 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4644583748866899 / 32000000000000000 : ℝ) ≤
      (-(19300341465000340110197 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4644583748866899 / 32000000000000000 : ℝ) =
            (4644583748866899 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4644583748866899 / 4000000000000000 : ℝ) ≤
            (1494073943999659889803 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (289776775394753 / 2000000000000000 : ℝ)) (q :=
      (4644583748866899 / 32000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_209_4 :
    Uω (aρ 4) (bρ 4) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(3978475927905370941629 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21887941100810039 / 160000000000000000 : ℝ) ≤
      (-(3978475927905370941629 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (21887941100810039 / 160000000000000000 : ℝ) =
            (21887941100810039 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21887941100810039 / 20000000000000000 : ℝ) ≤
            (180407153894629058371 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (21254778946847 / 156250000000000 : ℝ)) (q :=
      (21887941100810039 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_209_5 :
    Uω (aρ 5) (bρ 5) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(5226858955032555311931 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19775231735235271 / 160000000000000000 : ℝ) ≤
      (-(5226858955032555311931 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19775231735235271 / 160000000000000000 : ℝ) =
            (19775231735235271 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19775231735235271 / 10000000000000000 : ℝ) ≤
            (1704612847967444688069 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (607203550618181 / 5000000000000000 : ℝ)) (q :=
      (19775231735235271 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_209_6 :
    Uω (aρ 6) (bρ 6) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(22723231852291062307257 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16491591236337559 / 160000000000000000 : ℝ) ≤
      (-(22723231852291062307257 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (16491591236337559 / 160000000000000000 : ℝ) =
            (16491591236337559 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16491591236337559 / 10000000000000000 : ℝ) ≤
            (5002655359708937692743 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (242798103503537 / 2500000000000000 : ℝ)) (q :=
      (16491591236337559 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_209_7 :
    Uω (aρ 7) (bρ 7) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(26966981408494280424653 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10788445209094639 / 160000000000000000 : ℝ) ≤
      (-(26966981408494280424653 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (10788445209094639 / 160000000000000000 : ℝ) =
            (10788445209094639 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10788445209094639 / 10000000000000000 : ℝ) ≤
            (758905803505719575347 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (481960541368783 / 10000000000000000 : ℝ)) (q :=
      (10788445209094639 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_209_8 :
    Uω (aρ 8) (bρ 8) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_209_9 :
    Uω (aρ 9) (bρ 9) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_209_10 :
    Uω (aρ 10) (bρ 10) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_209_11 :
    Uω (aρ 11) (bρ 11) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_209_12 :
    Uω (aρ 12) (bρ 12) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_209_13 :
    Uω (aρ 13) (bρ 13) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_209_14 :
    Uω (aρ 14) (bρ 14) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_209_15 :
    Uω (aρ 15) (bρ 15) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_209_16 :
    Uω (aρ 16) (bρ 16) (20347434278567 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_209 :
    Uρ (20347434278567 / 128000000000000 : ℝ) ≤
      (-(5281603793154777291613 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20347434278567 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9402822015822657623339 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20347434278567 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18966733481316253290297 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20347434278567 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19300341465000340110197 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20347434278567 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3978475927905370941629 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20347434278567 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5226858955032555311931 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20347434278567 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22723231852291062307257 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20347434278567 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(26966981408494280424653 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20347434278567 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20347434278567 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20347434278567 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20347434278567 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20347434278567 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20347434278567 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20347434278567 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (20347434278567 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20347434278567 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_209_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_210_1 :
    Uω (aρ 1) (bρ 1) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(18776596874758489166257 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (489432423590843 / 3200000000000000 : ℝ) ≤
      (-(18776596874758489166257 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (489432423590843 / 3200000000000000 : ℝ) =
            (489432423590843 / 400000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (489432423590843 / 400000000000000 : ℝ) ≤
            (2017818534241510833743 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (61174824890367 / 400000000000000 : ℝ)) (q :=
      (489432423590843 / 3200000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_210_2 :
    Uω (aρ 2) (bρ 2) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(9468601752239696732103 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2408173005520151 / 16000000000000000 : ℝ) ≤
      (-(9468601752239696732103 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2408173005520151 / 16000000000000000 : ℝ) =
            (2408173005520151 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2408173005520151 / 2000000000000000 : ℝ) ≤
            (928605952260303267897 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (300880648845319 / 2000000000000000 : ℝ)) (q :=
      (2408173005520151 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_210_3 :
    Uω (aρ 3) (bρ 3) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(19269772143215850917411 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11647009124868387 / 80000000000000000 : ℝ) ≤
      (-(19269772143215850917411 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11647009124868387 / 80000000000000000 : ℝ) =
            (11647009124868387 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11647009124868387 / 10000000000000000 : ℝ) ≤
            (1524643265784149082589 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1453335374893503 / 10000000000000000 : ℝ)) (q :=
      (11647009124868387 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_210_4 :
    Uω (aρ 4) (bρ 4) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(124123896360046046919 / 62500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (439186321791003 / 3200000000000000 : ℝ) ≤
      (-(124123896360046046919 / 62500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (439186321791003 / 3200000000000000 : ℝ) =
            (439186321791003 / 400000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (439186321791003 / 400000000000000 : ℝ) ≤
            (5841199946203953081 / 62500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (54591671437407 / 400000000000000 : ℝ)) (q :=
      (439186321791003 / 3200000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_210_5 :
    Uω (aρ 5) (bρ 5) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(20870977099919409056433 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1984746128917551 / 16000000000000000 : ℝ) ≤
      (-(20870977099919409056433 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1984746128917551 / 16000000000000000 : ℝ) =
            (1984746128917551 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1984746128917551 / 1000000000000000 : ℝ) ≤
            (6854910112080590943567 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (243799971044669 / 2000000000000000 : ℝ)) (q :=
      (1984746128917551 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_210_6 :
    Uω (aρ 6) (bρ 6) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(11338836658656259650589 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8283447959127683 / 80000000000000000 : ℝ) ≤
      (-(11338836658656259650589 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8283447959127683 / 80000000000000000 : ℝ) =
            (8283447959127683 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8283447959127683 / 5000000000000000 : ℝ) ≤
            (2524106947343740349411 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (976169558998327 / 10000000000000000 : ℝ)) (q :=
      (8283447959127683 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_210_7 :
    Uω (aρ 7) (bρ 7) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(13437846207618377346453 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5443691373805147 / 80000000000000000 : ℝ) ≤
      (-(13437846207618377346453 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (5443691373805147 / 80000000000000000 : ℝ) =
            (5443691373805147 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5443691373805147 / 5000000000000000 : ℝ) ≤
            (425097398381622653547 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (489891793427693 / 10000000000000000 : ℝ)) (q :=
      (5443691373805147 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_210_8 :
    Uω (aρ 8) (bρ 8) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_210_9 :
    Uω (aρ 9) (bρ 9) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_210_10 :
    Uω (aρ 10) (bρ 10) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_210_11 :
    Uω (aρ 11) (bρ 11) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_210_12 :
    Uω (aρ 12) (bρ 12) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_210_13 :
    Uω (aρ 13) (bρ 13) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_210_14 :
    Uω (aρ 14) (bρ 14) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_210_15 :
    Uω (aρ 15) (bρ 15) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_210_16 :
    Uω (aρ 16) (bρ 16) (10202107156919 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_210 :
    Uρ (10202107156919 / 64000000000000 : ℝ) ≤
      (-(5277043811099700677133 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10202107156919 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18776596874758489166257 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10202107156919 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9468601752239696732103 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10202107156919 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19269772143215850917411 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10202107156919 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(124123896360046046919 / 62500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10202107156919 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20870977099919409056433 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10202107156919 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11338836658656259650589 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10202107156919 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(13437846207618377346453 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10202107156919 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10202107156919 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10202107156919 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10202107156919 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10202107156919 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10202107156919 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10202107156919 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10202107156919 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10202107156919 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_210_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_211_1 :
    Uω (aρ 1) (bρ 1) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(9373816929443217670237 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24542601114837277 / 160000000000000000 : ℝ) ≤
      (-(9373816929443217670237 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24542601114837277 / 160000000000000000 : ℝ) =
            (24542601114837277 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24542601114837277 / 20000000000000000 : ℝ) ≤
            (1023390775056782329763 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1533807173915519 / 10000000000000000 : ℝ)) (q :=
      (24542601114837277 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_211_2 :
    Uω (aρ 2) (bρ 2) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(1890776055414610494797 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24152738256647677 / 160000000000000000 : ℝ) ≤
      (-(1890776055414610494797 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24152738256647677 / 160000000000000000 : ℝ) =
            (24152738256647677 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24152738256647677 / 20000000000000000 : ℝ) ≤
            (188665485485389505203 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1508843329151819 / 10000000000000000 : ℝ)) (q :=
      (24152738256647677 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_211_3 :
    Uω (aρ 3) (bρ 3) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(19239296309802124964013 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23365116996357173 / 160000000000000000 : ℝ) ≤
      (-(19239296309802124964013 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23365116996357173 / 160000000000000000 : ℝ) =
            (23365116996357173 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23365116996357173 / 20000000000000000 : ℝ) ≤
            (1555119099197875035987 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (728893388982753 / 5000000000000000 : ℝ)) (q :=
      (23365116996357173 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_211_4 :
    Uω (aρ 4) (bρ 4) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(4956843506365323570481 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (881227538893997 / 6400000000000000 : ℝ) ≤
      (-(4956843506365323570481 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (881227538893997 / 6400000000000000 : ℝ) =
            (881227538893997 / 800000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (881227538893997 / 800000000000000 : ℝ) ≤
            (241760345884676429519 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (213949592739 / 1562500000000 : ℝ)) (q :=
      (881227538893997 / 6400000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_211_5 :
    Uω (aρ 5) (bρ 5) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(10417327733948295803493 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19919681586283741 / 160000000000000000 : ℝ) ≤
      (-(10417327733948295803493 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19919681586283741 / 160000000000000000 : ℝ) =
            (19919681586283741 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19919681586283741 / 10000000000000000 : ℝ) ≤
            (3445615872051704196507 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1223591452106327 / 10000000000000000 : ℝ)) (q :=
      (19919681586283741 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_211_6 :
    Uω (aρ 6) (bρ 6) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(5658086589788000643379 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3328431812335569 / 32000000000000000 : ℝ) ≤
      (-(5658086589788000643379 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3328431812335569 / 32000000000000000 : ℝ) =
            (3328431812335569 / 2000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3328431812335569 / 2000000000000000 : ℝ) ≤
            (1273385213211999356621 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (98114151167059 / 1000000000000000 : ℝ)) (q :=
      (3328431812335569 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_211_7 :
    Uω (aρ 7) (bρ 7) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(6696465406727953716517 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10985625565955669 / 160000000000000000 : ℝ) ≤
      (-(6696465406727953716517 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (10985625565955669 / 160000000000000000 : ℝ) =
            (10985625565955669 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10985625565955669 / 10000000000000000 : ℝ) ≤
            (235006396272046283483 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (248868102732659 / 5000000000000000 : ℝ)) (q :=
      (10985625565955669 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_211_8 :
    Uω (aρ 8) (bρ 8) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_211_9 :
    Uω (aρ 9) (bρ 9) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_211_10 :
    Uω (aρ 10) (bρ 10) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_211_11 :
    Uω (aρ 11) (bρ 11) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_211_12 :
    Uω (aρ 12) (bρ 12) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_211_13 :
    Uω (aρ 13) (bρ 13) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_211_14 :
    Uω (aρ 14) (bρ 14) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_211_15 :
    Uω (aρ 15) (bρ 15) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_211_16 :
    Uω (aρ 16) (bρ 16) (20460994349109 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_211 :
    Uρ (20460994349109 / 128000000000000 : ℝ) ≤
      (-(4218020092928001477611 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20460994349109 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9373816929443217670237 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20460994349109 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1890776055414610494797 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20460994349109 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19239296309802124964013 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20460994349109 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4956843506365323570481 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20460994349109 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10417327733948295803493 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20460994349109 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5658086589788000643379 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20460994349109 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6696465406727953716517 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20460994349109 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20460994349109 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20460994349109 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20460994349109 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20460994349109 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20460994349109 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20460994349109 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (20460994349109 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20460994349109 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_211_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_212_1 :
    Uω (aρ 1) (bρ 1) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(9359377248953476493289 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6153395255480061 / 40000000000000000 : ℝ) ≤
      (-(9359377248953476493289 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6153395255480061 / 40000000000000000 : ℝ) =
            (6153395255480061 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6153395255480061 / 5000000000000000 : ℝ) ≤
            (1037830455546523506711 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1538243722045343 / 10000000000000000 : ℝ)) (q :=
      (6153395255480061 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_212_2 :
    Uω (aρ 2) (bρ 2) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(943920205920242897763 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6055936565903101 / 40000000000000000 : ℝ) ≤
      (-(943920205920242897763 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6055936565903101 / 40000000000000000 : ℝ) =
            (6055936565903101 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6055936565903101 / 5000000000000000 : ℝ) ≤
            (95800564529757102237 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1513283389766863 / 10000000000000000 : ℝ)) (q :=
      (6055936565903101 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_212_3 :
    Uω (aρ 3) (bρ 3) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(19208913392717338753281 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5859053747781357 / 40000000000000000 : ℝ) ≤
      (-(19208913392717338753281 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5859053747781357 / 40000000000000000 : ℝ) =
            (5859053747781357 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5859053747781357 / 5000000000000000 : ℝ) ≤
            (1585502016282661246719 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1462238087055991 / 10000000000000000 : ℝ)) (q :=
      (5859053747781357 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_212_4 :
    Uω (aρ 4) (bρ 4) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(791801230265439478831 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5525514568684023 / 40000000000000000 : ℝ) ≤
      (-(791801230265439478831 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5525514568684023 / 40000000000000000 : ℝ) =
            (5525514568684023 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5525514568684023 / 5000000000000000 : ℝ) ≤
            (39975386094560521169 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (343440669643081 / 2500000000000000 : ℝ)) (q :=
      (5525514568684023 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_212_5 :
    Uω (aρ 5) (bρ 5) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(20798469863029981377397 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4997973182595211 / 40000000000000000 : ℝ) ≤
      (-(20798469863029981377397 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4997973182595211 / 40000000000000000 : ℝ) =
            (4997973182595211 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4997973182595211 / 2500000000000000 : ℝ) ≤
            (6927417348970018622603 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (614090952431459 / 5000000000000000 : ℝ)) (q :=
      (4997973182595211 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_212_6 :
    Uω (aρ 6) (bρ 6) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(2823406049901683619027 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4179345323728897 / 40000000000000000 : ℝ) ≤
      (-(2823406049901683619027 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4179345323728897 / 40000000000000000 : ℝ) =
            (4179345323728897 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4179345323728897 / 2500000000000000 : ℝ) ≤
            (642329851598316380973 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (986108350569761 / 10000000000000000 : ℝ)) (q :=
      (4179345323728897 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_212_7 :
    Uω (aρ 7) (bρ 7) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(26697428239469773735417 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2770801501665571 / 40000000000000000 : ℝ) ≤
      (-(26697428239469773735417 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2770801501665571 / 40000000000000000 : ℝ) =
            (2770801501665571 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2770801501665571 / 2500000000000000 : ℝ) ≤
            (1028458972530226264583 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (252748910149049 / 5000000000000000 : ℝ)) (q :=
      (2770801501665571 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_212_8 :
    Uω (aρ 8) (bρ 8) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_212_9 :
    Uω (aρ 9) (bρ 9) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_212_10 :
    Uω (aρ 10) (bρ 10) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_212_11 :
    Uω (aρ 11) (bρ 11) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_212_12 :
    Uω (aρ 12) (bρ 12) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_212_13 :
    Uω (aρ 13) (bρ 13) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_212_14 :
    Uω (aρ 14) (bρ 14) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_212_15 :
    Uω (aρ 15) (bρ 15) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_212_16 :
    Uω (aρ 16) (bρ 16) (1025888719219 / 6400000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_212 :
    Uρ (1025888719219 / 6400000000000 : ℝ) ≤
      (-(5268046327809099390991 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1025888719219 / 6400000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9359377248953476493289 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1025888719219 / 6400000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(943920205920242897763 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1025888719219 / 6400000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19208913392717338753281 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1025888719219 / 6400000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(791801230265439478831 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1025888719219 / 6400000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20798469863029981377397 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1025888719219 / 6400000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2823406049901683619027 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1025888719219 / 6400000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(26697428239469773735417 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1025888719219 / 6400000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1025888719219 / 6400000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1025888719219 / 6400000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1025888719219 / 6400000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1025888719219 / 6400000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1025888719219 / 6400000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1025888719219 / 6400000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1025888719219 / 6400000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1025888719219 / 6400000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_212_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_213_1 :
    Uω (aρ 1) (bρ 1) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(18689958309899125630867 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24684560901034443 / 160000000000000000 : ℝ) ≤
      (-(18689958309899125630867 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24684560901034443 / 160000000000000000 : ℝ) =
            (24684560901034443 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24684560901034443 / 20000000000000000 : ℝ) ≤
            (2104457099100874369133 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1542680266679071 / 10000000000000000 : ℝ)) (q :=
      (24684560901034443 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_213_2 :
    Uω (aρ 2) (bρ 2) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(294517713903934530317 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24294754077802539 / 160000000000000000 : ℝ) ≤
      (-(294517713903934530317 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24294754077802539 / 160000000000000000 : ℝ) =
            (24294754077802539 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24294754077802539 / 20000000000000000 : ℝ) ≤
            (30395026861690469683 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1517723426285083 / 10000000000000000 : ℝ)) (q :=
      (24294754077802539 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_213_3 :
    Uω (aρ 3) (bρ 3) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(19178622825171756382173 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23507312240887027 / 160000000000000000 : ℝ) ≤
      (-(19178622825171756382173 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23507312240887027 / 160000000000000000 : ℝ) =
            (23507312240887027 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23507312240887027 / 20000000000000000 : ℝ) ≤
            (1615792583828243617827 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (366672325755161 / 2500000000000000 : ℝ)) (q :=
      (23507312240887027 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_213_4 :
    Uω (aρ 4) (bρ 4) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(988139645586834072963 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (886937020876051 / 6400000000000000 : ℝ) ≤
      (-(988139645586834072963 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (886937020876051 / 6400000000000000 : ℝ) =
            (886937020876051 / 800000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (886937020876051 / 800000000000000 : ℝ) ≤
            (51581124863165927037 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (55129905768497 / 400000000000000 : ℝ)) (q :=
      (886937020876051 / 6400000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_213_5 :
    Uω (aρ 5) (bρ 5) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(5190604809880666183443 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4012818964743127 / 32000000000000000 : ℝ) ≤
      (-(5190604809880666183443 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4012818964743127 / 32000000000000000 : ℝ) =
            (4012818964743127 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4012818964743127 / 4000000000000000 : ℝ) ≤
            (7999042369333816557 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (61638561313711 / 500000000000000 : ℝ)) (q :=
      (4012818964743127 / 32000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_213_6 :
    Uω (aρ 6) (bρ 6) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(11271188452447671165599 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16792563233044027 / 160000000000000000 : ℝ) ≤
      (-(11271188452447671165599 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (16792563233044027 / 160000000000000000 : ℝ) =
            (16792563233044027 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16792563233044027 / 10000000000000000 : ℝ) ≤
            (2591755153552328834401 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (991070152580269 / 10000000000000000 : ℝ)) (q :=
      (16792563233044027 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_213_7 :
    Uω (aρ 7) (bρ 7) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(2661033560846422827913 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2236030824860287 / 32000000000000000 : ℝ) ≤
      (-(2661033560846422827913 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2236030824860287 / 32000000000000000 : ℝ) =
            (2236030824860287 / 2000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2236030824860287 / 2000000000000000 : ℝ) ≤
            (111555160353577172087 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (102636078949489 / 2000000000000000 : ℝ)) (q :=
      (2236030824860287 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_213_8 :
    Uω (aρ 8) (bρ 8) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_213_9 :
    Uω (aρ 9) (bρ 9) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_213_10 :
    Uω (aρ 10) (bρ 10) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_213_11 :
    Uω (aρ 11) (bρ 11) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_213_12 :
    Uω (aρ 12) (bρ 12) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_213_13 :
    Uω (aρ 13) (bρ 13) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_213_14 :
    Uω (aρ 14) (bρ 14) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_213_15 :
    Uω (aρ 15) (bρ 15) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_213_16 :
    Uω (aρ 16) (bρ 16) (20574554419651 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_213 :
    Uρ (20574554419651 / 128000000000000 : ℝ) ≤
      (-(21054424620542273751667 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20574554419651 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18689958309899125630867 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20574554419651 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(294517713903934530317 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20574554419651 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19178622825171756382173 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20574554419651 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(988139645586834072963 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20574554419651 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5190604809880666183443 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20574554419651 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11271188452447671165599 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20574554419651 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2661033560846422827913 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20574554419651 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20574554419651 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20574554419651 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20574554419651 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20574554419651 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20574554419651 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20574554419651 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (20574554419651 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20574554419651 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_213_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_214_1 :
    Uω (aρ 1) (bρ 1) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(18661244817095025294763 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2475554075242049 / 16000000000000000 : ℝ) ≤
      (-(18661244817095025294763 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2475554075242049 / 16000000000000000 : ℝ) =
            (2475554075242049 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2475554075242049 / 2000000000000000 : ℝ) ≤
            (2133170591904974705237 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (77355840392339 / 500000000000000 : ℝ)) (q :=
      (2475554075242049 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_214_2 :
    Uω (aρ 2) (bρ 2) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(4704987191384496238617 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2436576170090501 / 16000000000000000 : ℝ) ≤
      (-(4704987191384496238617 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2436576170090501 / 16000000000000000 : ℝ) =
            (2436576170090501 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2436576170090501 / 2000000000000000 : ℝ) ≤
            (493616660865503761383 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (304432687783469 / 2000000000000000 : ℝ)) (q :=
      (2436576170090501 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_214_3 :
    Uω (aρ 3) (bρ 3) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(19148424045563445068967 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11789204376202213 / 80000000000000000 : ℝ) ≤
      (-(19148424045563445068967 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11789204376202213 / 80000000000000000 : ℝ) =
            (11789204376202213 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11789204376202213 / 10000000000000000 : ℝ) ≤
            (1645991363436554931033 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (367785106676193 / 2500000000000000 : ℝ)) (q :=
      (11789204376202213 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_214_4 :
    Uω (aρ 4) (bρ 4) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(1973065979833186243353 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11122395119354733 / 80000000000000000 : ℝ) ≤
      (-(1973065979833186243353 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11122395119354733 / 80000000000000000 : ℝ) =
            (11122395119354733 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11122395119354733 / 10000000000000000 : ℝ) ≤
            (106375561066813756647 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (691366146778951 / 5000000000000000 : ℝ)) (q :=
      (11122395119354733 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_214_5 :
    Uω (aρ 5) (bρ 5) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(10363251278104916277097 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10068143983497481 / 80000000000000000 : ℝ) ≤
      (-(10363251278104916277097 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10068143983497481 / 80000000000000000 : ℝ) =
            (10068143983497481 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10068143983497481 / 10000000000000000 : ℝ) ≤
            (33956426395083722903 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1237359428928589 / 10000000000000000 : ℝ)) (q :=
      (10068143983497481 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_214_6 :
    Uω (aρ 6) (bρ 6) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(703054043389017050231 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8433852739132409 / 80000000000000000 : ℝ) ≤
      (-(703054043389017050231 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8433852739132409 / 80000000000000000 : ℝ) =
            (8433852739132409 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8433852739132409 / 5000000000000000 : ℝ) ≤
            (163379931985982949769 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (996026992977321 / 10000000000000000 : ℝ)) (q :=
      (8433852739132409 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_214_7 :
    Uω (aρ 7) (bρ 7) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(13262265429716689337577 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5638248951379653 / 80000000000000000 : ℝ) ≤
      (-(13262265429716689337577 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (5638248951379653 / 80000000000000000 : ℝ) =
            (5638248951379653 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5638248951379653 / 5000000000000000 : ℝ) ≤
            (600678176283310662423 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (130196856699783 / 2500000000000000 : ℝ)) (q :=
      (5638248951379653 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_214_8 :
    Uω (aρ 8) (bρ 8) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_214_9 :
    Uω (aρ 9) (bρ 9) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_214_10 :
    Uω (aρ 10) (bρ 10) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_214_11 :
    Uω (aρ 11) (bρ 11) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_214_12 :
    Uω (aρ 12) (bρ 12) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_214_13 :
    Uω (aρ 13) (bρ 13) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_214_14 :
    Uω (aρ 14) (bρ 14) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_214_15 :
    Uω (aρ 15) (bρ 15) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_214_16 :
    Uω (aρ 16) (bρ 16) (10315667227461 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_214 :
    Uρ (10315667227461 / 64000000000000 : ℝ) ≤
      (-(21036813553478639506113 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10315667227461 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18661244817095025294763 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10315667227461 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4704987191384496238617 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10315667227461 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19148424045563445068967 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10315667227461 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1973065979833186243353 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10315667227461 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10363251278104916277097 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10315667227461 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(703054043389017050231 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10315667227461 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(13262265429716689337577 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10315667227461 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10315667227461 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10315667227461 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10315667227461 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10315667227461 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10315667227461 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10315667227461 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10315667227461 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10315667227461 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_214_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_215_1 :
    Uω (aρ 1) (bρ 1) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(18632613545832130859089 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24826520576316249 / 160000000000000000 : ℝ) ≤
      (-(18632613545832130859089 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24826520576316249 / 160000000000000000 : ℝ) =
            (24826520576316249 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24826520576316249 / 20000000000000000 : ℝ) ≤
            (2161801863167869140911 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1551553345578203 / 10000000000000000 : ℝ)) (q :=
      (24826520576316249 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_215_2 :
    Uω (aρ 2) (bρ 2) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(18790848846917232790029 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4887353826917421 / 32000000000000000 : ℝ) ≤
      (-(18790848846917232790029 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4887353826917421 / 32000000000000000 : ℝ) =
            (4887353826917421 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4887353826917421 / 4000000000000000 : ℝ) ≤
            (2003566562082767209971 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (76330171393603 / 500000000000000 : ℝ)) (q :=
      (4887353826917421 / 32000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_215_3 :
    Uω (aρ 3) (bρ 3) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(19118316497414914090889 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4729900906471677 / 32000000000000000 : ℝ) ≤
      (-(19118316497414914090889 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4729900906471677 / 32000000000000000 : ℝ) =
            (4729900906471677 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4729900906471677 / 4000000000000000 : ℝ) ≤
            (1676098911585085909111 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (147559145894347 / 1000000000000000 : ℝ)) (q :=
      (4729900906471677 / 32000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_215_4 :
    Uω (aρ 4) (bρ 4) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(19698630730860232821229 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22316152449701369 / 160000000000000000 : ℝ) ≤
      (-(19698630730860232821229 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (22316152449701369 / 160000000000000000 : ℝ) =
            (22316152449701369 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22316152449701369 / 20000000000000000 : ℝ) ≤
            (1095784678139767178771 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1387216629676343 / 10000000000000000 : ℝ)) (q :=
      (22316152449701369 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_215_5 :
    Uω (aρ 5) (bρ 5) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(20690718791954763536791 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20208472259413113 / 160000000000000000 : ℝ) ≤
      (-(20690718791954763536791 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (20208472259413113 / 160000000000000000 : ℝ) =
            (20208472259413113 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20208472259413113 / 20000000000000000 : ℝ) ≤
            (103696617045236463209 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1241946525225311 / 10000000000000000 : ℝ)) (q :=
      (20208472259413113 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_215_6 :
    Uω (aρ 6) (bρ 6) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(22453303405870982867681 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16942808620254937 / 160000000000000000 : ℝ) ≤
      (-(22453303405870982867681 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (16942808620254937 / 160000000000000000 : ℝ) =
            (16942808620254937 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16942808620254937 / 10000000000000000 : ℝ) ≤
            (5272583806129017132319 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1000978945470539 / 10000000000000000 : ℝ)) (q :=
      (16942808620254937 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_215_7 :
    Uω (aρ 7) (bρ 7) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(6609991136014297365741 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11372263446798641 / 160000000000000000 : ℝ) ≤
      (-(6609991136014297365741 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (11372263446798641 / 160000000000000000 : ℝ) =
            (11372263446798641 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11372263446798641 / 10000000000000000 : ℝ) ≤
            (321480666985702634259 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (264161089774251 / 5000000000000000 : ℝ)) (q :=
      (11372263446798641 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_215_8 :
    Uω (aρ 8) (bρ 8) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_215_9 :
    Uω (aρ 9) (bρ 9) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_215_10 :
    Uω (aρ 10) (bρ 10) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_215_11 :
    Uω (aρ 11) (bρ 11) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_215_12 :
    Uω (aρ 12) (bρ 12) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_215_13 :
    Uω (aρ 13) (bρ 13) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_215_14 :
    Uω (aρ 14) (bρ 14) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_215_15 :
    Uω (aρ 15) (bρ 15) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_215_16 :
    Uω (aρ 16) (bρ 16) (20688114490193 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_215 :
    Uρ (20688114490193 / 128000000000000 : ℝ) ≤
      (-(21019347567321569209947 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20688114490193 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18632613545832130859089 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20688114490193 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18790848846917232790029 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20688114490193 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19118316497414914090889 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20688114490193 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19698630730860232821229 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20688114490193 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20690718791954763536791 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20688114490193 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22453303405870982867681 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20688114490193 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6609991136014297365741 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20688114490193 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20688114490193 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20688114490193 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20688114490193 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20688114490193 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20688114490193 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20688114490193 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (20688114490193 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20688114490193 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_215_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_216_1 :
    Uω (aρ 1) (bρ 1) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(744162561060257032513 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3112187546619607 / 20000000000000000 : ℝ) ≤
      (-(744162561060257032513 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3112187546619607 / 20000000000000000 : ℝ) =
            (3112187546619607 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3112187546619607 / 2500000000000000 : ℝ) ≤
            (87614055299742967487 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (388997469975683 / 2500000000000000 : ℝ)) (q :=
      (3112187546619607 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_216_2 :
    Uω (aρ 2) (bρ 2) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(18761833439794934696371 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3063472047562097 / 20000000000000000 : ℝ) ≤
      (-(18761833439794934696371 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3063472047562097 / 20000000000000000 : ℝ) =
            (3063472047562097 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3063472047562097 / 2500000000000000 : ℝ) ≤
            (2032581969205065303629 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (765521696677611 / 5000000000000000 : ℝ)) (q :=
      (3063472047562097 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_216_3 :
    Uω (aρ 3) (bρ 3) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(19088299629310782092179 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1482537474209321 / 10000000000000000 : ℝ) ≤
      (-(19088299629310782092179 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1482537474209321 / 10000000000000000 : ℝ) =
            (1482537474209321 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1482537474209321 / 1250000000000000 : ℝ) ≤
            (1706115779689217907821 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1480042400561767 / 10000000000000000 : ℝ)) (q :=
      (1482537474209321 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_216_4 :
    Uω (aρ 4) (bρ 4) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(393334100610784337877 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2798439022387463 / 20000000000000000 : ℝ) ≤
      (-(393334100610784337877 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2798439022387463 / 20000000000000000 : ℝ) =
            (2798439022387463 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2798439022387463 / 2500000000000000 : ℝ) ≤
            (22554207569215662123 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (347925163898897 / 2500000000000000 : ℝ)) (q :=
      (2798439022387463 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_216_5 :
    Uω (aρ 5) (bρ 5) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(20655066935054398764263 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (633770243708767 / 5000000000000000 : ℝ) ≤
      (-(20655066935054398764263 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (633770243708767 / 5000000000000000 : ℝ) =
            (633770243708767 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (633770243708767 / 625000000000000 : ℝ) ≤
            (139348473945601235737 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1246532527378193 / 10000000000000000 : ℝ)) (q :=
      (633770243708767 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_216_6 :
    Uω (aρ 6) (bρ 6) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(22409096555836940562381 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1063617077281511 / 10000000000000000 : ℝ) ≤
      (-(22409096555836940562381 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1063617077281511 / 10000000000000000 : ℝ) =
            (1063617077281511 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1063617077281511 / 625000000000000 : ℝ) ≤
            (5316790656163059437619 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1005926082246147 / 10000000000000000 : ℝ)) (q :=
      (1063617077281511 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_216_7 :
    Uω (aρ 7) (bρ 7) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(3294573791959917824413 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1433434393940571 / 20000000000000000 : ℝ) ≤
      (-(3294573791959917824413 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1433434393940571 / 20000000000000000 : ℝ) =
            (1433434393940571 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1433434393940571 / 1250000000000000 : ℝ) ≤
            (171162109540082175587 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33486731398981 / 625000000000000 : ℝ)) (q :=
      (1433434393940571 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_216_8 :
    Uω (aρ 8) (bρ 8) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_216_9 :
    Uω (aρ 9) (bρ 9) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_216_10 :
    Uω (aρ 10) (bρ 10) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_216_11 :
    Uω (aρ 11) (bρ 11) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_216_12 :
    Uω (aρ 12) (bρ 12) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_216_13 :
    Uω (aρ 13) (bρ 13) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_216_14 :
    Uω (aρ 14) (bρ 14) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_216_15 :
    Uω (aρ 15) (bρ 15) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_216_16 :
    Uω (aρ 16) (bρ 16) (2593111815683 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_216 :
    Uρ (2593111815683 / 16000000000000 : ℝ) ≤
      (-(10501011194519760065581 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2593111815683 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(744162561060257032513 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2593111815683 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18761833439794934696371 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2593111815683 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19088299629310782092179 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2593111815683 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(393334100610784337877 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2593111815683 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20655066935054398764263 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2593111815683 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22409096555836940562381 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2593111815683 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3294573791959917824413 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2593111815683 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2593111815683 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2593111815683 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2593111815683 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2593111815683 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2593111815683 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2593111815683 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2593111815683 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2593111815683 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_216_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_217_1 :
    Uω (aρ 1) (bρ 1) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(18575595793526144554733 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24968480142574791 / 160000000000000000 : ℝ) ≤
      (-(18575595793526144554733 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24968480142574791 / 160000000000000000 : ℝ) =
            (24968480142574791 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24968480142574791 / 20000000000000000 : ℝ) ≤
            (2218819615473855445267 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1560426410849427 / 10000000000000000 : ℝ)) (q :=
      (24968480142574791 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_217_2 :
    Uω (aρ 2) (bρ 2) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(9366451027138736003651 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4915756688052579 / 32000000000000000 : ℝ) ≤
      (-(9366451027138736003651 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4915756688052579 / 32000000000000000 : ℝ) =
            (4915756688052579 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4915756688052579 / 4000000000000000 : ℝ) ≤
            (1030756677361263996349 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (38387083389261 / 250000000000000 : ℝ)) (q :=
      (4915756688052579 / 32000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_217_3 :
    Uω (aρ 3) (bρ 3) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(19058372894836346185957 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23791693923897639 / 160000000000000000 : ℝ) ≤
      (-(19058372894836346185957 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23791693923897639 / 160000000000000000 : ℝ) =
            (23791693923897639 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23791693923897639 / 20000000000000000 : ℝ) ≤
            (1736042514163653814043 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1484493252374783 / 10000000000000000 : ℝ)) (q :=
      (23791693923897639 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_217_4 :
    Uω (aρ 4) (bρ 4) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(490872050631875603417 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22458869450814343 / 160000000000000000 : ℝ) ≤
      (-(490872050631875603417 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (22458869450814343 / 160000000000000000 : ℝ) =
            (22458869450814343 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22458869450814343 / 20000000000000000 : ℝ) ≤
            (28988334593124396583 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1396184374304371 / 10000000000000000 : ℝ)) (q :=
      (22458869450814343 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_217_5 :
    Uω (aρ 5) (bρ 5) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(20619545985646205896543 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4070562936210387 / 32000000000000000 : ℝ) ≤
      (-(20619545985646205896543 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4070562936210387 / 32000000000000000 : ℝ) =
            (4070562936210387 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4070562936210387 / 4000000000000000 : ℝ) ≤
            (174869423353794103457 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (125111744741907 / 1000000000000000 : ℝ)) (q :=
      (4070562936210387 / 32000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_217_6 :
    Uω (aρ 6) (bρ 6) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(22365106478660146974889 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17092899892641359 / 160000000000000000 : ℝ) ≤
      (-(22365106478660146974889 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (17092899892641359 / 160000000000000000 : ℝ) =
            (17092899892641359 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17092899892641359 / 10000000000000000 : ℝ) ≤
            (5360780733339853025111 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (252717118501937 / 2500000000000000 : ℝ)) (q :=
      (17092899892641359 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_217_7 :
    Uω (aρ 7) (bρ 7) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(26274364758818529627057 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11562155852785783 / 160000000000000000 : ℝ) ≤
      (-(26274364758818529627057 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (11562155852785783 / 160000000000000000 : ℝ) =
            (11562155852785783 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11562155852785783 / 10000000000000000 : ℝ) ≤
            (1451522453181470372943 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (543186849785801 / 10000000000000000 : ℝ)) (q :=
      (11562155852785783 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_217_8 :
    Uω (aρ 8) (bρ 8) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_217_9 :
    Uω (aρ 9) (bρ 9) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_217_10 :
    Uω (aρ 10) (bρ 10) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_217_11 :
    Uω (aρ 11) (bρ 11) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_217_12 :
    Uω (aρ 12) (bρ 12) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_217_13 :
    Uω (aρ 13) (bρ 13) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_217_14 :
    Uω (aρ 14) (bρ 14) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_217_15 :
    Uω (aρ 15) (bρ 15) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_217_16 :
    Uω (aρ 16) (bρ 16) (4160334912147 / 25600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_217 :
    Uρ (4160334912147 / 25600000000000 : ℝ) ≤
      (-(4196966798483047930983 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4160334912147 / 25600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18575595793526144554733 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4160334912147 / 25600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9366451027138736003651 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4160334912147 / 25600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19058372894836346185957 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4160334912147 / 25600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(490872050631875603417 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4160334912147 / 25600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20619545985646205896543 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4160334912147 / 25600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22365106478660146974889 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4160334912147 / 25600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(26274364758818529627057 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4160334912147 / 25600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4160334912147 / 25600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4160334912147 / 25600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4160334912147 / 25600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4160334912147 / 25600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4160334912147 / 25600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4160334912147 / 25600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4160334912147 / 25600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4160334912147 / 25600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_217_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_218_1 :
    Uω (aρ 1) (bρ 1) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(18547208385266200982007 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12519729942699943 / 80000000000000000 : ℝ) ≤
      (-(18547208385266200982007 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12519729942699943 / 80000000000000000 : ℝ) =
            (12519729942699943 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12519729942699943 / 10000000000000000 : ℝ) ≤
            (2247207023733799017993 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1564862938447017 / 10000000000000000 : ℝ)) (q :=
      (12519729942699943 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_218_2 :
    Uω (aρ 2) (bρ 2) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(3740810840944483037073 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12324895157747767 / 80000000000000000 : ℝ) ≤
      (-(3740810840944483037073 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12324895157747767 / 80000000000000000 : ℝ) =
            (12324895157747767 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12324895157747767 / 10000000000000000 : ℝ) ≤
            (418072240855516962927 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1539923254718973 / 10000000000000000 : ℝ)) (q :=
      (12324895157747767 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_218_3 :
    Uω (aρ 3) (bρ 3) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(19028535752517117294929 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11931393774223367 / 80000000000000000 : ℝ) ≤
      (-(19028535752517117294929 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11931393774223367 / 80000000000000000 : ℝ) =
            (11931393774223367 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11931393774223367 / 10000000000000000 : ℝ) ≤
            (1765879656482882705071 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1488944015187873 / 10000000000000000 : ℝ)) (q :=
      (11931393774223367 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_218_4 :
    Uω (aρ 4) (bρ 4) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(19603161049574197177753 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11265112144223691 / 80000000000000000 : ℝ) ≤
      (-(19603161049574197177753 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11265112144223691 / 80000000000000000 : ℝ) =
            (11265112144223691 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11265112144223691 / 10000000000000000 : ℝ) ≤
            (1191254359425802822247 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (700333894376477 / 5000000000000000 : ℝ)) (q :=
      (11265112144223691 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_218_5 :
    Uω (aρ 5) (bρ 5) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(4116830991103902289863 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10212486500676799 / 80000000000000000 : ℝ) ≤
      (-(4116830991103902289863 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10212486500676799 / 80000000000000000 : ℝ) =
            (10212486500676799 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10212486500676799 / 10000000000000000 : ℝ) ≤
            (42052090696097710137 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1255701297201231 / 10000000000000000 : ℝ)) (q :=
      (10212486500676799 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_218_6 :
    Uω (aρ 6) (bρ 6) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(2790166356911144784423 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8583944571374899 / 80000000000000000 : ℝ) ≤
      (-(2790166356911144784423 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8583944571374899 / 80000000000000000 : ℝ) =
            (8583944571374899 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8583944571374899 / 5000000000000000 : ℝ) ≤
            (675569544588855215577 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (253951547503939 / 2500000000000000 : ℝ)) (q :=
      (8583944571374899 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_218_7 :
    Uω (aρ 7) (bρ 7) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(2619324694814019901359 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5828163480531791 / 80000000000000000 : ℝ) ≤
      (-(2619324694814019901359 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (5828163480531791 / 80000000000000000 : ℝ) =
            (5828163480531791 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5828163480531791 / 5000000000000000 : ℝ) ≤
            (153264026385980098641 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (550522298064979 / 10000000000000000 : ℝ)) (q :=
      (5828163480531791 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_218_8 :
    Uω (aρ 8) (bρ 8) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_218_9 :
    Uω (aρ 9) (bρ 9) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_218_10 :
    Uω (aρ 10) (bρ 10) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_218_11 :
    Uω (aρ 11) (bρ 11) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_218_12 :
    Uω (aρ 12) (bρ 12) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_218_13 :
    Uω (aρ 13) (bρ 13) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_218_14 :
    Uω (aρ 14) (bρ 14) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_218_15 :
    Uω (aρ 15) (bρ 15) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_218_16 :
    Uω (aρ 16) (bρ 16) (10429227298003 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_218 :
    Uρ (10429227298003 / 64000000000000 : ℝ) ≤
      (-(20967778577491089068771 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10429227298003 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18547208385266200982007 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10429227298003 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3740810840944483037073 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10429227298003 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(19028535752517117294929 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10429227298003 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19603161049574197177753 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10429227298003 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4116830991103902289863 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10429227298003 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2790166356911144784423 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10429227298003 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2619324694814019901359 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10429227298003 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10429227298003 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10429227298003 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10429227298003 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10429227298003 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10429227298003 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10429227298003 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10429227298003 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10429227298003 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_218_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_219_1 :
    Uω (aρ 1) (bρ 1) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(4629725336005811571373 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25110439601659373 / 160000000000000000 : ℝ) ≤
      (-(4629725336005811571373 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (25110439601659373 / 160000000000000000 : ℝ) =
            (25110439601659373 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25110439601659373 / 20000000000000000 : ℝ) ≤
            (568878516244188428627 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (784649731361953 / 5000000000000000 : ℝ)) (q :=
      (25110439601659373 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_219_2 :
    Uω (aρ 2) (bρ 2) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(2334411176211178011403 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24720797007786261 / 160000000000000000 : ℝ) ≤
      (-(2334411176211178011403 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24720797007786261 / 160000000000000000 : ℝ) =
            (24720797007786261 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24720797007786261 / 20000000000000000 : ℝ) ≤
            (264890749913821988597 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1544363150999767 / 10000000000000000 : ℝ)) (q :=
      (24720797007786261 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_219_3 :
    Uω (aρ 3) (bρ 3) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(18998787665759244029903 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23933880467362333 / 160000000000000000 : ℝ) ≤
      (-(18998787665759244029903 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (23933880467362333 / 160000000000000000 : ℝ) =
            (23933880467362333 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23933880467362333 / 20000000000000000 : ℝ) ≤
            (1795627743240755970097 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (186674336224597 / 1250000000000000 : ℝ)) (q :=
      (23933880467362333 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_219_4 :
    Uω (aρ 4) (bρ 4) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(19571541444456643283281 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4520315343059617 / 32000000000000000 : ℝ) ≤
      (-(19571541444456643283281 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4520315343059617 / 32000000000000000 : ℝ) =
            (4520315343059617 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4520315343059617 / 4000000000000000 : ℝ) ≤
            (1222873964543356716719 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (281030180370749 / 2000000000000000 : ℝ)) (q :=
      (4520315343059617 / 32000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_219_5 :
    Uω (aρ 5) (bρ 5) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(821955714717225692007 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4099424570602057 / 32000000000000000 : ℝ) ≤
      (-(821955714717225692007 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4099424570602057 / 32000000000000000 : ℝ) =
            (4099424570602057 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4099424570602057 / 4000000000000000 : ℝ) ≤
            (9820901642774307993 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (126028408840277 / 1000000000000000 : ℝ)) (q :=
      (4099424570602057 / 32000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_219_6 :
    Uω (aρ 6) (bρ 6) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(44555534812667741173 / 20000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3448568305934473 / 32000000000000000 : ℝ) ≤
      (-(44555534812667741173 / 20000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3448568305934473 / 32000000000000000 : ℝ) =
            (3448568305934473 / 2000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3448568305934473 / 2000000000000000 : ℝ) ≤
            (10896239611332258827 / 20000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (102073929812553 / 1000000000000000 : ℝ)) (q :=
      (3448568305934473 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_219_7 :
    Uω (aρ 7) (bρ 7) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(13056599216528297659903 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11750008581007197 / 160000000000000000 : ℝ) ≤
      (-(13056599216528297659903 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (11750008581007197 / 160000000000000000 : ℝ) =
            (11750008581007197 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11750008581007197 / 10000000000000000 : ℝ) ≤
            (806344389471702340097 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (34862285018899 / 625000000000000 : ℝ)) (q :=
      (11750008581007197 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_219_8 :
    Uω (aρ 8) (bρ 8) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_219_9 :
    Uω (aρ 9) (bρ 9) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_219_10 :
    Uω (aρ 10) (bρ 10) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_219_11 :
    Uω (aρ 11) (bρ 11) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_219_12 :
    Uω (aρ 12) (bρ 12) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_219_13 :
    Uω (aρ 13) (bρ 13) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_219_14 :
    Uω (aρ 14) (bρ 14) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_219_15 :
    Uω (aρ 15) (bρ 15) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_219_16 :
    Uω (aρ 16) (bρ 16) (20915234631277 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_219 :
    Uρ (20915234631277 / 128000000000000 : ℝ) ≤
      (-(20950852552191954841159 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20915234631277 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4629725336005811571373 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20915234631277 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2334411176211178011403 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20915234631277 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(18998787665759244029903 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20915234631277 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19571541444456643283281 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20915234631277 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(821955714717225692007 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20915234631277 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(44555534812667741173 / 20000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20915234631277 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(13056599216528297659903 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20915234631277 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20915234631277 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20915234631277 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20915234631277 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20915234631277 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20915234631277 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20915234631277 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (20915234631277 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20915234631277 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_219_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
