/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U18) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_220_1 :
    Uω (aρ 1) (bρ 1) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(18490674215971361238241 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6295354822894483 / 40000000000000000 : ℝ) ≤
      (-(18490674215971361238241 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6295354822894483 / 40000000000000000 : ℝ) =
            (6295354822894483 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6295354822894483 / 5000000000000000 : ℝ) ≤
            (2303741193028638761759 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1573735983708179 / 10000000000000000 : ℝ)) (q :=
      (6295354822894483 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_220_2 :
    Uω (aρ 2) (bρ 2) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(2330825898986484937893 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6197950879677093 / 40000000000000000 : ℝ) ≤
      (-(2330825898986484937893 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6197950879677093 / 40000000000000000 : ℝ) =
            (6197950879677093 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6197950879677093 / 5000000000000000 : ℝ) ≤
            (268476027138515062107 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (387200756152371 / 2500000000000000 : ℝ)) (q :=
      (6197950879677093 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_220_3 :
    Uω (aρ 3) (bρ 3) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(9484564051395421285797 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6001243171733643 / 40000000000000000 : ℝ) ≤
      (-(9484564051395421285797 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6001243171733643 / 40000000000000000 : ℝ) =
            (6001243171733643 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6001243171733643 / 5000000000000000 : ℝ) ≤
            (912643653104578714203 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1497845276987759 / 10000000000000000 : ℝ)) (q :=
      (6001243171733643 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_220_4 :
    Uω (aρ 4) (bρ 4) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(9770011278685046203197 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5668231688591941 / 40000000000000000 : ℝ) ≤
      (-(9770011278685046203197 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5668231688591941 / 40000000000000000 : ℝ) =
            (5668231688591941 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5668231688591941 / 5000000000000000 : ℝ) ≤
            (627196425814953796803 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (352408429120477 / 2500000000000000 : ℝ)) (q :=
      (5668231688591941 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_220_5 :
    Uω (aρ 5) (bρ 5) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(20513758757421810226879 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5142316082017839 / 40000000000000000 : ℝ) ≤
      (-(20513758757421810226879 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5142316082017839 / 40000000000000000 : ℝ) =
            (5142316082017839 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5142316082017839 / 5000000000000000 : ℝ) ≤
            (280656651578189773121 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1264865832529857 / 10000000000000000 : ℝ)) (q :=
      (5142316082017839 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_220_6 :
    Uω (aρ 6) (bρ 6) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(22234413891121944816083 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4329439396326663 / 40000000000000000 : ℝ) ≤
      (-(22234413891121944816083 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4329439396326663 / 40000000000000000 : ℝ) =
            (4329439396326663 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4329439396326663 / 2500000000000000 : ℝ) ≤
            (5491473320878055183917 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1025667864824269 / 10000000000000000 : ℝ)) (q :=
      (4329439396326663 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_220_7 :
    Uω (aρ 7) (bρ 7) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(26034182944698725387439 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (592160980922423 / 8000000000000000 : ℝ) ≤
      (-(26034182944698725387439 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (592160980922423 / 8000000000000000 : ℝ) =
            (592160980922423 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (592160980922423 / 500000000000000 : ℝ) ≤
            (1691704267301274612561 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (113002399945399 / 2000000000000000 : ℝ)) (q :=
      (592160980922423 / 8000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_220_8 :
    Uω (aρ 8) (bρ 8) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_220_9 :
    Uω (aρ 9) (bρ 9) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_220_10 :
    Uω (aρ 10) (bρ 10) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_220_11 :
    Uω (aρ 11) (bρ 11) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_220_12 :
    Uω (aρ 12) (bρ 12) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_220_13 :
    Uω (aρ 13) (bρ 13) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_220_14 :
    Uω (aρ 14) (bρ 14) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_220_15 :
    Uω (aρ 15) (bρ 15) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_220_16 :
    Uω (aρ 16) (bρ 16) (5243003666637 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_220 :
    Uρ (5243003666637 / 32000000000000 : ℝ) ≤
      (-(10467026257924661355203 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5243003666637 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18490674215971361238241 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5243003666637 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2330825898986484937893 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5243003666637 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(9484564051395421285797 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5243003666637 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9770011278685046203197 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5243003666637 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20513758757421810226879 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5243003666637 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(22234413891121944816083 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5243003666637 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(26034182944698725387439 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5243003666637 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5243003666637 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5243003666637 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5243003666637 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5243003666637 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5243003666637 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5243003666637 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5243003666637 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5243003666637 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_220_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_221_1 :
    Uω (aρ 1) (bρ 1) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(4615631637779595417191 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5050479791075543 / 32000000000000000 : ℝ) ≤
      (-(4615631637779595417191 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5050479791075543 / 32000000000000000 : ℝ) =
            (5050479791075543 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5050479791075543 / 4000000000000000 : ℝ) ≤
            (582972214470404582809 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (315634500285521 / 2000000000000000 : ℝ)) (q :=
      (5050479791075543 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_221_2 :
    Uω (aρ 2) (bρ 2) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(465450176953729785337 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24862809849817163 / 160000000000000000 : ℝ) ≤
      (-(465450176953729785337 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24862809849817163 / 160000000000000000 : ℝ) =
            (24862809849817163 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24862809849817163 / 20000000000000000 : ℝ) ≤
            (54410208271270214663 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (194155359467817 / 1250000000000000 : ℝ)) (q :=
      (24862809849817163 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_221_3 :
    Uω (aρ 3) (bρ 3) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(591861141768881967909 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24076064213378907 / 160000000000000000 : ℝ) ≤
      (-(591861141768881967909 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24076064213378907 / 160000000000000000 : ℝ) =
            (24076064213378907 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24076064213378907 / 20000000000000000 : ℝ) ≤
            (57964339762368032091 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (751147888768877 / 5000000000000000 : ℝ)) (q :=
      (24076064213378907 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_221_4 :
    Uω (aρ 4) (bρ 4) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(9754301871052985929913 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4548854885672911 / 32000000000000000 : ℝ) ≤
      (-(9754301871052985929913 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4548854885672911 / 32000000000000000 : ℝ) =
            (4548854885672911 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4548854885672911 / 4000000000000000 : ℝ) ≤
            (642905833447014070087 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (35352905886899 / 250000000000000 : ℝ)) (q :=
      (4548854885672911 / 32000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_221_5 :
    Uω (aρ 5) (bρ 5) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(10239375834821808422919 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20641397517236387 / 160000000000000000 : ℝ) ≤
      (-(10239375834821808422919 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (20641397517236387 / 160000000000000000 : ℝ) =
            (20641397517236387 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20641397517236387 / 20000000000000000 : ℝ) ≤
            (157831869678191577081 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1269446540919939 / 10000000000000000 : ℝ)) (q :=
      (20641397517236387 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_221_6 :
    Uω (aρ 6) (bρ 6) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(887650724271362820473 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17392637830890523 / 160000000000000000 : ℝ) ≤
      (-(887650724271362820473 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (17392637830890523 / 160000000000000000 : ℝ) =
            (17392637830890523 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17392637830890523 / 10000000000000000 : ℝ) ≤
            (221384764208637179527 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (515295977633353 / 5000000000000000 : ℝ)) (q :=
      (17392637830890523 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_221_7 :
    Uω (aρ 7) (bρ 7) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(12978083121240946271847 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2387195575291783 / 32000000000000000 : ℝ) ≤
      (-(12978083121240946271847 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2387195575291783 / 32000000000000000 : ℝ) =
            (2387195575291783 / 2000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2387195575291783 / 2000000000000000 : ℝ) ≤
            (884860484759053728153 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (114434168344551 / 2000000000000000 : ℝ)) (q :=
      (2387195575291783 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_221_8 :
    Uω (aρ 8) (bρ 8) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_221_9 :
    Uω (aρ 9) (bρ 9) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_221_10 :
    Uω (aρ 10) (bρ 10) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_221_11 :
    Uω (aρ 11) (bρ 11) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_221_12 :
    Uω (aρ 12) (bρ 12) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_221_13 :
    Uω (aρ 13) (bρ 13) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_221_14 :
    Uω (aρ 14) (bρ 14) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_221_15 :
    Uω (aρ 15) (bρ 15) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_221_16 :
    Uω (aρ 16) (bρ 16) (21028794701819 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_221 :
    Uρ (21028794701819 / 128000000000000 : ℝ) ≤
      (-(20917375244390658060383 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (21028794701819 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4615631637779595417191 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (21028794701819 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(465450176953729785337 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (21028794701819 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(591861141768881967909 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (21028794701819 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9754301871052985929913 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (21028794701819 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10239375834821808422919 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (21028794701819 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(887650724271362820473 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (21028794701819 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12978083121240946271847 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (21028794701819 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (21028794701819 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (21028794701819 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (21028794701819 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (21028794701819 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (21028794701819 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (21028794701819 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (21028794701819 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (21028794701819 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_221_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_222_1 :
    Uω (aρ 1) (bρ 1) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(1843445790326284033331 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12661689296639181 / 80000000000000000 : ℝ) ≤
      (-(1843445790326284033331 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12661689296639181 / 80000000000000000 : ℝ) =
            (12661689296639181 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12661689296639181 / 10000000000000000 : ℝ) ≤
            (235995750573715966669 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1582609015909639 / 10000000000000000 : ℝ)) (q :=
      (12661689296639181 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_222_2 :
    Uω (aρ 2) (bρ 2) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(18589488599339791797713 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12466908001325097 / 80000000000000000 : ℝ) ≤
      (-(18589488599339791797713 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12466908001325097 / 80000000000000000 : ℝ) =
            (12466908001325097 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12466908001325097 / 10000000000000000 : ℝ) ≤
            (2204926809660208202287 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (778841352295559 / 5000000000000000 : ℝ)) (q :=
      (12466908001325097 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_222_3 :
    Uω (aρ 3) (bρ 3) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(1891007244489895609963 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (96588620211349 / 640000000000000 : ℝ) ≤
      (-(1891007244489895609963 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (96588620211349 / 640000000000000 : ℝ) = (96588620211349 / 80000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (96588620211349 / 80000000000000 : ℝ) ≤
            (188434296410104390037 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3013492384429 / 20000000000000 : ℝ)) (q :=
      (96588620211349 / 640000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_222_4 :
    Uω (aρ 4) (bρ 4) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(19477284358716666822331 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11407809879854049 / 80000000000000000 : ℝ) ≤
      (-(19477284358716666822331 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11407809879854049 / 80000000000000000 : ℝ) =
            (11407809879854049 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11407809879854049 / 10000000000000000 : ℝ) ≤
            (1317131050283333177669 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (354649615409589 / 2500000000000000 : ℝ)) (q :=
      (11407809879854049 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_222_5 :
    Uω (aρ 5) (bρ 5) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(20443870661181125243673 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10356761254940081 / 80000000000000000 : ℝ) ≤
      (-(20443870661181125243673 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10356761254940081 / 80000000000000000 : ℝ) =
            (10356761254940081 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10356761254940081 / 10000000000000000 : ℝ) ≤
            (350544747818874756327 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (39813319523277 / 312500000000000 : ℝ)) (q :=
      (10356761254940081 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_222_6 :
    Uω (aρ 6) (bρ 6) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(11074163943683477485381 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8733741388639249 / 80000000000000000 : ℝ) ≤
      (-(11074163943683477485381 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8733741388639249 / 80000000000000000 : ℝ) =
            (8733741388639249 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8733741388639249 / 5000000000000000 : ℝ) ≤
            (2788779662316522514619 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (129438954163707 / 1250000000000000 : ℝ)) (q :=
      (8733741388639249 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_222_7 :
    Uω (aρ 7) (bρ 7) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(12939557978942782377787 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6014150070893521 / 80000000000000000 : ℝ) ≤
      (-(12939557978942782377787 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (6014150070893521 / 80000000000000000 : ℝ) =
            (6014150070893521 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6014150070893521 / 5000000000000000 : ℝ) ≤
            (923385627057217622213 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (72409398079153 / 1250000000000000 : ℝ)) (q :=
      (6014150070893521 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_222_8 :
    Uω (aρ 8) (bρ 8) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_222_9 :
    Uω (aρ 9) (bρ 9) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_222_10 :
    Uω (aρ 10) (bρ 10) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_222_11 :
    Uω (aρ 11) (bρ 11) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_222_12 :
    Uω (aρ 12) (bρ 12) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_222_13 :
    Uω (aρ 13) (bρ 13) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_222_14 :
    Uω (aρ 14) (bρ 14) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_222_15 :
    Uω (aρ 15) (bρ 15) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_222_16 :
    Uω (aρ 16) (bρ 16) (2108557473709 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_222 :
    Uρ (2108557473709 / 12800000000000 : ℝ) ≤
      (-(20900817676992104316193 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2108557473709 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1843445790326284033331 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2108557473709 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18589488599339791797713 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2108557473709 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1891007244489895609963 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2108557473709 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19477284358716666822331 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2108557473709 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20443870661181125243673 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2108557473709 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11074163943683477485381 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2108557473709 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12939557978942782377787 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2108557473709 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2108557473709 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2108557473709 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2108557473709 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2108557473709 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2108557473709 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2108557473709 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2108557473709 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2108557473709 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_222_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_223_1 :
    Uω (aρ 1) (bρ 1) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(1840646782995148303141 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25394358205497089 / 160000000000000000 : ℝ) ≤
      (-(1840646782995148303141 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (25394358205497089 / 160000000000000000 : ℝ) =
            (25394358205497089 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25394358205497089 / 20000000000000000 : ℝ) ≤
            (238794757904851696859 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1587045527181433 / 10000000000000000 : ℝ)) (q :=
      (25394358205497089 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_223_2 :
    Uω (aρ 2) (bρ 2) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(4640262822588700036873 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5000964395745509 / 32000000000000000 : ℝ) ≤
      (-(4640262822588700036873 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5000964395745509 / 32000000000000000 : ℝ) =
            (5000964395745509 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5000964395745509 / 4000000000000000 : ℝ) ≤
            (558341029661299963127 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (39053062783631 / 250000000000000 : ℝ)) (q :=
      (5000964395745509 / 32000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_223_3 :
    Uω (aρ 3) (bρ 3) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(18880675310025809271703 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24218245211379041 / 160000000000000000 : ℝ) ≤
      (-(18880675310025809271703 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24218245211379041 / 160000000000000000 : ℝ) =
            (24218245211379041 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24218245211379041 / 20000000000000000 : ℝ) ≤
            (1913740098974190728297 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1511196521776677 / 10000000000000000 : ℝ)) (q :=
      (24218245211379041 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_223_4 :
    Uω (aρ 4) (bρ 4) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(19446063773434154064433 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22886962770534089 / 160000000000000000 : ℝ) ≤
      (-(19446063773434154064433 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (22886962770534089 / 160000000000000000 : ℝ) =
            (22886962770534089 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22886962770534089 / 20000000000000000 : ℝ) ≤
            (1348351635565845935567 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (711540198868029 / 5000000000000000 : ℝ)) (q :=
      (22886962770534089 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_223_5 :
    Uω (aρ 5) (bρ 5) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(20409114799383380511043 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20785639394077129 / 160000000000000000 : ℝ) ≤
      (-(20409114799383380511043 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (20785639394077129 / 160000000000000000 : ℝ) =
            (20785639394077129 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20785639394077129 / 20000000000000000 : ℝ) ≤
            (385300609616619488957 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (639302447506969 / 5000000000000000 : ℝ)) (q :=
      (20785639394077129 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_223_6 :
    Uω (aρ 6) (bρ 6) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(4421118220594607150783 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17542292925209281 / 160000000000000000 : ℝ) ≤
      (-(4421118220594607150783 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (17542292925209281 / 160000000000000000 : ℝ) =
            (17542292925209281 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17542292925209281 / 10000000000000000 : ℝ) ≤
            (1124059221805392849217 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1040426961545457 / 10000000000000000 : ℝ)) (q :=
      (17542292925209281 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_223_7 :
    Uω (aρ 7) (bρ 7) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(25803001453402450152699 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12120202262824801 / 160000000000000000 : ℝ) ≤
      (-(25803001453402450152699 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (12120202262824801 / 160000000000000000 : ℝ) =
            (12120202262824801 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12120202262824801 / 10000000000000000 : ℝ) ≤
            (1922885758597549847301 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (586327009507397 / 10000000000000000 : ℝ)) (q :=
      (12120202262824801 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_223_8 :
    Uω (aρ 8) (bρ 8) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_223_9 :
    Uω (aρ 9) (bρ 9) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_223_10 :
    Uω (aρ 10) (bρ 10) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_223_11 :
    Uω (aρ 11) (bρ 11) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_223_12 :
    Uω (aρ 12) (bρ 12) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_223_13 :
    Uω (aρ 13) (bρ 13) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_223_14 :
    Uω (aρ 14) (bρ 14) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_223_15 :
    Uω (aρ 15) (bρ 15) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_223_16 :
    Uω (aρ 16) (bρ 16) (21142354772361 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_223 :
    Uρ (21142354772361 / 128000000000000 : ℝ) ≤
      (-(522109422600521759591 / 250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (21142354772361 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1840646782995148303141 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (21142354772361 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4640262822588700036873 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (21142354772361 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(18880675310025809271703 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (21142354772361 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19446063773434154064433 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (21142354772361 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20409114799383380511043 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (21142354772361 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4421118220594607150783 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (21142354772361 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(25803001453402450152699 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (21142354772361 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (21142354772361 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (21142354772361 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (21142354772361 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (21142354772361 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (21142354772361 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (21142354772361 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (21142354772361 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (21142354772361 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_223_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_224_1 :
    Uω (aρ 1) (bρ 1) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(4594638973109356257451 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1591583612015541 / 10000000000000000 : ℝ) ≤
      (-(4594638973109356257451 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1591583612015541 / 10000000000000000 : ℝ) =
            (1591583612015541 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1591583612015541 / 1250000000000000 : ℝ) ≤
            (603964879140643742549 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (198935254408729 / 1250000000000000 : ℝ)) (q :=
      (1591583612015541 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_224_2 :
    Uω (aρ 2) (bρ 2) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(2316586836256544584097 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1567239236222003 / 10000000000000000 : ℝ) ≤
      (-(2316586836256544584097 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1567239236222003 / 10000000000000000 : ℝ) =
            (1567239236222003 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1567239236222003 / 1250000000000000 : ℝ) ≤
            (282715089868455415903 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (391640574048189 / 2500000000000000 : ℝ)) (q :=
      (1567239236222003 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_224_3 :
    Uω (aρ 3) (bρ 3) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(2356420577366438601497 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (303616683687529 / 2000000000000000 : ℝ) ≤
      (-(2356420577366438601497 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (303616683687529 / 2000000000000000 : ℝ) =
            (303616683687529 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (303616683687529 / 250000000000000 : ℝ) ≤
            (242881348758561398503 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (37891169174351 / 250000000000000 : ℝ)) (q :=
      (303616683687529 / 2000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_224_4 :
    Uω (aρ 4) (bρ 4) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(3882988271717983275987 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2869787935337357 / 20000000000000000 : ℝ) ≤
      (-(3882988271717983275987 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2869787935337357 / 20000000000000000 : ℝ) =
            (2869787935337357 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2869787935337357 / 2500000000000000 : ℝ) ≤
            (275894810082016724013 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1427562046501107 / 10000000000000000 : ℝ)) (q :=
      (2869787935337357 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_224_5 :
    Uω (aρ 5) (bρ 5) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(1018724158109815143011 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (521443706415633 / 4000000000000000 : ℝ) ≤
      (-(1018724158109815143011 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (521443706415633 / 4000000000000000 : ℝ) =
            (521443706415633 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (521443706415633 / 500000000000000 : ℝ) ≤
            (20996612340184856989 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (256636512515383 / 2000000000000000 : ℝ)) (q :=
      (521443706415633 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_224_6 :
    Uω (aρ 6) (bρ 6) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(882522226357036714549 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5505333989239 / 50000000000000 : ℝ) ≤
      (-(882522226357036714549 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show (5505333989239 / 50000000000000 : ℝ) = (5505333989239 / 3125000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5505333989239 / 3125000000000 : ℝ) ≤
            (226513262122963285451 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (20906760026687 / 200000000000000 : ℝ)) (q :=
      (5505333989239 / 50000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_224_7 :
    Uω (aρ 7) (bρ 7) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(643194842372322635267 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (305292480502351 / 4000000000000000 : ℝ) ≤
      (-(643194842372322635267 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (305292480502351 / 4000000000000000 : ℝ) =
            (305292480502351 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (305292480502351 / 250000000000000 : ℝ) ≤
            (49952337927677364733 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (118665637782101 / 2000000000000000 : ℝ)) (q :=
      (305292480502351 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_224_8 :
    Uω (aρ 8) (bρ 8) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_224_9 :
    Uω (aρ 9) (bρ 9) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_224_10 :
    Uω (aρ 10) (bρ 10) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_224_11 :
    Uω (aρ 11) (bρ 11) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_224_12 :
    Uω (aρ 12) (bρ 12) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_224_13 :
    Uω (aρ 13) (bρ 13) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_224_14 :
    Uω (aρ 14) (bρ 14) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_224_15 :
    Uω (aρ 15) (bρ 15) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_224_16 :
    Uω (aρ 16) (bρ 16) (1324945925477 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_224 :
    Uρ (1324945925477 / 8000000000000 : ℝ) ≤
      (-(4173610031223508181363 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1324945925477 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4594638973109356257451 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1324945925477 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2316586836256544584097 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1324945925477 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2356420577366438601497 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1324945925477 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3882988271717983275987 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1324945925477 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(1018724158109815143011 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1324945925477 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(882522226357036714549 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1324945925477 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(643194842372322635267 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1324945925477 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1324945925477 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1324945925477 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1324945925477 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1324945925477 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1324945925477 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1324945925477 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1324945925477 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1324945925477 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_224_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_225_1 :
    Uω (aρ 1) (bρ 1) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(4580741172024563874411 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12803648445098779 / 80000000000000000 : ℝ) ≤
      (-(4580741172024563874411 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12803648445098779 / 80000000000000000 : ℝ) =
            (12803648445098779 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12803648445098779 / 10000000000000000 : ℝ) ≤
            (617862680225436125589 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1600355042002351 / 10000000000000000 : ℝ)) (q :=
      (12803648445098779 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_225_2 :
    Uω (aρ 2) (bρ 2) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(9238110895246623312471 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2521783886136911 / 16000000000000000 : ℝ) ≤
      (-(9238110895246623312471 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2521783886136911 / 16000000000000000 : ℝ) =
            (2521783886136911 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2521783886136911 / 2000000000000000 : ℝ) ≤
            (1159096809253376687529 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (315088360181759 / 2000000000000000 : ℝ)) (q :=
      (2521783886136911 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_225_3 :
    Uω (aρ 3) (bρ 3) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(939650026926023325251 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12215755830567379 / 80000000000000000 : ℝ) ≤
      (-(939650026926023325251 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12215755830567379 / 80000000000000000 : ℝ) =
            (12215755830567379 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12215755830567379 / 10000000000000000 : ℝ) ≤
            (100070743523976674749 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1524547007229501 / 10000000000000000 : ℝ)) (q :=
      (12215755830567379 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_225_4 :
    Uω (aρ 4) (bρ 4) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(9676494279784326839573 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2310097809709927 / 16000000000000000 : ℝ) ≤
      (-(9676494279784326839573 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2310097809709927 / 16000000000000000 : ℝ) =
            (2310097809709927 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2310097809709927 / 2000000000000000 : ℝ) ≤
            (720713424715673160427 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (287304898558013 / 2000000000000000 : ℝ)) (q :=
      (2310097809709927 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_225_5 :
    Uω (aρ 5) (bρ 5) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(20305588925442651515513 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10500971128862519 / 80000000000000000 : ℝ) ≤
      (-(20305588925442651515513 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10500971128862519 / 80000000000000000 : ℝ) =
            (10500971128862519 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10500971128862519 / 10000000000000000 : ℝ) ≤
            (488826483557348484487 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (646167466101643 / 5000000000000000 : ℝ)) (q :=
      (10500971128862519 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_225_6 :
    Uω (aρ 6) (bρ 6) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(5494645146109420751617 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1776651943929107 / 16000000000000000 : ℝ) ≤
      (-(5494645146109420751617 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1776651943929107 / 16000000000000000 : ℝ) =
            (1776651943929107 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1776651943929107 / 1000000000000000 : ℝ) ≤
            (1436826656890579248383 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3297335796997 / 31250000000000 : ℝ)) (q :=
      (1776651943929107 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_225_7 :
    Uω (aρ 7) (bρ 7) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(12789994806014067070709 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6196766801680643 / 80000000000000000 : ℝ) ≤
      (-(12789994806014067070709 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (6196766801680643 / 80000000000000000 : ℝ) =
            (6196766801680643 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6196766801680643 / 5000000000000000 : ℝ) ≤
            (1072948799985932929291 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (607185606307817 / 10000000000000000 : ℝ)) (q :=
      (6196766801680643 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_225_8 :
    Uω (aρ 8) (bρ 8) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_225_9 :
    Uω (aρ 9) (bρ 9) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_225_10 :
    Uω (aρ 10) (bρ 10) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_225_11 :
    Uω (aρ 11) (bρ 11) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_225_12 :
    Uω (aρ 12) (bρ 12) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_225_13 :
    Uω (aρ 13) (bρ 13) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_225_14 :
    Uω (aρ 14) (bρ 14) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_225_15 :
    Uω (aρ 15) (bρ 15) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_225_16 :
    Uω (aρ 16) (bρ 16) (10656347439087 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_225 :
    Uρ (10656347439087 / 64000000000000 : ℝ) ≤
      (-(1302233018806088858069 / 625000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10656347439087 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4580741172024563874411 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10656347439087 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9238110895246623312471 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10656347439087 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(939650026926023325251 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10656347439087 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9676494279784326839573 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10656347439087 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20305588925442651515513 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10656347439087 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5494645146109420751617 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10656347439087 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12789994806014067070709 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10656347439087 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10656347439087 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10656347439087 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10656347439087 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10656347439087 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10656347439087 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10656347439087 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10656347439087 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10656347439087 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_225_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_226_1 :
    Uω (aρ 1) (bρ 1) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(71358128331416751623 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (257492558887961 / 1600000000000000 : ℝ) ≤
      (-(71358128331416751623 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (257492558887961 / 1600000000000000 : ℝ) =
            (257492558887961 / 200000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (257492558887961 / 200000000000000 : ℝ) ≤
            (9870056859989498377 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (64369121452643 / 400000000000000 : ℝ)) (q :=
      (257492558887961 / 1600000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_226_2 :
    Uω (aρ 2) (bρ 2) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(18420066289172837522877 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1267992462989421 / 8000000000000000 : ℝ) ≤
      (-(18420066289172837522877 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1267992462989421 / 8000000000000000 : ℝ) =
            (1267992462989421 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1267992462989421 / 1000000000000000 : ℝ) ≤
            (2374349119827162477123 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (316864244040023 / 2000000000000000 : ℝ)) (q :=
      (1267992462989421 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_226_3 :
    Uω (aρ 3) (bρ 3) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(18734976189111055348777 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1228684299891513 / 8000000000000000 : ℝ) ≤
      (-(18734976189111055348777 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1228684299891513 / 8000000000000000 : ℝ) =
            (1228684299891513 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1228684299891513 / 1000000000000000 : ℝ) ≤
            (2059439219888944651223 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (306689383761069 / 2000000000000000 : ℝ)) (q :=
      (1228684299891513 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_226_4 :
    Uω (aρ 4) (bρ 4) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(19291421059334564470881 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5810910943084333 / 40000000000000000 : ℝ) ≤
      (-(19291421059334564470881 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5810910943084333 / 40000000000000000 : ℝ) =
            (5810910943084333 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5810910943084333 / 5000000000000000 : ℝ) ≤
            (1502994349665435529119 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1445485821683729 / 10000000000000000 : ℝ)) (q :=
      (5810910943084333 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_226_5 :
    Uω (aρ 5) (bρ 5) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(10118590390140244503249 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5286526295727557 / 40000000000000000 : ℝ) ≤
      (-(10118590390140244503249 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5286526295727557 / 40000000000000000 : ℝ) =
            (5286526295727557 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5286526295727557 / 5000000000000000 : ℝ) ≤
            (278617314359755496751 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1301483417340341 / 10000000000000000 : ℝ)) (q :=
      (5286526295727557 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_226_6 :
    Uω (aρ 6) (bρ 6) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(175159092645873246921 / 80000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4478959634428699 / 40000000000000000 : ℝ) ≤
      (-(175159092645873246921 / 80000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4478959634428699 / 40000000000000000 : ℝ) =
            (4478959634428699 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4478959634428699 / 2500000000000000 : ℝ) ≤
            (46648005050126753079 / 80000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4159923679027 / 39062500000000 : ℝ)) (q :=
      (4478959634428699 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_226_7 :
    Uω (aρ 7) (bρ 7) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(25435499359157548817667 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3143477015809841 / 40000000000000000 : ℝ) ≤
      (-(25435499359157548817667 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3143477015809841 / 40000000000000000 : ℝ) =
            (3143477015809841 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3143477015809841 / 2500000000000000 : ℝ) ≤
            (2290387852842451182333 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (620860533281483 / 10000000000000000 : ℝ)) (q :=
      (3143477015809841 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_226_8 :
    Uω (aρ 8) (bρ 8) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_226_9 :
    Uω (aρ 9) (bρ 9) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_226_10 :
    Uω (aρ 10) (bρ 10) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_226_11 :
    Uω (aρ 11) (bρ 11) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_226_12 :
    Uω (aρ 12) (bρ 12) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_226_13 :
    Uω (aρ 13) (bρ 13) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_226_14 :
    Uω (aρ 14) (bρ 14) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_226_15 :
    Uω (aρ 15) (bρ 15) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_226_16 :
    Uω (aρ 16) (bρ 16) (5356563737179 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_226 :
    Uρ (5356563737179 / 32000000000000 : ℝ) ≤
      (-(20803832407117668669149 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5356563737179 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(71358128331416751623 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5356563737179 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18420066289172837522877 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5356563737179 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(18734976189111055348777 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5356563737179 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19291421059334564470881 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5356563737179 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10118590390140244503249 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5356563737179 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(175159092645873246921 / 80000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5356563737179 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(25435499359157548817667 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5356563737179 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5356563737179 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5356563737179 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5356563737179 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5356563737179 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5356563737179 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5356563737179 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5356563737179 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5356563737179 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_226_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_227_1 :
    Uω (aρ 1) (bρ 1) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(9106350502993110805211 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12945607394839337 / 80000000000000000 : ℝ) ≤
      (-(9106350502993110805211 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12945607394839337 / 80000000000000000 : ℝ) =
            (12945607394839337 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12945607394839337 / 10000000000000000 : ℝ) ≤
            (1290857201506889194789 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1618101018415303 / 10000000000000000 : ℝ)) (q :=
      (12945607394839337 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_227_2 :
    Uω (aρ 2) (bρ 2) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(18364224635257561809589 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12750929493118181 / 80000000000000000 : ℝ) ≤
      (-(18364224635257561809589 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12750929493118181 / 80000000000000000 : ℝ) =
            (12750929493118181 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12750929493118181 / 10000000000000000 : ℝ) ≤
            (2430190773742438190411 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (796600277747507 / 5000000000000000 : ℝ)) (q :=
      (12750929493118181 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_227_3 :
    Uω (aρ 3) (bρ 3) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(4669321906570947279869 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2471585775060729 / 16000000000000000 : ℝ) ≤
      (-(4669321906570947279869 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2471585775060729 / 16000000000000000 : ℝ) =
            (2471585775060729 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2471585775060729 / 2000000000000000 : ℝ) ≤
            (529281945679052720131 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (77117325369569 / 500000000000000 : ℝ)) (q :=
      (2471585775060729 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_227_4 :
    Uω (aρ 4) (bρ 4) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(9615117024126235910581 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11693150336822277 / 80000000000000000 : ℝ) ≤
      (-(9615117024126235910581 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11693150336822277 / 80000000000000000 : ℝ) =
            (11693150336822277 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11693150336822277 / 10000000000000000 : ℝ) ≤
            (782090680373764089419 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (727223026918019 / 5000000000000000 : ℝ)) (q :=
      (11693150336822277 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_227_5 :
    Uω (aρ 5) (bρ 5) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(20169251715464789785997 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10645118841465981 / 80000000000000000 : ℝ) ≤
      (-(20169251715464789785997 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10645118841465981 / 80000000000000000 : ℝ) =
            (10645118841465981 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10645118841465981 / 10000000000000000 : ℝ) ≤
            (625163693535210214003 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (327657024832991 / 2500000000000000 : ℝ)) (q :=
      (10645118841465981 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_227_6 :
    Uω (aρ 6) (bρ 6) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(10905979039386153311897 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1806502965764577 / 16000000000000000 : ℝ) ≤
      (-(10905979039386153311897 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1806502965764577 / 16000000000000000 : ℝ) =
            (1806502965764577 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1806502965764577 / 1000000000000000 : ℝ) ≤
            (2956964566613846688103 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (107471747131119 / 1000000000000000 : ℝ)) (q :=
      (1806502965764577 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_227_7 :
    Uω (aρ 7) (bρ 7) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(25294137832826385335031 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6376458507399157 / 80000000000000000 : ℝ) ≤
      (-(25294137832826385335031 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (6376458507399157 / 80000000000000000 : ℝ) =
            (6376458507399157 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6376458507399157 / 5000000000000000 : ℝ) ≤
            (2431749379173614664969 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (317182385857629 / 5000000000000000 : ℝ)) (q :=
      (6376458507399157 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_227_8 :
    Uω (aρ 8) (bρ 8) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_227_9 :
    Uω (aρ 9) (bρ 9) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_227_10 :
    Uω (aρ 10) (bρ 10) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_227_11 :
    Uω (aρ 11) (bρ 11) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_227_12 :
    Uω (aρ 12) (bρ 12) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_227_13 :
    Uω (aρ 13) (bρ 13) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_227_14 :
    Uω (aρ 14) (bρ 14) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_227_15 :
    Uω (aρ 15) (bρ 15) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_227_16 :
    Uω (aρ 16) (bρ 16) (10769907509629 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_227 :
    Uρ (10769907509629 / 64000000000000 : ℝ) ≤
      (-(4154468893221481873091 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10769907509629 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9106350502993110805211 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10769907509629 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18364224635257561809589 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10769907509629 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4669321906570947279869 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10769907509629 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9615117024126235910581 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10769907509629 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(20169251715464789785997 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10769907509629 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(10905979039386153311897 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10769907509629 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(25294137832826385335031 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10769907509629 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10769907509629 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10769907509629 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10769907509629 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10769907509629 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10769907509629 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10769907509629 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10769907509629 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10769907509629 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_227_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_228_1 :
    Uω (aρ 1) (bρ 1) (108266875449 / 640000000000 : ℝ) ≤
      (-(9079010911160674591103 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1627073349652751 / 10000000000000000 : ℝ) ≤
      (-(9079010911160674591103 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1627073349652751 / 10000000000000000 : ℝ) =
            (1627073349652751 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1627073349652751 / 1250000000000000 : ℝ) ≤
            (1318196793339325408897 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1626973988499877 / 10000000000000000 : ℝ)) (q :=
      (1627073349652751 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_228_2 :
    Uω (aρ 2) (bρ 2) (108266875449 / 640000000000 : ℝ) ≤
      (-(18308693337218033383591 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1602741753242869 / 10000000000000000 : ℝ) ≤
      (-(18308693337218033383591 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1602741753242869 / 10000000000000000 : ℝ) =
            (1602741753242869 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1602741753242869 / 1250000000000000 : ℝ) ≤
            (2485722071781966616409 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1602079808190113 / 10000000000000000 : ℝ)) (q :=
      (1602741753242869 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_228_3 :
    Uω (aρ 3) (bρ 3) (108266875449 / 640000000000 : ℝ) ≤
      (-(18619930974125314054273 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (776813342623067 / 5000000000000000 : ℝ) ≤
      (-(18619930974125314054273 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (776813342623067 / 5000000000000000 : ℝ) =
            (776813342623067 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (776813342623067 / 625000000000000 : ℝ) ≤
            (2174484434874685945727 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1551245778546643 / 10000000000000000 : ℝ)) (q :=
      (776813342623067 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_228_4 :
    Uω (aρ 4) (bρ 4) (108266875449 / 640000000000 : ℝ) ≤
      (-(766776912281108700213 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1470559310136607 / 10000000000000000 : ℝ) ≤
      (-(766776912281108700213 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1470559310136607 / 10000000000000000 : ℝ) =
            (1470559310136607 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1470559310136607 / 1250000000000000 : ℝ) ≤
            (64999704078891299787 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1463405209392589 / 10000000000000000 : ℝ)) (q :=
      (1470559310136607 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_228_5 :
    Uω (aρ 5) (bρ 5) (108266875449 / 640000000000 : ℝ) ≤
      (-(502544871858661952131 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2679292548779787 / 20000000000000000 : ℝ) ≤
      (-(502544871858661952131 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2679292548779787 / 20000000000000000 : ℝ) =
            (2679292548779787 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2679292548779787 / 2500000000000000 : ℝ) ≤
            (17315513366338047869 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (659884528617081 / 5000000000000000 : ℝ)) (q :=
      (2679292548779787 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_228_6 :
    Uω (aρ 6) (bρ 6) (108266875449 / 640000000000 : ℝ) ≤
      (-(679055625029343955549 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (455352406510399 / 4000000000000000 : ℝ) ≤
      (-(679055625029343955549 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (455352406510399 / 4000000000000000 : ℝ) =
            (455352406510399 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (455352406510399 / 250000000000000 : ℝ) ≤
            (187378350345656044451 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (108447891614637 / 1000000000000000 : ℝ)) (q :=
      (455352406510399 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_228_7 :
    Uω (aρ 7) (bρ 7) (108266875449 / 640000000000 : ℝ) ≤
      (-(25155736715238488212441 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (808165366760121 / 10000000000000000 : ℝ) ≤
      (-(25155736715238488212441 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (808165366760121 / 10000000000000000 : ℝ) =
            (808165366760121 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (808165366760121 / 625000000000000 : ℝ) ≤
            (2570150496761511787559 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (647708997874617 / 10000000000000000 : ℝ)) (q :=
      (808165366760121 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_228_8 :
    Uω (aρ 8) (bρ 8) (108266875449 / 640000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_228_9 :
    Uω (aρ 9) (bρ 9) (108266875449 / 640000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_228_10 :
    Uω (aρ 10) (bρ 10) (108266875449 / 640000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_228_11 :
    Uω (aρ 11) (bρ 11) (108266875449 / 640000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_228_12 :
    Uω (aρ 12) (bρ 12) (108266875449 / 640000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_228_13 :
    Uω (aρ 13) (bρ 13) (108266875449 / 640000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_228_14 :
    Uω (aρ 14) (bρ 14) (108266875449 / 640000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_228_15 :
    Uω (aρ 15) (bρ 15) (108266875449 / 640000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_228_16 :
    Uω (aρ 16) (bρ 16) (108266875449 / 640000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_228 :
    Uρ (108266875449 / 640000000000 : ℝ) ≤
      (-(5185311988381454830147 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (108266875449 / 640000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9079010911160674591103 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (108266875449 / 640000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18308693337218033383591 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (108266875449 / 640000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(18619930974125314054273 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (108266875449 / 640000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(766776912281108700213 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (108266875449 / 640000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(502544871858661952131 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (108266875449 / 640000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(679055625029343955549 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (108266875449 / 640000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(25155736715238488212441 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (108266875449 / 640000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (108266875449 / 640000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (108266875449 / 640000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (108266875449 / 640000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (108266875449 / 640000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (108266875449 / 640000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (108266875449 / 640000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (108266875449 / 640000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (108266875449 / 640000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_228_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_229_1 :
    Uω (aρ 1) (bρ 1) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(3620728006182036485219 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13087566152328083 / 80000000000000000 : ℝ) ≤
      (-(3620728006182036485219 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13087566152328083 / 80000000000000000 : ℝ) =
            (13087566152328083 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13087566152328083 / 10000000000000000 : ℝ) ≤
            (538155075617963514781 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (817923473382651 / 5000000000000000 : ℝ)) (q :=
      (13087566152328083 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_229_2 :
    Uω (aρ 2) (bρ 2) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(18253468961514672487477 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12892938233831779 / 80000000000000000 : ℝ) ≤
      (-(18253468961514672487477 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12892938233831779 / 80000000000000000 : ℝ) =
            (12892938233831779 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12892938233831779 / 10000000000000000 : ℝ) ≤
            (2540946447485327512523 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (805479489825613 / 5000000000000000 : ℝ)) (q :=
      (12892938233831779 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_229_3 :
    Uω (aρ 3) (bρ 3) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(9281451211823238992419 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12500096840639403 / 80000000000000000 : ℝ) ≤
      (-(9281451211823238992419 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12500096840639403 / 80000000000000000 : ℝ) =
            (12500096840639403 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12500096840639403 / 10000000000000000 : ℝ) ≤
            (1115756492676761007581 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (390036184425783 / 2500000000000000 : ℝ)) (q :=
      (12500096840639403 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_229_4 :
    Uω (aρ 4) (bρ 4) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(19108982704437711202299 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11835794397591891 / 80000000000000000 : ℝ) ≤
      (-(19108982704437711202299 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11835794397591891 / 80000000000000000 : ℝ) =
            (11835794397591891 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11835794397591891 / 10000000000000000 : ℝ) ≤
            (1685432704562288797701 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (736181654003127 / 5000000000000000 : ℝ)) (q :=
      (11835794397591891 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_229_5 :
    Uω (aρ 5) (bρ 5) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(5008700887564128370101 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10789206959810951 / 80000000000000000 : ℝ) ≤
      (-(5008700887564128370101 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10789206959810951 / 80000000000000000 : ℝ) =
            (10789206959810951 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10789206959810951 / 10000000000000000 : ℝ) ≤
            (189902964685871629899 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1328906367896019 / 10000000000000000 : ℝ)) (q :=
      (10789206959810951 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_229_6 :
    Uω (aρ 6) (bρ 6) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(21648337739633651589547 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9181520839215787 / 80000000000000000 : ℝ) ≤
      (-(21648337739633651589547 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (9181520839215787 / 80000000000000000 : ℝ) =
            (9181520839215787 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9181520839215787 / 5000000000000000 : ℝ) ≤
            (6077549472366348410453 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (273556303221807 / 2500000000000000 : ℝ)) (q :=
      (9181520839215787 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_229_7 :
    Uω (aρ 7) (bρ 7) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(12510071202273143955923 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1310717216291271 / 16000000000000000 : ℝ) ≤
      (-(12510071202273143955923 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1310717216291271 / 16000000000000000 : ℝ) =
            (1310717216291271 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1310717216291271 / 1000000000000000 : ℝ) ≤
            (1352872403726856044077 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (66090290420737 / 1000000000000000 : ℝ)) (q :=
      (1310717216291271 / 16000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_229_8 :
    Uω (aρ 8) (bρ 8) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_229_9 :
    Uω (aρ 9) (bρ 9) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_229_10 :
    Uω (aρ 10) (bρ 10) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_229_11 :
    Uω (aρ 11) (bρ 11) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_229_12 :
    Uω (aρ 12) (bρ 12) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_229_13 :
    Uω (aρ 13) (bρ 13) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_229_14 :
    Uω (aρ 14) (bρ 14) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_229_15 :
    Uω (aρ 15) (bρ 15) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_229_16 :
    Uω (aρ 16) (bρ 16) (10883467580171 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_229 :
    Uρ (10883467580171 / 64000000000000 : ℝ) ≤
      (-(10355263825737622949503 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10883467580171 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3620728006182036485219 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10883467580171 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(18253468961514672487477 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10883467580171 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(9281451211823238992419 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10883467580171 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(19108982704437711202299 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10883467580171 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5008700887564128370101 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10883467580171 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(21648337739633651589547 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10883467580171 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12510071202273143955923 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10883467580171 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10883467580171 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10883467580171 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10883467580171 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10883467580171 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10883467580171 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10883467580171 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10883467580171 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10883467580171 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_229_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_230_1 :
    Uω (aρ 1) (bρ 1) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(18049552413909734351791 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1315854546092271 / 8000000000000000 : ℝ) ≤
      (-(18049552413909734351791 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1315854546092271 / 8000000000000000 : ℝ) =
            (1315854546092271 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1315854546092271 / 1000000000000000 : ℝ) ≤
            (2744862995090265648209 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (328943978680573 / 2000000000000000 : ℝ)) (q :=
      (1315854546092271 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_230_2 :
    Uω (aρ 2) (bρ 2) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(727941925252781587649 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6481971061064049 / 40000000000000000 : ℝ) ≤
      (-(727941925252781587649 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6481971061064049 / 40000000000000000 : ℝ) =
            (6481971061064049 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6481971061064049 / 5000000000000000 : ℝ) ≤
            (103834691107218412351 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (404959517803553 / 2500000000000000 : ℝ)) (q :=
      (6481971061064049 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_230_3 :
    Uω (aρ 3) (bρ 3) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(9253099115622933870931 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1257117897254897 / 8000000000000000 : ℝ) ≤
      (-(9253099115622933870931 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1257117897254897 / 8000000000000000 : ℝ) =
            (1257117897254897 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1257117897254897 / 1000000000000000 : ℝ) ≤
            (1144108588877066129069 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (156904339016943 / 1000000000000000 : ℝ)) (q :=
      (1257117897254897 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_230_4 :
    Uω (aρ 4) (bρ 4) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(952445459756741781521 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5953555081510063 / 40000000000000000 : ℝ) ≤
      (-(952445459756741781521 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5953555081510063 / 40000000000000000 : ℝ) =
            (5953555081510063 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5953555081510063 / 5000000000000000 : ℝ) ≤
            (87275310693258218479 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1481320368852219 / 10000000000000000 : ℝ)) (q :=
      (5953555081510063 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_230_5 :
    Uω (aρ 5) (bρ 5) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(19968271182064297647983 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5430614717210019 / 40000000000000000 : ℝ) ≤
      (-(19968271182064297647983 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5430614717210019 / 40000000000000000 : ℝ) =
            (5430614717210019 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5430614717210019 / 5000000000000000 : ℝ) ≤
            (826144226935702352017 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1338040106037197 / 10000000000000000 : ℝ)) (q :=
      (5430614717210019 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_230_6 :
    Uω (aρ 6) (bρ 6) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(10783808568520747034887 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4627967280334191 / 40000000000000000 : ℝ) ≤
      (-(10783808568520747034887 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4627967280334191 / 40000000000000000 : ℝ) =
            (4627967280334191 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4627967280334191 / 2500000000000000 : ℝ) ≤
            (3079135037479252965113 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1103956762739283 / 10000000000000000 : ℝ)) (q :=
      (4627967280334191 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_230_7 :
    Uω (aρ 7) (bρ 7) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(6221803565729163471369 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3320641631589271 / 40000000000000000 : ℝ) ≤
      (-(6221803565729163471369 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3320641631589271 / 40000000000000000 : ℝ) =
            (3320641631589271 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3320641631589271 / 2500000000000000 : ℝ) ≤
            (709668237270836528631 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (673955319126823 / 10000000000000000 : ℝ)) (q :=
      (3320641631589271 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_230_8 :
    Uω (aρ 8) (bρ 8) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_230_9 :
    Uω (aρ 9) (bρ 9) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_230_10 :
    Uω (aρ 10) (bρ 10) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_230_11 :
    Uω (aρ 11) (bρ 11) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_230_12 :
    Uω (aρ 12) (bρ 12) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_230_13 :
    Uω (aρ 13) (bρ 13) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_230_14 :
    Uω (aρ 14) (bρ 14) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_230_15 :
    Uω (aρ 15) (bρ 15) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_230_16 :
    Uω (aρ 16) (bρ 16) (5470123807721 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_230 :
    Uρ (5470123807721 / 32000000000000 : ℝ) ≤
      (-(20680169497693025977507 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5470123807721 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(18049552413909734351791 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5470123807721 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(727941925252781587649 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5470123807721 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(9253099115622933870931 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5470123807721 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(952445459756741781521 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5470123807721 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(19968271182064297647983 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5470123807721 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(10783808568520747034887 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5470123807721 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6221803565729163471369 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5470123807721 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5470123807721 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5470123807721 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5470123807721 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5470123807721 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5470123807721 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5470123807721 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5470123807721 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5470123807721 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_230_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_231_1 :
    Uω (aρ 1) (bρ 1) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(17995755805428837382471 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2645904944750921 / 16000000000000000 : ℝ) ≤
      (-(17995755805428837382471 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2645904944750921 / 16000000000000000 : ℝ) =
            (2645904944750921 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2645904944750921 / 2000000000000000 : ℝ) ≤
            (2798659603571162617529 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (330718565719949 / 2000000000000000 : ℝ)) (q :=
      (2645904944750921 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_231_2 :
    Uω (aρ 2) (bρ 2) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(4535981881318316691607 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13034945696058761 / 80000000000000000 : ℝ) ≤
      (-(4535981881318316691607 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13034945696058761 / 80000000000000000 : ℝ) =
            (13034945696058761 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13034945696058761 / 10000000000000000 : ℝ) ≤
            (662621970931683308393 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (203589635523223 / 1250000000000000 : ℝ)) (q :=
      (13034945696058761 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_231_3 :
    Uω (aρ 3) (bρ 3) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(2306226839652172024137 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12642259898452369 / 80000000000000000 : ℝ) ≤
      (-(2306226839652172024137 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12642259898452369 / 80000000000000000 : ℝ) =
            (12642259898452369 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12642259898452369 / 10000000000000000 : ℝ) ≤
            (293075086472827975863 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (788970870567093 / 5000000000000000 : ℝ)) (q :=
      (12642259898452369 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_231_4 :
    Uω (aρ 4) (bρ 4) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(18989197817517969399161 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11978421852225553 / 80000000000000000 : ℝ) ≤
      (-(18989197817517969399161 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11978421852225553 / 80000000000000000 : ℝ) =
            (11978421852225553 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11978421852225553 / 10000000000000000 : ℝ) ≤
            (1805217591482030600839 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (745138205321241 / 5000000000000000 : ℝ)) (q :=
      (11978421852225553 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_231_5 :
    Uω (aρ 5) (bρ 5) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(19902191349902427008359 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10933237909604261 / 80000000000000000 : ℝ) ≤
      (-(19902191349902427008359 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10933237909604261 / 80000000000000000 : ℝ) =
            (10933237909604261 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10933237909604261 / 10000000000000000 : ℝ) ≤
            (892224059097572991641 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1347170344322159 / 10000000000000000 : ℝ)) (q :=
      (10933237909604261 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_231_6 :
    Uω (aρ 6) (bρ 6) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(10743802233008661327371 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9330290840908217 / 80000000000000000 : ℝ) ≤
      (-(10743802233008661327371 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (9330290840908217 / 80000000000000000 : ℝ) =
            (9330290840908217 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9330290840908217 / 5000000000000000 : ℝ) ≤
            (3119141372991338672629 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (278418488072037 / 2500000000000000 : ℝ)) (q :=
      (9330290840908217 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_231_7 :
    Uω (aρ 7) (bρ 7) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(12378411562319641158947 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1345689348787241 / 16000000000000000 : ℝ) ≤
      (-(12378411562319641158947 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1345689348787241 / 16000000000000000 : ℝ) =
            (1345689348787241 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1345689348787241 / 1000000000000000 : ℝ) ≤
            (1484532043680358841053 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (137374861761029 / 2000000000000000 : ℝ)) (q :=
      (1345689348787241 / 16000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_231_8 :
    Uω (aρ 8) (bρ 8) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_231_9 :
    Uω (aρ 9) (bρ 9) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_231_10 :
    Uω (aρ 10) (bρ 10) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_231_11 :
    Uω (aρ 11) (bρ 11) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_231_12 :
    Uω (aρ 12) (bρ 12) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_231_13 :
    Uω (aρ 13) (bρ 13) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_231_14 :
    Uω (aρ 14) (bρ 14) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_231_15 :
    Uω (aρ 15) (bρ 15) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_231_16 :
    Uω (aρ 16) (bρ 16) (10997027650713 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_231 :
    Uρ (10997027650713 / 64000000000000 : ℝ) ≤
      (-(4130032091383163246483 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10997027650713 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(17995755805428837382471 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10997027650713 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4535981881318316691607 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10997027650713 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2306226839652172024137 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10997027650713 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18989197817517969399161 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10997027650713 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(19902191349902427008359 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10997027650713 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(10743802233008661327371 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10997027650713 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12378411562319641158947 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10997027650713 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10997027650713 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10997027650713 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10997027650713 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10997027650713 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10997027650713 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10997027650713 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10997027650713 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10997027650713 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_231_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
