/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U19) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_232_1 :
    Uω (aρ 1) (bρ 1) (345431490187 / 2000000000000 : ℝ) ≤
      (-(1121390443150977258413 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (415640748173641 / 2500000000000000 : ℝ) ≤
      (-(1121390443150977258413 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (415640748173641 / 2500000000000000 : ℝ) =
            (415640748173641 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (415640748173641 / 312500000000000 : ℝ) ≤
            (178260519911522741587 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (207808219067391 / 1250000000000000 : ℝ)) (q :=
      (415640748173641 / 2500000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_232_2 :
    Uω (aρ 2) (bρ 2) (345431490187 / 2000000000000 : ℝ) ≤
      (-(113060024226724001509 / 62500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3276487240184307 / 20000000000000000 : ℝ) ≤
      (-(113060024226724001509 / 62500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3276487240184307 / 20000000000000000 : ℝ) =
            (3276487240184307 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3276487240184307 / 2500000000000000 : ℝ) ≤
            (16905072079525998491 / 62500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1637596019844307 / 10000000000000000 : ℝ)) (q :=
      (3276487240184307 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_232_3 :
    Uω (aρ 3) (bρ 3) (345431490187 / 2000000000000 : ℝ) ≤
      (-(3678749652860036091943 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3178334909659493 / 20000000000000000 : ℝ) ≤
      (-(3678749652860036091943 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3178334909659493 / 20000000000000000 : ℝ) =
            (3178334909659493 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3178334909659493 / 2500000000000000 : ℝ) ≤
            (480133428939963908057 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1586839795669493 / 10000000000000000 : ℝ)) (q :=
      (3178334909659493 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_232_4 :
    Uω (aρ 4) (bρ 4) (345431490187 / 2000000000000 : ℝ) ≤
      (-(18929844191670132660891 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3012432384564809 / 20000000000000000 : ℝ) ≤
      (-(18929844191670132660891 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3012432384564809 / 20000000000000000 : ℝ) =
            (3012432384564809 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3012432384564809 / 2500000000000000 : ℝ) ≤
            (1864571217329867339109 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1499231451639809 / 10000000000000000 : ℝ)) (q :=
      (3012432384564809 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_232_5 :
    Uω (aρ 5) (bρ 5) (345431490187 / 2000000000000 : ℝ) ≤
      (-(4959139442762577320171 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2751308167021261 / 20000000000000000 : ℝ) ≤
      (-(4959139442762577320171 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2751308167021261 / 20000000000000000 : ℝ) =
            (2751308167021261 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2751308167021261 / 2500000000000000 : ℝ) ≤
            (239464409487422679829 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1356297153431261 / 10000000000000000 : ℝ)) (q :=
      (2751308167021261 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_232_6 :
    Uω (aρ 6) (bρ 6) (345431490187 / 2000000000000 : ℝ) ≤
      (-(5352071603001420085127 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (587786948158219 / 5000000000000000 : ℝ) ≤
      (-(5352071603001420085127 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (587786948158219 / 5000000000000000 : ℝ) =
            (587786948158219 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (587786948158219 / 312500000000000 : ℝ) ≤
            (1579400199998579914873 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (280844288545719 / 2500000000000000 : ℝ)) (q :=
      (587786948158219 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_232_7 :
    Uω (aρ 7) (bρ 7) (345431490187 / 2000000000000 : ℝ) ≤
      (-(1539303126159486415141 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (212972065231627 / 2500000000000000 : ℝ) ≤
      (-(1539303126159486415141 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (212972065231627 / 2500000000000000 : ℝ) =
            (212972065231627 / 156250000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (212972065231627 / 156250000000000 : ℝ) ≤
            (193564824590513584859 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (87458408020377 / 1250000000000000 : ℝ)) (q :=
      (212972065231627 / 2500000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_232_8 :
    Uω (aρ 8) (bρ 8) (345431490187 / 2000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_232_9 :
    Uω (aρ 9) (bρ 9) (345431490187 / 2000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_232_10 :
    Uω (aρ 10) (bρ 10) (345431490187 / 2000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_232_11 :
    Uω (aρ 11) (bρ 11) (345431490187 / 2000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_232_12 :
    Uω (aρ 12) (bρ 12) (345431490187 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_232_13 :
    Uω (aρ 13) (bρ 13) (345431490187 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_232_14 :
    Uω (aρ 14) (bρ 14) (345431490187 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_232_15 :
    Uω (aρ 15) (bρ 15) (345431490187 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_232_16 :
    Uω (aρ 16) (bρ 16) (345431490187 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_232 :
    Uρ (345431490187 / 2000000000000 : ℝ) ≤
      (-(20620488410529718411491 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (345431490187 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1121390443150977258413 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (345431490187 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) * (-(113060024226724001509 / 62500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (345431490187 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3678749652860036091943 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (345431490187 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18929844191670132660891 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (345431490187 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4959139442762577320171 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (345431490187 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5352071603001420085127 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (345431490187 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1539303126159486415141 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (345431490187 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (345431490187 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (345431490187 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (345431490187 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (345431490187 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (345431490187 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (345431490187 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (345431490187 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (345431490187 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_232_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_233_1 :
    Uω (aρ 1) (bρ 1) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(17836081128313023247777 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6721231122461949 / 40000000000000000 : ℝ) ≤
      (-(17836081128313023247777 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6721231122461949 / 40000000000000000 : ℝ) =
            (6721231122461949 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6721231122461949 / 5000000000000000 : ℝ) ≤
            (2958334280686976752223 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1680211567358787 / 10000000000000000 : ℝ)) (q :=
      (6721231122461949 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_233_2 :
    Uω (aρ 2) (bρ 2) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(17981834645297691005227 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6623977291121299 / 40000000000000000 : ℝ) ≤
      (-(17981834645297691005227 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6623977291121299 / 40000000000000000 : ℝ) =
            (6623977291121299 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6623977291121299 / 5000000000000000 : ℝ) ≤
            (2812580763702308994773 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (827676832099231 / 5000000000000000 : ℝ)) (q :=
      (6623977291121299 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_233_3 :
    Uω (aρ 3) (bρ 3) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(3656510475313698243173 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6427747820377973 / 40000000000000000 : ℝ) ≤
      (-(3656510475313698243173 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6427747820377973 / 40000000000000000 : ℝ) =
            (6427747820377973 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6427747820377973 / 5000000000000000 : ℝ) ≤
            (502372606486301756827 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1604635035176799 / 10000000000000000 : ℝ)) (q :=
      (6427747820377973 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_233_4 :
    Uω (aρ 4) (bρ 4) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(2351524134012850285883 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6096166592176123 / 40000000000000000 : ℝ) ≤
      (-(2351524134012850285883 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6096166592176123 / 40000000000000000 : ℝ) =
            (6096166592176123 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6096166592176123 / 5000000000000000 : ℝ) ≤
            (247777792112149714117 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (758569301070437 / 5000000000000000 : ℝ)) (q :=
      (6096166592176123 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_233_5 :
    Uω (aρ 5) (bρ 5) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(9853302452241801719929 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5574591063881861 / 40000000000000000 : ℝ) ≤
      (-(9853302452241801719929 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5574591063881861 / 40000000000000000 : ℝ) =
            (5574591063881861 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5574591063881861 / 5000000000000000 : ℝ) ≤
            (543905252258198280071 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1374540757328743 / 10000000000000000 : ℝ)) (q :=
      (5574591063881861 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_233_6 :
    Uω (aρ 6) (bρ 6) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(425033657159668721931 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4776514838449023 / 40000000000000000 : ℝ) ≤
      (-(425033657159668721931 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4776514838449023 / 40000000000000000 : ℝ) =
            (4776514838449023 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4776514838449023 / 2500000000000000 : ℝ) ≤
            (129484087080331278069 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (285685754938081 / 2500000000000000 : ℝ)) (q :=
      (4776514838449023 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_233_7 :
    Uω (aρ 7) (bρ 7) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(24379726540844704730177 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (139740377295619 / 1600000000000000 : ℝ) ≤
      (-(24379726540844704730177 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (139740377295619 / 1600000000000000 : ℝ) =
            (139740377295619 / 100000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (139740377295619 / 100000000000000 : ℝ) ≤
            (3346160671155295269823 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (14498033949661 / 200000000000000 : ℝ)) (q :=
      (139740377295619 / 1600000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_233_8 :
    Uω (aρ 8) (bρ 8) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_233_9 :
    Uω (aρ 9) (bρ 9) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_233_10 :
    Uω (aρ 10) (bρ 10) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_233_11 :
    Uω (aρ 11) (bρ 11) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_233_12 :
    Uω (aρ 12) (bρ 12) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_233_13 :
    Uω (aρ 13) (bρ 13) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_233_14 :
    Uω (aρ 14) (bρ 14) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_233_15 :
    Uω (aρ 15) (bρ 15) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_233_16 :
    Uω (aρ 16) (bρ 16) (5583683878263 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_233 :
    Uρ (5583683878263 / 32000000000000 : ℝ) ≤
      (-(10281055425697362557601 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5583683878263 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(17836081128313023247777 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5583683878263 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(17981834645297691005227 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5583683878263 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3656510475313698243173 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5583683878263 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2351524134012850285883 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5583683878263 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9853302452241801719929 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5583683878263 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(425033657159668721931 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5583683878263 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(24379726540844704730177 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5583683878263 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5583683878263 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5583683878263 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5583683878263 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5583683878263 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5583683878263 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5583683878263 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5583683878263 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5583683878263 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_233_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_234_1 :
    Uω (aρ 1) (bρ 1) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(4432757645883601178647 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (212256568384107 / 1250000000000000 : ℝ) ≤
      (-(4432757645883601178647 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (212256568384107 / 1250000000000000 : ℝ) =
            (212256568384107 / 156250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (212256568384107 / 156250000000000 : ℝ) ≤
            (765846206366398821353 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1697957339251337 / 10000000000000000 : ℝ)) (q :=
      (212256568384107 / 1250000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_234_2 :
    Uω (aρ 2) (bρ 2) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(17875215342854461799939 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (836872439087349 / 5000000000000000 : ℝ) ≤
      (-(17875215342854461799939 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (836872439087349 / 5000000000000000 : ℝ) =
            (836872439087349 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (836872439087349 / 625000000000000 : ℝ) ≤
            (2919200066145538200061 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1673111013965021 / 10000000000000000 : ℝ)) (q :=
      (836872439087349 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_234_3 :
    Uω (aρ 3) (bρ 3) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(9086291413154191049523 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3249411783092489 / 20000000000000000 : ℝ) ≤
      (-(9086291413154191049523 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3249411783092489 / 20000000000000000 : ℝ) =
            (3249411783092489 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3249411783092489 / 2500000000000000 : ℝ) ≤
            (1310916291345808950477 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (811214573529057 / 5000000000000000 : ℝ)) (q :=
      (3249411783092489 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_234_4 :
    Uω (aρ 4) (bρ 4) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(4673980589084799832807 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3083730412941973 / 20000000000000000 : ℝ) ≤
      (-(4673980589084799832807 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3083730412941973 / 20000000000000000 : ℝ) =
            (3083730412941973 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3083730412941973 / 2500000000000000 : ℝ) ≤
            (524623263165200167193 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (767520978986299 / 5000000000000000 : ℝ)) (q :=
      (3083730412941973 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_234_5 :
    Uω (aρ 5) (bρ 5) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(19578364916448394077517 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (352908747705531 / 2500000000000000 : ℝ) ≤
      (-(19578364916448394077517 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (352908747705531 / 2500000000000000 : ℝ) =
            (352908747705531 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (352908747705531 / 312500000000000 : ℝ) ≤
            (1216050492551605922483 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1392771446009873 / 10000000000000000 : ℝ)) (q :=
      (352908747705531 / 2500000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_234_6 :
    Uω (aρ 6) (bρ 6) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(21097707582265118210857 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2425315245992213 / 20000000000000000 : ℝ) ≤
      (-(21097707582265118210857 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2425315245992213 / 20000000000000000 : ℝ) =
            (2425315245992213 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2425315245992213 / 1250000000000000 : ℝ) ≤
            (6628179629734881789143 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (581028542748919 / 5000000000000000 : ℝ)) (q :=
      (2425315245992213 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_234_7 :
    Uω (aρ 7) (bρ 7) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(24139057684859532006813 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1789303618169693 / 20000000000000000 : ℝ) ≤
      (-(24139057684859532006813 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1789303618169693 / 20000000000000000 : ℝ) =
            (1789303618169693 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1789303618169693 / 1250000000000000 : ℝ) ≤
            (3586829527140467993187 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (374853419217659 / 5000000000000000 : ℝ)) (q :=
      (1789303618169693 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_234_8 :
    Uω (aρ 8) (bρ 8) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_234_9 :
    Uω (aρ 9) (bρ 9) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_234_10 :
    Uω (aρ 10) (bρ 10) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_234_11 :
    Uω (aρ 11) (bρ 11) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_234_12 :
    Uω (aρ 12) (bρ 12) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_234_13 :
    Uω (aρ 13) (bρ 13) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_234_14 :
    Uω (aρ 14) (bρ 14) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_234_15 :
    Uω (aρ 15) (bρ 15) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_234_16 :
    Uω (aρ 16) (bρ 16) (2820231956767 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_234 :
    Uρ (2820231956767 / 16000000000000 : ℝ) ≤
      (-(20504954889210252469137 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2820231956767 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4432757645883601178647 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2820231956767 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(17875215342854461799939 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2820231956767 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(9086291413154191049523 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2820231956767 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4673980589084799832807 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2820231956767 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(19578364916448394077517 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2820231956767 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(21097707582265118210857 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2820231956767 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(24139057684859532006813 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2820231956767 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2820231956767 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2820231956767 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2820231956767 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2820231956767 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2820231956767 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2820231956767 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2820231956767 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2820231956767 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_234_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_235_1 :
    Uω (aρ 1) (bρ 1) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(17627072259042377358077 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6863189170930689 / 40000000000000000 : ℝ) ≤
      (-(17627072259042377358077 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6863189170930689 / 40000000000000000 : ℝ) =
            (6863189170930689 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6863189170930689 / 5000000000000000 : ℝ) ≤
            (3167343149957622641923 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (857851534774391 / 5000000000000000 : ℝ)) (q :=
      (6863189170930689 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_235_2 :
    Uω (aρ 2) (bρ 2) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(17769721669487918798127 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6765981163663493 / 40000000000000000 : ℝ) ≤
      (-(17769721669487918798127 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6765981163663493 / 40000000000000000 : ℝ) =
            (6765981163663493 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6765981163663493 / 5000000000000000 : ℝ) ≤
            (3024693739512081201873 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (52839627450787 / 312500000000000 : ℝ)) (q :=
      (6765981163663493 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_235_3 :
    Uω (aρ 3) (bρ 3) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(18063812784732552797297 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6569897130138973 / 40000000000000000 : ℝ) ≤
      (-(18063812784732552797297 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6569897130138973 / 40000000000000000 : ℝ) =
            (6569897130138973 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6569897130138973 / 5000000000000000 : ℝ) ≤
            (2730602624267447202703 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (410055542003231 / 2500000000000000 : ℝ)) (q :=
      (6569897130138973 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_235_4 :
    Uω (aρ 4) (bρ 4) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(18580999749485371987611 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6238747732738101 / 40000000000000000 : ℝ) ≤
      (-(18580999749485371987611 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6238747732738101 / 40000000000000000 : ℝ) =
            (6238747732738101 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6238747732738101 / 5000000000000000 : ℝ) ≤
            (2213415659514628012389 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (97058853148593 / 625000000000000 : ℝ)) (q :=
      (6238747732738101 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_235_5 :
    Uω (aρ 5) (bρ 5) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(19451792096157150090147 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5718464033488703 / 40000000000000000 : ℝ) ≤
      (-(19451792096157150090147 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5718464033488703 / 40000000000000000 : ℝ) =
            (5718464033488703 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5718464033488703 / 5000000000000000 : ℝ) ≤
            (1342623312842849909853 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1410989720087789 / 10000000000000000 : ℝ)) (q :=
      (5718464033488703 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_235_6 :
    Uω (aρ 6) (bρ 6) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(20946267287668847085137 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4924647627296189 / 40000000000000000 : ℝ) ≤
      (-(20946267287668847085137 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4924647627296189 / 40000000000000000 : ℝ) =
            (4924647627296189 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4924647627296189 / 2500000000000000 : ℝ) ≤
            (6779619924331152914863 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (295330473032883 / 2500000000000000 : ℝ)) (q :=
      (4924647627296189 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_235_7 :
    Uω (aρ 7) (bρ 7) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(23906163545953218465999 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3662928992268993 / 40000000000000000 : ℝ) ≤
      (-(23906163545953218465999 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3662928992268993 / 40000000000000000 : ℝ) =
            (3662928992268993 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3662928992268993 / 2500000000000000 : ℝ) ≤
            (3819723666046781534001 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (387061977688967 / 5000000000000000 : ℝ)) (q :=
      (3662928992268993 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_235_8 :
    Uω (aρ 8) (bρ 8) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_235_9 :
    Uω (aρ 9) (bρ 9) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_235_10 :
    Uω (aρ 10) (bρ 10) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_235_11 :
    Uω (aρ 11) (bρ 11) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_235_12 :
    Uω (aρ 12) (bρ 12) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_235_13 :
    Uω (aρ 13) (bρ 13) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_235_14 :
    Uω (aρ 14) (bρ 14) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_235_15 :
    Uω (aρ 15) (bρ 15) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_235_16 :
    Uω (aρ 16) (bρ 16) (1139448789761 / 6400000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_235 :
    Uρ (1139448789761 / 6400000000000 : ℝ) ≤
      (-(1278059270240595681709 / 625000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1139448789761 / 6400000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(17627072259042377358077 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1139448789761 / 6400000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(17769721669487918798127 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1139448789761 / 6400000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(18063812784732552797297 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1139448789761 / 6400000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18580999749485371987611 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1139448789761 / 6400000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(19451792096157150090147 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1139448789761 / 6400000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(20946267287668847085137 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1139448789761 / 6400000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(23906163545953218465999 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1139448789761 / 6400000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1139448789761 / 6400000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1139448789761 / 6400000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1139448789761 / 6400000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1139448789761 / 6400000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1139448789761 / 6400000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1139448789761 / 6400000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1139448789761 / 6400000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1139448789761 / 6400000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_235_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_236_1 :
    Uω (aρ 1) (bρ 1) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(3504836734814087840143 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3467084036467329 / 20000000000000000 : ℝ) ≤
      (-(3504836734814087840143 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3467084036467329 / 20000000000000000 : ℝ) =
            (3467084036467329 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3467084036467329 / 2500000000000000 : ℝ) ≤
            (654046346985912159857 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1733448759528579 / 10000000000000000 : ℝ)) (q :=
      (3467084036467329 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_236_2 :
    Uω (aρ 2) (bρ 2) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(8832665044234793364127 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (341849113090293 / 2000000000000000 : ℝ) ≤
      (-(8832665044234793364127 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (341849113090293 / 2000000000000000 : ℝ) =
            (341849113090293 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (341849113090293 / 250000000000000 : ℝ) ≤
            (1564542660265206635873 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (85431243323709 / 500000000000000 : ℝ)) (q :=
      (341849113090293 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_236_3 :
    Uω (aρ 3) (bρ 3) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(561131759258713630229 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3320484291241897 / 20000000000000000 : ℝ) ≤
      (-(561131759258713630229 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3320484291241897 / 20000000000000000 : ℝ) =
            (3320484291241897 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3320484291241897 / 2500000000000000 : ℝ) ≤
            (88693722272536369771 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1658014133163147 / 10000000000000000 : ℝ)) (q :=
      (3320484291241897 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_236_4 :
    Uω (aρ 4) (bρ 4) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(18467394086119095410203 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3155013781603513 / 20000000000000000 : ℝ) ≤
      (-(18467394086119095410203 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3155013781603513 / 20000000000000000 : ℝ) =
            (3155013781603513 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3155013781603513 / 2500000000000000 : ℝ) ≤
            (2327021322880904589797 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1570837804589763 / 10000000000000000 : ℝ)) (q :=
      (3155013781603513 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_236_5 :
    Uω (aρ 5) (bρ 5) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(19326842580294766154441 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (289518211199629 / 2000000000000000 : ℝ) ≤
      (-(19326842580294766154441 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (289518211199629 / 2000000000000000 : ℝ) =
            (289518211199629 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (289518211199629 / 250000000000000 : ℝ) ≤
            (1467572828705233845559 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (71459802715877 / 500000000000000 : ℝ)) (q :=
      (289518211199629 / 2000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_236_6 :
    Uω (aρ 6) (bρ 6) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(4159454768142052679751 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (624821373386481 / 5000000000000000 : ℝ) ≤
      (-(4159454768142052679751 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (624821373386481 / 5000000000000000 : ℝ) =
            (624821373386481 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (624821373386481 / 312500000000000 : ℝ) ≤
            (1385722674257947320249 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (600269905503587 / 5000000000000000 : ℝ)) (q :=
      (624821373386481 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_236_7 :
    Uω (aρ 7) (bρ 7) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(23680451252261213551871 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58539780019197 / 625000000000000 : ℝ) ≤
      (-(23680451252261213551871 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (58539780019197 / 625000000000000 : ℝ) = (58539780019197 / 39062500000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58539780019197 / 39062500000000 : ℝ) ≤
            (4045435959738786448129 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (399094329417777 / 5000000000000000 : ℝ)) (q :=
      (58539780019197 / 625000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_236_8 :
    Uω (aρ 8) (bρ 8) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_236_9 :
    Uω (aρ 9) (bρ 9) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_236_10 :
    Uω (aρ 10) (bρ 10) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_236_11 :
    Uω (aρ 11) (bρ 11) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_236_12 :
    Uω (aρ 12) (bρ 12) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_236_13 :
    Uω (aρ 13) (bρ 13) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_236_14 :
    Uω (aρ 14) (bρ 14) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_236_15 :
    Uω (aρ 15) (bρ 15) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_236_16 :
    Uω (aρ 16) (bρ 16) (1438505996019 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_236 :
    Uρ (1438505996019 / 8000000000000 : ℝ) ≤
      (-(815761080340562607109 / 400000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1438505996019 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3504836734814087840143 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1438505996019 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(8832665044234793364127 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1438505996019 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(561131759258713630229 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1438505996019 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18467394086119095410203 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1438505996019 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(19326842580294766154441 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1438505996019 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4159454768142052679751 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1438505996019 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(23680451252261213551871 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1438505996019 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1438505996019 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1438505996019 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1438505996019 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1438505996019 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1438505996019 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1438505996019 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1438505996019 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1438505996019 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_236_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_237_1 :
    Uω (aρ 1) (bρ 1) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(216519115091196781593 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1769031411185933 / 10000000000000000 : ℝ) ≤
      (-(216519115091196781593 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1769031411185933 / 10000000000000000 : ℝ) =
            (1769031411185933 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1769031411185933 / 1250000000000000 : ℝ) ≤
            (43411077521303218407 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1768940023388741 / 10000000000000000 : ℝ)) (q :=
      (1769031411185933 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_237_2 :
    Uω (aρ 2) (bρ 2) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(545617583817240004993 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1744745716790423 / 10000000000000000 : ℝ) ≤
      (-(545617583817240004993 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1744745716790423 / 10000000000000000 : ℝ) =
            (1744745716790423 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1744745716790423 / 1250000000000000 : ℝ) ≤
            (104207897714009995007 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1744137647107721 / 10000000000000000 : ℝ)) (q :=
      (1744745716790423 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_237_3 :
    Uω (aρ 3) (bρ 3) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(17744444299101173343339 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (847888177317829 / 5000000000000000 : ℝ) ≤
      (-(17744444299101173343339 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (847888177317829 / 5000000000000000 : ℝ) =
            (847888177317829 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (847888177317829 / 625000000000000 : ℝ) ≤
            (3049971109898826656661 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1693595029148191 / 10000000000000000 : ℝ)) (q :=
      (847888177317829 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_237_4 :
    Uω (aρ 4) (bρ 4) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(18244014263751742130657 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3226283470414801 / 20000000000000000 : ℝ) ≤
      (-(18244014263751742130657 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3226283470414801 / 20000000000000000 : ℝ) =
            (3226283470414801 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3226283470414801 / 2500000000000000 : ℝ) ≤
            (2550401145248257869343 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (401654992839169 / 2500000000000000 : ℝ)) (q :=
      (3226283470414801 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_237_5 :
    Uω (aρ 5) (bρ 5) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(9540823325732590924141 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2967048262560857 / 20000000000000000 : ℝ) ≤
      (-(9540823325732590924141 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2967048262560857 / 20000000000000000 : ℝ) =
            (2967048262560857 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2967048262560857 / 2500000000000000 : ℝ) ≤
            (856384378767409075859 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (366393670709433 / 2500000000000000 : ℝ)) (q :=
      (2967048262560857 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_237_6 :
    Uω (aρ 6) (bρ 6) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(20506298475419563252639 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2573076913092093 / 20000000000000000 : ℝ) ≤
      (-(20506298475419563252639 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2573076913092093 / 20000000000000000 : ℝ) =
            (2573076913092093 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2573076913092093 / 2500000000000000 : ℝ) ≤
            (288116933580436747361 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (154855463563621 / 1250000000000000 : ℝ)) (q :=
      (2573076913092093 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_237_7 :
    Uω (aρ 7) (bρ 7) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(2906068668546487972029 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1955952598996313 / 20000000000000000 : ℝ) ≤
      (-(2906068668546487972029 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1955952598996313 / 20000000000000000 : ℝ) =
            (1955952598996313 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1955952598996313 / 1250000000000000 : ℝ) ≤
            (559667232953512027971 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (211345193793297 / 2500000000000000 : ℝ)) (q :=
      (1955952598996313 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_237_8 :
    Uω (aρ 8) (bρ 8) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_237_9 :
    Uω (aρ 9) (bρ 9) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_237_10 :
    Uω (aρ 10) (bρ 10) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_237_11 :
    Uω (aρ 11) (bρ 11) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_237_12 :
    Uω (aρ 12) (bρ 12) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_237_13 :
    Uω (aρ 13) (bρ 13) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_237_14 :
    Uω (aρ 14) (bρ 14) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_237_15 :
    Uω (aρ 15) (bρ 15) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_237_16 :
    Uω (aρ 16) (bρ 16) (2933792027309 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_237 :
    Uρ (2933792027309 / 16000000000000 : ℝ) ≤
      (-(10143608103708137941839 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2933792027309 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(216519115091196781593 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2933792027309 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(545617583817240004993 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2933792027309 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(17744444299101173343339 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2933792027309 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(18244014263751742130657 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2933792027309 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9540823325732590924141 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2933792027309 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(20506298475419563252639 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2933792027309 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2906068668546487972029 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2933792027309 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2933792027309 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2933792027309 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2933792027309 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2933792027309 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2933792027309 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2933792027309 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2933792027309 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2933792027309 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_237_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_238_1 :
    Uω (aρ 1) (bρ 1) (149528603129 / 800000000000 : ℝ) ≤
      (-(17122900589309473870993 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3609041461089001 / 20000000000000000 : ℝ) ≤
      (-(17122900589309473870993 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3609041461089001 / 20000000000000000 : ℝ) =
            (3609041461089001 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3609041461089001 / 2500000000000000 : ℝ) ≤
            (3671514819690526129007 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1804431140061501 / 10000000000000000 : ℝ)) (q :=
      (3609041461089001 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_238_2 :
    Uω (aρ 2) (bρ 2) (149528603129 / 800000000000 : ℝ) ≤
      (-(8629169461557259480653 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (712098145710151 / 4000000000000000 : ℝ) ≤
      (-(8629169461557259480653 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (712098145710151 / 4000000000000000 : ℝ) =
            (712098145710151 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (712098145710151 / 500000000000000 : ℝ) ≤
            (1768038242942740519347 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (355929884006651 / 2000000000000000 : ℝ)) (q :=
      (712098145710151 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_238_3 :
    Uω (aρ 3) (bρ 3) (149528603129 / 800000000000 : ℝ) ≤
      (-(3507415055125305177593 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3462617289665989 / 20000000000000000 : ℝ) ≤
      (-(3507415055125305177593 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3462617289665989 / 20000000000000000 : ℝ) =
            (3462617289665989 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3462617289665989 / 2500000000000000 : ℝ) ≤
            (651468026674694822407 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1729172087498489 / 10000000000000000 : ℝ)) (q :=
      (3462617289665989 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_238_4 :
    Uω (aρ 4) (bρ 4) (149528603129 / 800000000000 : ℝ) ≤
      (-(3605110847146402910907 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (103048136671579 / 625000000000000 : ℝ) ≤
      (-(3605110847146402910907 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (103048136671579 / 625000000000000 : ℝ) = (103048136671579 / 78125000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (103048136671579 / 78125000000000 : ℝ) ≤
            (553772234653597089093 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (410597338097007 / 2500000000000000 : ℝ)) (q :=
      (103048136671579 / 625000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_238_5 :
    Uω (aρ 5) (bρ 5) (149528603129 / 800000000000 : ℝ) ≤
      (-(9421229765333016833399 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1519435887224519 / 10000000000000000 : ℝ) ≤
      (-(9421229765333016833399 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1519435887224519 / 10000000000000000 : ℝ) =
            (1519435887224519 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1519435887224519 / 1250000000000000 : ℝ) ≤
            (975977939166983166601 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (750955336340769 / 5000000000000000 : ℝ)) (q :=
      (1519435887224519 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_238_6 :
    Uω (aρ 6) (bρ 6) (149528603129 / 800000000000 : ℝ) ≤
      (-(20224165771428923170819 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1323352798439857 / 10000000000000000 : ℝ) ≤
      (-(20224165771428923170819 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1323352798439857 / 10000000000000000 : ℝ) =
            (1323352798439857 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1323352798439857 / 1250000000000000 : ℝ) ≤
            (570249637571076829181 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (638492435126107 / 5000000000000000 : ℝ)) (q :=
      (1323352798439857 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_238_7 :
    Uω (aρ 7) (bρ 7) (149528603129 / 800000000000 : ℝ) ≤
      (-(22839854558538710203403 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2037547373500423 / 20000000000000000 : ℝ) ≤
      (-(22839854558538710203403 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2037547373500423 / 20000000000000000 : ℝ) =
            (2037547373500423 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2037547373500423 / 1250000000000000 : ℝ) ≤
            (4886032653461289796597 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (891488027632923 / 10000000000000000 : ℝ)) (q :=
      (2037547373500423 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_238_8 :
    Uω (aρ 8) (bρ 8) (149528603129 / 800000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_238_9 :
    Uω (aρ 9) (bρ 9) (149528603129 / 800000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_238_10 :
    Uω (aρ 10) (bρ 10) (149528603129 / 800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_238_11 :
    Uω (aρ 11) (bρ 11) (149528603129 / 800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_238_12 :
    Uω (aρ 12) (bρ 12) (149528603129 / 800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_238_13 :
    Uω (aρ 13) (bρ 13) (149528603129 / 800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_238_14 :
    Uω (aρ 14) (bρ 14) (149528603129 / 800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_238_15 :
    Uω (aρ 15) (bρ 15) (149528603129 / 800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_238_16 :
    Uω (aρ 16) (bρ 16) (149528603129 / 800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_238 :
    Uρ (149528603129 / 800000000000 : ℝ) ≤
      (-(10092063400161778436219 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (149528603129 / 800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(17122900589309473870993 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (149528603129 / 800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(8629169461557259480653 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (149528603129 / 800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3507415055125305177593 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (149528603129 / 800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3605110847146402910907 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (149528603129 / 800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9421229765333016833399 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (149528603129 / 800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(20224165771428923170819 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (149528603129 / 800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(22839854558538710203403 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (149528603129 / 800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (149528603129 / 800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (149528603129 / 800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (149528603129 / 800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (149528603129 / 800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (149528603129 / 800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (149528603129 / 800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (149528603129 / 800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (149528603129 / 800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_238_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_239_1 :
    Uω (aρ 1) (bρ 1) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(423203524096555888311 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (736003992227247 / 4000000000000000 : ℝ) ≤
      (-(423203524096555888311 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (736003992227247 / 4000000000000000 : ℝ) =
            (736003992227247 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (736003992227247 / 500000000000000 : ℝ) ≤
            (96656861128444111689 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (45998052951609 / 250000000000000 : ℝ)) (q :=
      (736003992227247 / 4000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_239_2 :
    Uω (aρ 2) (bρ 2) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(17060894951251626070951 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1815744537478511 / 10000000000000000 : ℝ) ≤
      (-(17060894951251626070951 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1815744537478511 / 10000000000000000 : ℝ) =
            (1815744537478511 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1815744537478511 / 1250000000000000 : ℝ) ≤
            (3733520457748373929049 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1815160244395147 / 10000000000000000 : ℝ)) (q :=
      (1815744537478511 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_239_3 :
    Uω (aρ 3) (bρ 3) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(3466785886107343843369 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3533678264524699 / 20000000000000000 : ℝ) ≤
      (-(3466785886107343843369 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3533678264524699 / 20000000000000000 : ℝ) =
            (3533678264524699 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3533678264524699 / 2500000000000000 : ℝ) ≤
            (692097195692656156631 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (220593192539103 / 1250000000000000 : ℝ)) (q :=
      (3533678264524699 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_239_4 :
    Uω (aρ 4) (bρ 4) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(17811800359939854210869 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1684392654203751 / 10000000000000000 : ℝ) ≤
      (-(17811800359939854210869 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1684392654203751 / 10000000000000000 : ℝ) =
            (1684392654203751 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1684392654203751 / 1250000000000000 : ℝ) ≤
            (2982615049060145789131 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1678146765260627 / 10000000000000000 : ℝ)) (q :=
      (1684392654203751 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_239_5 :
    Uω (aρ 5) (bρ 5) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(9304493713255353838983 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3110655669334747 / 20000000000000000 : ℝ) ≤
      (-(9304493713255353838983 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3110655669334747 / 20000000000000000 : ℝ) =
            (3110655669334747 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3110655669334747 / 2500000000000000 : ℝ) ≤
            (1092713991244646161017 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (192275880690359 / 1250000000000000 : ℝ)) (q :=
      (3110655669334747 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_239_6 :
    Uω (aρ 6) (bρ 6) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(19950321207062330984031 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2720185705526393 / 20000000000000000 : ℝ) ≤
      (-(19950321207062330984031 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2720185705526393 / 20000000000000000 : ℝ) =
            (2720185705526393 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2720185705526393 / 2500000000000000 : ℝ) ≤
            (844094201937669015969 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (657488728427259 / 5000000000000000 : ℝ)) (q :=
      (2720185705526393 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_239_7 :
    Uω (aρ 7) (bρ 7) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(22451573375701112560891 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84728700154133 / 800000000000000 : ℝ) ≤
      (-(22451573375701112560891 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (84728700154133 / 800000000000000 : ℝ) = (84728700154133 / 50000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84728700154133 / 50000000000000 : ℝ) ≤
            (5274313836298887439109 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (18733412718829 / 200000000000000 : ℝ)) (q :=
      (84728700154133 / 800000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_239_8 :
    Uω (aρ 8) (bρ 8) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_239_9 :
    Uω (aρ 9) (bρ 9) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_239_10 :
    Uω (aρ 10) (bρ 10) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_239_11 :
    Uω (aρ 11) (bρ 11) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_239_12 :
    Uω (aρ 12) (bρ 12) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_239_13 :
    Uω (aρ 13) (bρ 13) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_239_14 :
    Uω (aρ 14) (bρ 14) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_239_15 :
    Uω (aρ 15) (bρ 15) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_239_16 :
    Uω (aρ 16) (bρ 16) (3047352097851 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_239 :
    Uρ (3047352097851 / 16000000000000 : ℝ) ≤
      (-(20084431088609508863849 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3047352097851 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(423203524096555888311 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3047352097851 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(17060894951251626070951 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3047352097851 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3466785886107343843369 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3047352097851 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(17811800359939854210869 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3047352097851 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9304493713255353838983 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3047352097851 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(19950321207062330984031 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3047352097851 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(22451573375701112560891 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3047352097851 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3047352097851 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3047352097851 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3047352097851 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3047352097851 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3047352097851 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3047352097851 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3047352097851 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3047352097851 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_239_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_240_1 :
    Uω (aρ 1) (bρ 1) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(3347420493572264953999 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3750998330386281 / 20000000000000000 : ℝ) ≤
      (-(3347420493572264953999 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3750998330386281 / 20000000000000000 : ℝ) =
            (3750998330386281 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3750998330386281 / 2500000000000000 : ℝ) ≤
            (811462588227735046001 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1875412965270031 / 10000000000000000 : ℝ)) (q :=
      (3750998330386281 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_240_2 :
    Uω (aρ 2) (bρ 2) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(4216819111011872001949 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3702486527403017 / 20000000000000000 : ℝ) ≤
      (-(4216819111011872001949 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3702486527403017 / 20000000000000000 : ℝ) =
            (3702486527403017 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3702486527403017 / 2500000000000000 : ℝ) ≤
            (981784741238127998051 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1850670174796767 / 10000000000000000 : ℝ)) (q :=
      (3702486527403017 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_240_3 :
    Uω (aρ 3) (bρ 3) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(3426967557250234145729 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (144189433903157 / 800000000000000 : ℝ) ≤
      (-(3426967557250234145729 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (144189433903157 / 800000000000000 : ℝ) =
            (144189433903157 / 100000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (144189433903157 / 100000000000000 : ℝ) ≤
            (731915524549765854271 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (72012624052907 / 400000000000000 : ℝ)) (q :=
      (144189433903157 / 800000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_240_4 :
    Uω (aρ 4) (bρ 4) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(1100159544436690800209 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (430002378031337 / 2500000000000000 : ℝ) ≤
      (-(1100159544436690800209 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (430002378031337 / 2500000000000000 : ℝ) =
            (430002378031337 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (430002378031337 / 312500000000000 : ℝ) ≤
            (199491418625809199791 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (856946479529723 / 5000000000000000 : ℝ)) (q :=
      (430002378031337 / 2500000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_240_5 :
    Uω (aρ 5) (bρ 5) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(18380957992918669968001 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3182402687107411 / 20000000000000000 : ℝ) ≤
      (-(18380957992918669968001 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3182402687107411 / 20000000000000000 : ℝ) =
            (3182402687107411 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3182402687107411 / 2500000000000000 : ℝ) ≤
            (2413457416081330031999 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1574466541251161 / 10000000000000000 : ℝ)) (q :=
      (3182402687107411 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_240_6 :
    Uω (aρ 6) (bρ 6) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(3936852661578481560173 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1396764878355009 / 10000000000000000 : ℝ) ≤
      (-(3936852661578481560173 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1396764878355009 / 10000000000000000 : ℝ) =
            (1396764878355009 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1396764878355009 / 1250000000000000 : ℝ) ≤
            (222030420221518439827 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (169104248249221 / 1250000000000000 : ℝ)) (q :=
      (1396764878355009 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_240_7 :
    Uω (aρ 7) (bρ 7) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(5520357822357195670947 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2198090751996057 / 20000000000000000 : ℝ) ≤
      (-(5520357822357195670947 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2198090751996057 / 20000000000000000 : ℝ) =
            (2198090751996057 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2198090751996057 / 1250000000000000 : ℝ) ≤
            (1411113980642804329053 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (981056362039807 / 10000000000000000 : ℝ)) (q :=
      (2198090751996057 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_240_8 :
    Uω (aρ 8) (bρ 8) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_240_9 :
    Uω (aρ 9) (bρ 9) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_240_10 :
    Uω (aρ 10) (bρ 10) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_240_11 :
    Uω (aρ 11) (bρ 11) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_240_12 :
    Uω (aρ 12) (bρ 12) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_240_13 :
    Uω (aρ 13) (bρ 13) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_240_14 :
    Uω (aρ 14) (bρ 14) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_240_15 :
    Uω (aρ 15) (bρ 15) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_240_16 :
    Uω (aρ 16) (bρ 16) (1552066066561 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_240 :
    Uρ (1552066066561 / 8000000000000 : ℝ) ≤
      (-(4996963179176144483103 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1552066066561 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3347420493572264953999 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1552066066561 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4216819111011872001949 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1552066066561 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3426967557250234145729 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1552066066561 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1100159544436690800209 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1552066066561 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(18380957992918669968001 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1552066066561 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3936852661578481560173 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1552066066561 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5520357822357195670947 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1552066066561 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1552066066561 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1552066066561 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1552066066561 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1552066066561 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1552066066561 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1552066066561 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1552066066561 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1552066066561 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_240_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_241_1 :
    Uω (aρ 1) (bρ 1) (201105762729 / 1000000000000 : ℝ) ≤
      (-(8182819195849925653851 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3892954705114493 / 20000000000000000 : ℝ) ≤
      (-(8182819195849925653851 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3892954705114493 / 20000000000000000 : ℝ) =
            (3892954705114493 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3892954705114493 / 2500000000000000 : ℝ) ≤
            (2214388508650074346149 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1946394295909493 / 10000000000000000 : ℝ)) (q :=
      (3892954705114493 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_241_2 :
    Uω (aρ 2) (bρ 2) (201105762729 / 1000000000000 : ℝ) ≤
      (-(16490941930067749877633 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (768895789728329 / 4000000000000000 : ℝ) ≤
      (-(16490941930067749877633 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (768895789728329 / 4000000000000000 : ℝ) =
            (768895789728329 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (768895789728329 / 500000000000000 : ℝ) ≤
            (4303473478932250122367 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (384337510389329 / 2000000000000000 : ℝ)) (q :=
      (768895789728329 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_241_3 :
    Uω (aρ 3) (bρ 3) (201105762729 / 1000000000000 : ℝ) ≤
      (-(3349638049019418963313 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1873420805930339 / 10000000000000000 : ℝ) ≤
      (-(3349638049019418963313 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1873420805930339 / 10000000000000000 : ℝ) =
            (1873420805930339 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1873420805930339 / 1250000000000000 : ℝ) ≤
            (809245032780581036687 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (935723160757839 / 5000000000000000 : ℝ)) (q :=
      (1873420805930339 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_241_4 :
    Uω (aρ 4) (bρ 4) (201105762729 / 1000000000000 : ℝ) ≤
      (-(8598419076450674071003 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3582455494032877 / 20000000000000000 : ℝ) ≤
      (-(8598419076450674071003 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3582455494032877 / 20000000000000000 : ℝ) =
            (3582455494032877 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3582455494032877 / 2500000000000000 : ℝ) ≤
            (1798788628049325928997 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1785354384752877 / 10000000000000000 : ℝ)) (q :=
      (3582455494032877 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_241_5 :
    Uω (aρ 5) (bρ 5) (201105762729 / 1000000000000 : ℝ) ≤
      (-(17940232793488732042317 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3325795831955751 / 20000000000000000 : ℝ) ≤
      (-(17940232793488732042317 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3325795831955751 / 20000000000000000 : ℝ) =
            (3325795831955751 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3325795831955751 / 2500000000000000 : ℝ) ≤
            (2854182615511267957683 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1646884642010751 / 10000000000000000 : ℝ)) (q :=
      (3325795831955751 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_241_6 :
    Uω (aρ 6) (bρ 6) (201105762729 / 1000000000000 : ℝ) ≤
      (-(19173727179049642941211 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1469926462911759 / 10000000000000000 : ℝ) ≤
      (-(19173727179049642941211 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1469926462911759 / 10000000000000000 : ℝ) =
            (1469926462911759 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1469926462911759 / 1250000000000000 : ℝ) ≤
            (1620688229950357058789 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (714091055509259 / 5000000000000000 : ℝ)) (q :=
      (1469926462911759 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_241_7 :
    Uω (aρ 7) (bρ 7) (201105762729 / 1000000000000 : ℝ) ≤
      (-(21388339142901952282833 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (588960592762359 / 5000000000000000 : ℝ) ≤
      (-(21388339142901952282833 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (588960592762359 / 5000000000000000 : ℝ) =
            (588960592762359 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (588960592762359 / 312500000000000 : ℝ) ≤
            (6337548069098047717167 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (266958234251109 / 2500000000000000 : ℝ)) (q :=
      (588960592762359 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_241_8 :
    Uω (aρ 8) (bρ 8) (201105762729 / 1000000000000 : ℝ) ≤
      (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_8]) (by norm_num [bρ_8])]; exact Lmid_8

lemma U_241_9 :
    Uω (aρ 9) (bρ 9) (201105762729 / 1000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_241_10 :
    Uω (aρ 10) (bρ 10) (201105762729 / 1000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_241_11 :
    Uω (aρ 11) (bρ 11) (201105762729 / 1000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_241_12 :
    Uω (aρ 12) (bρ 12) (201105762729 / 1000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_241_13 :
    Uω (aρ 13) (bρ 13) (201105762729 / 1000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_241_14 :
    Uω (aρ 14) (bρ 14) (201105762729 / 1000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_241_15 :
    Uω (aρ 15) (bρ 15) (201105762729 / 1000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_241_16 :
    Uω (aρ 16) (bρ 16) (201105762729 / 1000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_241 :
    Uρ (201105762729 / 1000000000000 : ℝ) ≤
      (-(19803133250419148341029 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (201105762729 / 1000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(8182819195849925653851 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (201105762729 / 1000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(16490941930067749877633 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (201105762729 / 1000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3349638049019418963313 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (201105762729 / 1000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8598419076450674071003 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (201105762729 / 1000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(17940232793488732042317 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (201105762729 / 1000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(19173727179049642941211 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (201105762729 / 1000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(21388339142901952282833 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (201105762729 / 1000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14956372202312055299661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (201105762729 / 1000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (201105762729 / 1000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (201105762729 / 1000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (201105762729 / 1000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (201105762729 / 1000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (201105762729 / 1000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (201105762729 / 1000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (201105762729 / 1000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_241_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_242_1 :
    Uω (aρ 1) (bρ 1) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(16256672346253327359079 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3935606651718043 / 20000000000000000 : ℝ) ≤
      (-(16256672346253327359079 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3935606651718043 / 20000000000000000 : ℝ) =
            (3935606651718043 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3935606651718043 / 2500000000000000 : ℝ) ≤
            (4537743062746672640921 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (491930292333417 / 2500000000000000 : ℝ)) (q :=
      (3935606651718043 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_242_2 :
    Uω (aρ 2) (bρ 2) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(16380582927889856239697 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3887141209948259 / 20000000000000000 : ℝ) ≤
      (-(16380582927889856239697 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3887141209948259 / 20000000000000000 : ℝ) =
            (3887141209948259 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3887141209948259 / 2500000000000000 : ℝ) ≤
            (4413832481110143760303 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (485756185018471 / 2500000000000000 : ℝ)) (q :=
      (3887141209948259 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_242_3 :
    Uω (aρ 3) (bρ 3) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(8317443114412870681471 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (757907249819311 / 4000000000000000 : ℝ) ≤
      (-(8317443114412870681471 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (757907249819311 / 4000000000000000 : ℝ) =
            (757907249819311 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (757907249819311 / 500000000000000 : ℝ) ≤
            (2079764590087129318529 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (94640794278609 / 500000000000000 : ℝ)) (q :=
      (757907249819311 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_242_4 :
    Uω (aρ 4) (bρ 4) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(17078105971949760117981 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3625244287093789 / 20000000000000000 : ℝ) ≤
      (-(17078105971949760117981 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3625244287093789 / 20000000000000000 : ℝ) =
            (3625244287093789 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3625244287093789 / 2500000000000000 : ℝ) ≤
            (3716309437050239882019 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (903409052317207 / 5000000000000000 : ℝ)) (q :=
      (3625244287093789 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_242_5 :
    Uω (aρ 5) (bρ 5) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(17811592507555697950333 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (673771066028203 / 4000000000000000 : ℝ) ≤
      (-(17811592507555697950333 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (673771066028203 / 4000000000000000 : ℝ) =
            (673771066028203 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (673771066028203 / 500000000000000 : ℝ) ≤
            (2982822901444302049667 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5214434584427 / 31250000000000 : ℝ)) (q :=
      (673771066028203 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_242_6 :
    Uω (aρ 6) (bρ 6) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(9512788988564780394523 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (596746166723221 / 4000000000000000 : ℝ) ≤
      (-(9512788988564780394523 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (596746166723221 / 4000000000000000 : ℝ) =
            (596746166723221 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (596746166723221 / 500000000000000 : ℝ) ≤
            (884418715935219605477 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (145073494563173 / 1000000000000000 : ℝ)) (q :=
      (596746166723221 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_242_7 :
    Uω (aρ 7) (bρ 7) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(21190996519392976753163 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (480558989182049 / 4000000000000000 : ℝ) ≤
      (-(21190996519392976753163 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (480558989182049 / 4000000000000000 : ℝ) =
            (480558989182049 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (480558989182049 / 250000000000000 : ℝ) ≤
            (6534890692607023246837 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (109346043868587 / 1000000000000000 : ℝ)) (q :=
      (480558989182049 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_242_8 :
    Uω (aρ 8) (bρ 8) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(13927889747717311336039 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (616934229595149 / 10000000000000000 : ℝ) ≤
      (-(13927889747717311336039 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 5
        (show
          (616934229595149 / 10000000000000000 : ℝ) =
            (616934229595149 / 312500000000000 : ℝ) / 2 ^ 5
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (616934229595149 / 312500000000000 : ℝ) ≤
            (3400789759782688663961 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (208075603305923 / 10000000000000000 : ℝ)) (q :=
      (616934229595149 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_242_9 :
    Uω (aρ 9) (bρ 9) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_242_10 :
    Uω (aρ 10) (bρ 10) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_242_11 :
    Uω (aρ 11) (bρ 11) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_242_12 :
    Uω (aρ 12) (bρ 12) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_242_13 :
    Uω (aρ 13) (bρ 13) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_242_14 :
    Uω (aρ 14) (bρ 14) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_242_15 :
    Uω (aρ 15) (bρ 15) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_242_16 :
    Uω (aρ 16) (bρ 16) (3251812320751 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_242 :
    Uρ (3251812320751 / 16000000000000 : ℝ) ≤
      (-(2445977526242332705763 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3251812320751 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(16256672346253327359079 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3251812320751 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(16380582927889856239697 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3251812320751 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8317443114412870681471 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3251812320751 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(17078105971949760117981 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3251812320751 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(17811592507555697950333 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3251812320751 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9512788988564780394523 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3251812320751 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(21190996519392976753163 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3251812320751 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13927889747717311336039 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3251812320751 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3251812320751 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3251812320751 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3251812320751 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3251812320751 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3251812320751 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3251812320751 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3251812320751 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_242_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_243_1 :
    Uω (aρ 1) (bρ 1) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(16148880970392734533323 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3978258559718229 / 20000000000000000 : ℝ) ≤
      (-(16148880970392734533323 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3978258559718229 / 20000000000000000 : ℝ) =
            (3978258559718229 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3978258559718229 / 2500000000000000 : ℝ) ≤
            (4645534438607265466677 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1989048004154479 / 10000000000000000 : ℝ)) (q :=
      (3978258559718229 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_243_2 :
    Uω (aρ 2) (bρ 2) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(16271429224111498996607 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3929803208140881 / 20000000000000000 : ℝ) ≤
      (-(16271429224111498996607 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3929803208140881 / 20000000000000000 : ℝ) =
            (3929803208140881 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3929803208140881 / 2500000000000000 : ℝ) ≤
            (4522986184888501003393 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1964361665087131 / 10000000000000000 : ℝ)) (q :=
      (3929803208140881 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_243_3 :
    Uω (aρ 3) (bρ 3) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(16522854212519461836571 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3832229893992659 / 20000000000000000 : ℝ) ≤
      (-(16522854212519461836571 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3832229893992659 / 20000000000000000 : ℝ) =
            (3832229893992659 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3832229893992659 / 2500000000000000 : ℝ) ≤
            (4271561196480538163429 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1914184457288909 / 10000000000000000 : ℝ)) (q :=
      (3832229893992659 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_243_4 :
    Uω (aρ 4) (bρ 4) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(16960775844740112262383 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3668029835288273 / 20000000000000000 : ℝ) ≤
      (-(16960775844740112262383 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3668029835288273 / 20000000000000000 : ℝ) =
            (3668029835288273 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3668029835288273 / 2500000000000000 : ℝ) ≤
            (3833639564259887737617 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1828278579649523 / 10000000000000000 : ℝ)) (q :=
      (3668029835288273 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_243_5 :
    Uω (aρ 5) (bρ 5) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(8842308310589361790873 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3411904400602917 / 20000000000000000 : ℝ) ≤
      (-(8842308310589361790873 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3411904400602917 / 20000000000000000 : ℝ) =
            (3411904400602917 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3411904400602917 / 2500000000000000 : ℝ) ≤
            (1554899393910638209127 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1690343064299167 / 10000000000000000 : ℝ)) (q :=
      (3411904400602917 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_243_6 :
    Uω (aρ 6) (bρ 6) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(3775942473366500779873 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3027572175387957 / 20000000000000000 : ℝ) ≤
      (-(3775942473366500779873 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3027572175387957 / 20000000000000000 : ℝ) =
            (3027572175387957 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3027572175387957 / 2500000000000000 : ℝ) ≤
            (382940608433499220127 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1473251214224207 / 10000000000000000 : ℝ)) (q :=
      (3027572175387957 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_243_7 :
    Uω (aρ 7) (bρ 7) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(20998210011066161697331 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (489913398610729 / 4000000000000000 : ℝ) ≤
      (-(20998210011066161697331 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (489913398610729 / 4000000000000000 : ℝ) =
            (489913398610729 / 250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (489913398610729 / 250000000000000 : ℝ) ≤
            (6727677200933838302669 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (223781482529979 / 2000000000000000 : ℝ)) (q :=
      (489913398610729 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_243_8 :
    Uω (aρ 8) (bρ 8) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(270088395415343064811 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (671461323264299 / 10000000000000000 : ℝ) ≤
      (-(270088395415343064811 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (671461323264299 / 10000000000000000 : ℝ) =
            (671461323264299 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (671461323264299 / 625000000000000 : ℝ) ≤
            (7170476704656935189 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (18487794841553 / 625000000000000 : ℝ)) (q :=
      (671461323264299 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_243_9 :
    Uω (aρ 9) (bρ 9) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_243_10 :
    Uω (aρ 10) (bρ 10) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_243_11 :
    Uω (aρ 11) (bρ 11) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_243_12 :
    Uω (aρ 12) (bρ 12) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_243_13 :
    Uω (aρ 13) (bρ 13) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_243_14 :
    Uω (aρ 14) (bρ 14) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_243_15 :
    Uω (aρ 15) (bρ 15) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_243_16 :
    Uω (aρ 16) (bρ 16) (1642966218919 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_243 :
    Uρ (1642966218919 / 8000000000000 : ℝ) ≤
      (-(19440334361737891654043 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1642966218919 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(16148880970392734533323 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1642966218919 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(16271429224111498996607 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1642966218919 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(16522854212519461836571 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1642966218919 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(16960775844740112262383 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1642966218919 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8842308310589361790873 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1642966218919 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3775942473366500779873 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1642966218919 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(20998210011066161697331 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1642966218919 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(270088395415343064811 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1642966218919 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1642966218919 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1642966218919 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1642966218919 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1642966218919 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1642966218919 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1642966218919 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1642966218919 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_243_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
