/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U20) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_244_1 :
    Uω (aρ 1) (bρ 1) (132802102197 / 640000000000 : ℝ) ≤
      (-(80211196028750566739 / 50000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4020910430343609 / 20000000000000000 : ℝ) ≤
      (-(80211196028750566739 / 50000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4020910430343609 / 20000000000000000 : ℝ) =
            (4020910430343609 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4020910430343609 / 2500000000000000 : ℝ) ≤
            (23760881016249433261 / 50000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (502593700400121 / 2500000000000000 : ℝ)) (q :=
      (4020910430343609 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_244_2 :
    Uω (aρ 2) (bρ 2) (132802102197 / 640000000000 : ℝ) ≤
      (-(1010215922572068434639 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (397246495170123 / 2000000000000000 : ℝ) ≤
      (-(1010215922572068434639 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (397246495170123 / 2000000000000000 : ℝ) =
            (397246495170123 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (397246495170123 / 250000000000000 : ℝ) ≤
            (289435040490431565361 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (397139667093621 / 2000000000000000 : ℝ)) (q :=
      (397246495170123 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_244_3 :
    Uω (aρ 3) (bρ 3) (132802102197 / 640000000000 : ℝ) ≤
      (-(8206032948370699617277 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (968730644853851 / 5000000000000000 : ℝ) ≤
      (-(8206032948370699617277 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (968730644853851 / 5000000000000000 : ℝ) =
            (968730644853851 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (968730644853851 / 625000000000000 : ℝ) ≤
            (2191174756129300382723 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1935552069532279 / 10000000000000000 : ℝ)) (q :=
      (968730644853851 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_244_4 :
    Uω (aρ 4) (bρ 4) (132802102197 / 640000000000 : ℝ) ≤
      (-(8422407421941390401861 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1855406125778153 / 10000000000000000 : ℝ) ≤
      (-(8422407421941390401861 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1855406125778153 / 10000000000000000 : ℝ) =
            (1855406125778153 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1855406125778153 / 1250000000000000 : ℝ) ≤
            (1974800282558609598139 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1849735922738181 / 10000000000000000 : ℝ)) (q :=
      (1855406125778153 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_244_5 :
    Uω (aρ 5) (bρ 5) (132802102197 / 640000000000 : ℝ) ≤
      (-(877963093041325964747 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (863735860072067 / 5000000000000000 : ℝ) ≤
      (-(877963093041325964747 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (863735860072067 / 5000000000000000 : ℝ) =
            (863735860072067 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (863735860072067 / 625000000000000 : ℝ) ≤
            (161757677408674035253 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1712057030805143 / 10000000000000000 : ℝ)) (q :=
      (863735860072067 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_244_6 :
    Uω (aρ 6) (bρ 6) (132802102197 / 640000000000 : ℝ) ≤
      (-(4684014389455247979343 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1535689301249357 / 10000000000000000 : ℝ) ≤
      (-(4684014389455247979343 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1535689301249357 / 10000000000000000 : ℝ) =
            (1535689301249357 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1535689301249357 / 1250000000000000 : ℝ) ≤
            (514589462794752020657 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1495732568155589 / 10000000000000000 : ℝ)) (q :=
      (1535689301249357 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_244_7 :
    Uω (aρ 7) (bρ 7) (132802102197 / 640000000000 : ℝ) ≤
      (-(20809744920160066222079 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (124808527874231 / 1000000000000000 : ℝ) ≤
      (-(20809744920160066222079 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (124808527874231 / 1000000000000000 : ℝ) =
            (124808527874231 / 62500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (124808527874231 / 62500000000000 : ℝ) ≤
            (6916142291839933777921 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (228837180780299 / 2000000000000000 : ℝ)) (q :=
      (124808527874231 / 1000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_244_8 :
    Uω (aρ 8) (bρ 8) (132802102197 / 640000000000 : ℝ) ≤
      (-(26362368852389073231951 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1432606320755581 / 20000000000000000 : ℝ) ≤
      (-(26362368852389073231951 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1432606320755581 / 20000000000000000 : ℝ) =
            (1432606320755581 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1432606320755581 / 1250000000000000 : ℝ) ≤
            (1363518359610926768049 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (45520414814057 / 1250000000000000 : ℝ)) (q :=
      (1432606320755581 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_244_9 :
    Uω (aρ 9) (bρ 9) (132802102197 / 640000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_244_10 :
    Uω (aρ 10) (bρ 10) (132802102197 / 640000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_244_11 :
    Uω (aρ 11) (bρ 11) (132802102197 / 640000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_244_12 :
    Uω (aρ 12) (bρ 12) (132802102197 / 640000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_244_13 :
    Uω (aρ 13) (bρ 13) (132802102197 / 640000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_244_14 :
    Uω (aρ 14) (bρ 14) (132802102197 / 640000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_244_15 :
    Uω (aρ 15) (bρ 15) (132802102197 / 640000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_244_16 :
    Uω (aρ 16) (bρ 16) (132802102197 / 640000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_244 :
    Uρ (132802102197 / 640000000000 : ℝ) ≤
      (-(2416425266355531027053 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (132802102197 / 640000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(80211196028750566739 / 50000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (132802102197 / 640000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1010215922572068434639 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (132802102197 / 640000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8206032948370699617277 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (132802102197 / 640000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8422407421941390401861 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (132802102197 / 640000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(877963093041325964747 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (132802102197 / 640000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4684014389455247979343 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (132802102197 / 640000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(20809744920160066222079 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (132802102197 / 640000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(26362368852389073231951 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (132802102197 / 640000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (132802102197 / 640000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (132802102197 / 640000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (132802102197 / 640000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (132802102197 / 640000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (132802102197 / 640000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (132802102197 / 640000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (132802102197 / 640000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_244_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_245_1 :
    Uω (aρ 1) (bρ 1) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(15989341814769083441683 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8084472704020983 / 40000000000000000 : ℝ) ≤
      (-(15989341814769083441683 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8084472704020983 / 40000000000000000 : ℝ) =
            (8084472704020983 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8084472704020983 / 5000000000000000 : ℝ) ≤
            (4805073594230916558317 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2021038186677679 / 10000000000000000 : ℝ)) (q :=
      (8084472704020983 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_245_2 :
    Uω (aρ 2) (bρ 2) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(251717216120021689271 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7987591461091323 / 40000000000000000 : ℝ) ≤
      (-(251717216120021689271 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7987591461091323 / 40000000000000000 : ℝ) =
            (7987591461091323 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7987591461091323 / 5000000000000000 : ℝ) ≤
            (73195524645603310729 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1996366577722849 / 10000000000000000 : ℝ)) (q :=
      (7987591461091323 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_245_3 :
    Uω (aρ 3) (bρ 3) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(16357129540002021346027 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1558507428879981 / 8000000000000000 : ℝ) ≤
      (-(16357129540002021346027 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1558507428879981 / 8000000000000000 : ℝ) =
            (1558507428879981 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1558507428879981 / 1000000000000000 : ℝ) ≤
            (4437285868997978653973 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (97311776286357 / 500000000000000 : ℝ)) (q :=
      (1558507428879981 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_245_4 :
    Uω (aρ 4) (bρ 4) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(839366889642839072517 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1492880927632989 / 8000000000000000 : ℝ) ≤
      (-(839366889642839072517 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1492880927632989 / 8000000000000000 : ℝ) =
            (1492880927632989 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1492880927632989 / 1000000000000000 : ℝ) ≤
            (200353880807160927483 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (93023172683733 / 500000000000000 : ℝ)) (q :=
      (1492880927632989 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_245_5 :
    Uω (aρ 5) (bρ 5) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(8748589672698357586477 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6952918634228077 / 40000000000000000 : ℝ) ≤
      (-(8748589672698357586477 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6952918634228077 / 40000000000000000 : ℝ) =
            (6952918634228077 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6952918634228077 / 5000000000000000 : ℝ) ≤
            (1648618031801642413523 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (861455185520613 / 5000000000000000 : ℝ)) (q :=
      (6952918634228077 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_245_6 :
    Uω (aρ 6) (bρ 6) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(18665037439110731528699 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6186538422931207 / 40000000000000000 : ℝ) ≤
      (-(18665037439110731528699 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6186538422931207 / 40000000000000000 : ℝ) =
            (6186538422931207 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6186538422931207 / 5000000000000000 : ℝ) ≤
            (2129377969889268471301 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1506960640532791 / 10000000000000000 : ℝ)) (q :=
      (6186538422931207 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_245_7 :
    Uω (aρ 7) (bρ 7) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(129481655524811388393 / 62500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5038825226518599 / 40000000000000000 : ℝ) ≤
      (-(129481655524811388393 / 62500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5038825226518599 / 40000000000000000 : ℝ) =
            (5038825226518599 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5038825226518599 / 5000000000000000 : ℝ) ≤
            (483440781438611607 / 62500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1156765423086487 / 10000000000000000 : ℝ)) (q :=
      (5038825226518599 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_245_8 :
    Uω (aρ 8) (bρ 8) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(26081207921134859408713 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (117876576485053 / 1600000000000000 : ℝ) ≤
      (-(26081207921134859408713 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (117876576485053 / 1600000000000000 : ℝ) =
            (117876576485053 / 100000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (117876576485053 / 100000000000000 : ℝ) ≤
            (1644679290865140591287 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7887033344607 / 200000000000000 : ℝ)) (q :=
      (117876576485053 / 1600000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_245_9 :
    Uω (aρ 9) (bρ 9) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_245_10 :
    Uω (aρ 10) (bρ 10) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_245_11 :
    Uω (aρ 11) (bρ 11) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_245_12 :
    Uω (aρ 12) (bρ 12) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_245_13 :
    Uω (aρ 13) (bρ 13) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_245_14 :
    Uω (aρ 14) (bρ 14) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_245_15 :
    Uω (aρ 15) (bρ 15) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_245_16 :
    Uω (aρ 16) (bρ 16) (6674225226937 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_245 :
    Uρ (6674225226937 / 32000000000000 : ℝ) ≤
      (-(19280957920972008264119 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (6674225226937 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15989341814769083441683 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (6674225226937 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(251717216120021689271 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (6674225226937 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(16357129540002021346027 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (6674225226937 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(839366889642839072517 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (6674225226937 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8748589672698357586477 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (6674225226937 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(18665037439110731528699 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (6674225226937 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(129481655524811388393 / 62500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (6674225226937 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(26081207921134859408713 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (6674225226937 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (6674225226937 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (6674225226937 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (6674225226937 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (6674225226937 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (6674225226937 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (6674225226937 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (6674225226937 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_245_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_246_1 :
    Uω (aρ 1) (bρ 1) (838543168003 / 4000000000000 : ℝ) ≤
      (-(1992090348424161097649 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (812712452954231 / 4000000000000000 : ℝ) ≤
      (-(1992090348424161097649 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (812712452954231 / 4000000000000000 : ℝ) =
            (812712452954231 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (812712452954231 / 500000000000000 : ℝ) ≤
            (607211577700838902351 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (406340312569731 / 2000000000000000 : ℝ)) (q :=
      (812712452954231 / 4000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_246_2 :
    Uω (aρ 2) (bρ 2) (838543168003 / 4000000000000 : ℝ) ≤
      (-(8028317158933071913149 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4015126448750247 / 20000000000000000 : ℝ) ≤
      (-(8028317158933071913149 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4015126448750247 / 20000000000000000 : ℝ) =
            (4015126448750247 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4015126448750247 / 2500000000000000 : ℝ) ≤
            (2368890545566928086851 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2007034759337747 / 10000000000000000 : ℝ)) (q :=
      (4015126448750247 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_246_3 :
    Uω (aρ 3) (bρ 3) (838543168003 / 4000000000000 : ℝ) ≤
      (-(4075623479472093816281 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3917614336794283 / 20000000000000000 : ℝ) ≤
      (-(4075623479472093816281 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3917614336794283 / 20000000000000000 : ℝ) =
            (3917614336794283 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3917614336794283 / 2500000000000000 : ℝ) ≤
            (1122980372777906183719 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1956918753731783 / 10000000000000000 : ℝ)) (q :=
      (3917614336794283 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_246_4 :
    Uω (aρ 4) (bρ 4) (838543168003 / 4000000000000 : ℝ) ≤
      (-(16730191195247513018179 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (938397910910331 / 5000000000000000 : ℝ) ≤
      (-(16730191195247513018179 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (938397910910331 / 5000000000000000 : ℝ) =
            (938397910910331 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (938397910910331 / 625000000000000 : ℝ) ≤
            (4064224213752486981821 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (116949390102739 / 625000000000000 : ℝ)) (q :=
      (938397910910331 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_246_5 :
    Uω (aρ 5) (bρ 5) (838543168003 / 4000000000000 : ℝ) ≤
      (-(8717743323121730710593 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1748986413039669 / 10000000000000000 : ℝ) ≤
      (-(8717743323121730710593 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1748986413039669 / 10000000000000000 : ℝ) =
            (1748986413039669 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1748986413039669 / 1250000000000000 : ℝ) ≤
            (1679464381378269289407 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (866880671708419 / 5000000000000000 : ℝ)) (q :=
      (1748986413039669 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_246_6 :
    Uω (aρ 6) (bρ 6) (838543168003 / 4000000000000 : ℝ) ≤
      (-(18594544327930489474517 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3115151666007471 / 20000000000000000 : ℝ) ≤
      (-(18594544327930489474517 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3115151666007471 / 20000000000000000 : ℝ) =
            (3115151666007471 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3115151666007471 / 2500000000000000 : ℝ) ≤
            (2199871081069510525483 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1518180558484971 / 10000000000000000 : ℝ)) (q :=
      (3115151666007471 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_246_7 :
    Uω (aρ 7) (bρ 7) (838543168003 / 4000000000000 : ℝ) ≤
      (-(825015431120082058003 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2542616566211877 / 20000000000000000 : ℝ) ≤
      (-(825015431120082058003 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2542616566211877 / 20000000000000000 : ℝ) =
            (2542616566211877 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2542616566211877 / 2500000000000000 : ℝ) ≤
            (6761185239917941997 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1169306839449377 / 10000000000000000 : ℝ)) (q :=
      (2542616566211877 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_246_8 :
    Uω (aρ 8) (bρ 8) (838543168003 / 4000000000000 : ℝ) ≤
      (-(3227522382415953287113 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (756212533019953 / 10000000000000000 : ℝ) ≤
      (-(3227522382415953287113 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (756212533019953 / 10000000000000000 : ℝ) =
            (756212533019953 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (756212533019953 / 625000000000000 : ℝ) ≤
            (238213519084046712887 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (211328495308703 / 5000000000000000 : ℝ)) (q :=
      (756212533019953 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_246_9 :
    Uω (aρ 9) (bρ 9) (838543168003 / 4000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_246_10 :
    Uω (aρ 10) (bρ 10) (838543168003 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_246_11 :
    Uω (aρ 11) (bρ 11) (838543168003 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_246_12 :
    Uω (aρ 12) (bρ 12) (838543168003 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_246_13 :
    Uω (aρ 13) (bρ 13) (838543168003 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_246_14 :
    Uω (aρ 14) (bρ 14) (838543168003 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_246_15 :
    Uω (aρ 15) (bρ 15) (838543168003 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_246_16 :
    Uω (aρ 16) (bρ 16) (838543168003 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_246 :
    Uρ (838543168003 / 4000000000000 : ℝ) ≤
      (-(961624510270881730459 / 500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (838543168003 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1992090348424161097649 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (838543168003 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(8028317158933071913149 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (838543168003 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4075623479472093816281 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (838543168003 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(16730191195247513018179 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (838543168003 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8717743323121730710593 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (838543168003 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(18594544327930489474517 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (838543168003 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(825015431120082058003 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (838543168003 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3227522382415953287113 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (838543168003 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (838543168003 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (838543168003 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (838543168003 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (838543168003 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (838543168003 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (838543168003 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (838543168003 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_246_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_247_1 :
    Uω (aρ 1) (bρ 1) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(15884379209042150851217 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8169776337530201 / 40000000000000000 : ℝ) ≤
      (-(15884379209042150851217 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8169776337530201 / 40000000000000000 : ℝ) =
            (8169776337530201 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8169776337530201 / 5000000000000000 : ℝ) ≤
            (4910036199957849148783 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2042364930252913 / 10000000000000000 : ℝ)) (q :=
      (8169776337530201 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_247_2 :
    Uω (aρ 2) (bρ 2) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(16003649191942420646063 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8072914214553699 / 40000000000000000 : ℝ) ≤
      (-(16003649191942420646063 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8072914214553699 / 40000000000000000 : ℝ) =
            (8072914214553699 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8072914214553699 / 5000000000000000 : ℝ) ≤
            (4790766217057579353937 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1008851440637331 / 5000000000000000 : ℝ)) (q :=
      (8072914214553699 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_247_3 :
    Uω (aρ 3) (bρ 3) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(8124077874733012623601 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7877919753830639 / 40000000000000000 : ℝ) ≤
      (-(8124077874733012623601 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7877919753830639 / 40000000000000000 : ℝ) =
            (7877919753830639 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7877919753830639 / 5000000000000000 : ℝ) ≤
            (2273129829766987376399 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (491900439315783 / 2500000000000000 : ℝ)) (q :=
      (7877919753830639 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_247_4 :
    Uω (aρ 4) (bρ 4) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(16673371250703288171891 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7549960475874883 / 40000000000000000 : ℝ) ≤
      (-(16673371250703288171891 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7549960475874883 / 40000000000000000 : ℝ) =
            (7549960475874883 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7549960475874883 / 5000000000000000 : ℝ) ≤
            (4121044158296711828109 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (940958149675127 / 5000000000000000 : ℝ)) (q :=
      (7549960475874883 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_247_5 :
    Uω (aρ 5) (bρ 5) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(43435447039729323767 / 25000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7038968022732803 / 40000000000000000 : ℝ) ≤
      (-(43435447039729323767 / 25000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7038968022732803 / 40000000000000000 : ℝ) =
            (7038968022732803 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7038968022732803 / 5000000000000000 : ℝ) ≤
            (8550591482770676233 / 25000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (872304996057107 / 5000000000000000 : ℝ)) (q :=
      (7038968022732803 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_247_6 :
    Uω (aρ 6) (bρ 6) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(4631142522539577805907 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6274052291183249 / 40000000000000000 : ℝ) ≤
      (-(4631142522539577805907 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6274052291183249 / 40000000000000000 : ℝ) =
            (6274052291183249 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6274052291183249 / 5000000000000000 : ℝ) ≤
            (567461329710422194093 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1529392501479437 / 10000000000000000 : ℝ)) (q :=
      (6274052291183249 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_247_7 :
    Uω (aρ 7) (bρ 7) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(20534683322764266391341 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5131567258775443 / 40000000000000000 : ℝ) ≤
      (-(20534683322764266391341 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5131567258775443 / 40000000000000000 : ℝ) =
            (5131567258775443 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5131567258775443 / 5000000000000000 : ℝ) ≤
            (259732086235733608659 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (590905683017767 / 5000000000000000 : ℝ)) (q :=
      (5131567258775443 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_247_8 :
    Uω (aρ 8) (bρ 8) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(25575639136592379083153 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3099731638180319 / 40000000000000000 : ℝ) ≤
      (-(25575639136592379083153 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3099731638180319 / 40000000000000000 : ℝ) =
            (3099731638180319 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3099731638180319 / 2500000000000000 : ℝ) ≤
            (2150248075407620916847 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (112358801769493 / 2500000000000000 : ℝ)) (q :=
      (3099731638180319 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_247_9 :
    Uω (aρ 9) (bρ 9) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_247_10 :
    Uω (aρ 10) (bρ 10) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_247_11 :
    Uω (aρ 11) (bρ 11) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_247_12 :
    Uω (aρ 12) (bρ 12) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_247_13 :
    Uω (aρ 13) (bρ 13) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_247_14 :
    Uω (aρ 14) (bρ 14) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_247_15 :
    Uω (aρ 15) (bρ 15) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_247_16 :
    Uω (aρ 16) (bρ 16) (6742465461111 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_247 :
    Uρ (6742465461111 / 32000000000000 : ℝ) ≤
      (-(19185673420397004360467 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (6742465461111 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15884379209042150851217 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (6742465461111 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(16003649191942420646063 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (6742465461111 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8124077874733012623601 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (6742465461111 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(16673371250703288171891 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (6742465461111 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(43435447039729323767 / 25000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (6742465461111 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4631142522539577805907 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (6742465461111 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(20534683322764266391341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (6742465461111 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(25575639136592379083153 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (6742465461111 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (6742465461111 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (6742465461111 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (6742465461111 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (6742465461111 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (6742465461111 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (6742465461111 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (6742465461111 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_247_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_248_1 :
    Uω (aρ 1) (bρ 1) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(15832308210675581165643 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4106214064128931 / 20000000000000000 : ℝ) ≤
      (-(15832308210675581165643 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4106214064128931 / 20000000000000000 : ℝ) =
            (4106214064128931 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4106214064128931 / 2500000000000000 : ℝ) ≤
            (4962107198324418834357 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (128314268064191 / 625000000000000 : ℝ)) (q :=
      (4106214064128931 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_248_2 :
    Uω (aρ 2) (bρ 2) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(7975471737047489165407 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (253611731691693 / 1250000000000000 : ℝ) ≤
      (-(7975471737047489165407 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (253611731691693 / 1250000000000000 : ℝ) =
            (253611731691693 / 156250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (253611731691693 / 156250000000000 : ℝ) ≤
            (2421735967452510834593 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2028370944475213 / 10000000000000000 : ℝ)) (q :=
      (253611731691693 / 1250000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_248_3 :
    Uω (aρ 3) (bρ 3) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(3238822361460214488721 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3960305196199621 / 20000000000000000 : ℝ) ≤
      (-(3238822361460214488721 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3960305196199621 / 20000000000000000 : ℝ) =
            (3960305196199621 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3960305196199621 / 2500000000000000 : ℝ) ≤
            (920060720339785511279 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (989142269978873 / 5000000000000000 : ℝ)) (q :=
      (3960305196199621 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_248_4 :
    Uω (aρ 4) (bρ 4) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(3323374844885987262029 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3796368114386551 / 20000000000000000 : ℝ) ≤
      (-(3323374844885987262029 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3796368114386551 / 20000000000000000 : ℝ) =
            (3796368114386551 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3796368114386551 / 2500000000000000 : ℝ) ≤
            (835508236914012737971 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (473160409802419 / 2500000000000000 : ℝ)) (q :=
      (3796368114386551 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_248_5 :
    Uω (aρ 5) (bρ 5) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(3462650200390808338077 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3540992916055939 / 20000000000000000 : ℝ) ≤
      (-(3462650200390808338077 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3540992916055939 / 20000000000000000 : ℝ) =
            (3540992916055939 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3540992916055939 / 2500000000000000 : ℝ) ≤
            (696232881409191661923 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (109716022513379 / 625000000000000 : ℝ)) (q :=
      (3540992916055939 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_248_6 :
    Uω (aρ 6) (bρ 6) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(18455106786157723315289 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (631778564867047 / 4000000000000000 : ℝ) ≤
      (-(18455106786157723315289 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (631778564867047 / 4000000000000000 : ℝ) =
            (631778564867047 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (631778564867047 / 500000000000000 : ℝ) ≤
            (2339308622842276684711 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (19257458045417 / 125000000000000 : ℝ)) (q :=
      (631778564867047 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_248_7 :
    Uω (aρ 7) (bρ 7) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(20444934186107947075261 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1294457480766791 / 10000000000000000 : ℝ) ≤
      (-(20444934186107947075261 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1294457480766791 / 10000000000000000 : ℝ) =
            (1294457480766791 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1294457480766791 / 1250000000000000 : ℝ) ≤
            (349481222892052924739 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1194280161591707 / 10000000000000000 : ℝ)) (q :=
      (1294457480766791 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_248_8 :
    Uω (aρ 8) (bρ 8) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(792029153694985536973 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (396509459602709 / 5000000000000000 : ℝ) ≤
      (-(792029153694985536973 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (396509459602709 / 5000000000000000 : ℝ) =
            (396509459602709 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (396509459602709 / 312500000000000 : ℝ) ≤
            (74404821680014463027 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (474944689808961 / 10000000000000000 : ℝ)) (q :=
      (396509459602709 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_248_9 :
    Uω (aρ 9) (bρ 9) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_248_10 :
    Uω (aρ 10) (bρ 10) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_248_11 :
    Uω (aρ 11) (bρ 11) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_248_12 :
    Uω (aρ 12) (bρ 12) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_248_13 :
    Uω (aρ 13) (bρ 13) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_248_14 :
    Uω (aρ 14) (bρ 14) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_248_15 :
    Uω (aρ 15) (bρ 15) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_248_16 :
    Uω (aρ 16) (bρ 16) (3388292789099 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_248 :
    Uρ (3388292789099 / 16000000000000 : ℝ) ≤
      (-(3828053887706228677047 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3388292789099 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15832308210675581165643 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3388292789099 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(7975471737047489165407 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3388292789099 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3238822361460214488721 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3388292789099 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3323374844885987262029 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3388292789099 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3462650200390808338077 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3388292789099 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(18455106786157723315289 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3388292789099 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(20444934186107947075261 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3388292789099 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(792029153694985536973 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3388292789099 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3388292789099 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3388292789099 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3388292789099 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3388292789099 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3388292789099 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3388292789099 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3388292789099 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_248_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_249_1 :
    Uω (aρ 1) (bρ 1) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(7890253483925033164729 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8255079901992847 / 40000000000000000 : ℝ) ≤
      (-(7890253483925033164729 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8255079901992847 / 40000000000000000 : ℝ) =
            (8255079901992847 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8255079901992847 / 5000000000000000 : ℝ) ≤
            (2506954220574966835271 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2063691639304861 / 10000000000000000 : ℝ)) (q :=
      (8255079901992847 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_249_2 :
    Uω (aρ 2) (bρ 2) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(3179702846290115685933 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8158236498085747 / 40000000000000000 : ℝ) ≤
      (-(3179702846290115685933 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8158236498085747 / 40000000000000000 : ℝ) =
            (8158236498085747 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8158236498085747 / 5000000000000000 : ℝ) ≤
            (979180235509884314067 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2039038949861311 / 10000000000000000 : ℝ)) (q :=
      (8158236498085747 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_249_3 :
    Uω (aρ 3) (bρ 3) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(3228071783260219938387 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1592660119282217 / 8000000000000000 : ℝ) ≤
      (-(3228071783260219938387 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1592660119282217 / 8000000000000000 : ℝ) =
            (1592660119282217 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1592660119282217 / 1000000000000000 : ℝ) ≤
            (930811298539780061613 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (99448355268699 / 500000000000000 : ℝ)) (q :=
      (1592660119282217 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_249_4 :
    Uω (aρ 4) (bρ 4) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(16560696445683286189297 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7635510570247419 / 40000000000000000 : ℝ) ≤
      (-(16560696445683286189297 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7635510570247419 / 40000000000000000 : ℝ) =
            (7635510570247419 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7635510570247419 / 5000000000000000 : ℝ) ≤
            (4233718963316713810703 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1903366273357147 / 10000000000000000 : ℝ)) (q :=
      (7635510570247419 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_249_5 :
    Uω (aρ 5) (bρ 5) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(1725269844467385308997 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1424999832864611 / 8000000000000000 : ℝ) ≤
      (-(1725269844467385308997 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1424999832864611 / 8000000000000000 : ℝ) =
            (1424999832864611 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1424999832864611 / 1000000000000000 : ℝ) ≤
            (354171696432614691003 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (353260097945993 / 2000000000000000 : ℝ)) (q :=
      (1424999832864611 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_249_6 :
    Uω (aρ 6) (bρ 6) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(735445866576952836003 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1272300748482987 / 8000000000000000 : ℝ) ≤
      (-(735445866576952836003 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1272300748482987 / 8000000000000000 : ℝ) =
            (1272300748482987 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1272300748482987 / 1000000000000000 : ℝ) ≤
            (96330749783047163997 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (310358630783181 / 2000000000000000 : ℝ)) (q :=
      (1272300748482987 / 8000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_249_7 :
    Uω (aρ 7) (bρ 7) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(10178057967148668099869 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5224023340519699 / 40000000000000000 : ℝ) ≤
      (-(10178057967148668099869 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5224023340519699 / 40000000000000000 : ℝ) =
            (5224023340519699 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5224023340519699 / 5000000000000000 : ℝ) ≤
            (219149737351331900131 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1206714333728287 / 10000000000000000 : ℝ)) (q :=
      (5224023340519699 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_249_8 :
    Uω (aρ 8) (bρ 8) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(201008430917706393269 / 80000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3242271182885199 / 40000000000000000 : ℝ) ≤
      (-(201008430917706393269 / 80000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3242271182885199 / 40000000000000000 : ℝ) =
            (3242271182885199 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3242271182885199 / 2500000000000000 : ℝ) ≤
            (20798666778293606731 / 80000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (499379906251037 / 10000000000000000 : ℝ)) (q :=
      (3242271182885199 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_249_9 :
    Uω (aρ 9) (bρ 9) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_249_10 :
    Uω (aρ 10) (bρ 10) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_249_11 :
    Uω (aρ 11) (bρ 11) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_249_12 :
    Uω (aρ 12) (bρ 12) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_249_13 :
    Uω (aρ 13) (bρ 13) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_249_14 :
    Uω (aρ 14) (bρ 14) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_249_15 :
    Uω (aρ 15) (bρ 15) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_249_16 :
    Uω (aρ 16) (bρ 16) (1362141139057 / 6400000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_249 :
    Uρ (1362141139057 / 6400000000000 : ℝ) ≤
      (-(19096097579846410691343 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1362141139057 / 6400000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7890253483925033164729 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1362141139057 / 6400000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3179702846290115685933 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1362141139057 / 6400000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3228071783260219938387 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1362141139057 / 6400000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(16560696445683286189297 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1362141139057 / 6400000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1725269844467385308997 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1362141139057 / 6400000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(735445866576952836003 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1362141139057 / 6400000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(10178057967148668099869 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1362141139057 / 6400000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) * (-(201008430917706393269 / 80000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1362141139057 / 6400000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1362141139057 / 6400000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1362141139057 / 6400000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1362141139057 / 6400000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1362141139057 / 6400000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1362141139057 / 6400000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1362141139057 / 6400000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1362141139057 / 6400000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_249_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_250_1 :
    Uω (aρ 1) (bρ 1) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(15728972699799062262617 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (259304114343663 / 1250000000000000 : ℝ) ≤
      (-(15728972699799062262617 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (259304114343663 / 1250000000000000 : ℝ) =
            (259304114343663 / 156250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (259304114343663 / 156250000000000 : ℝ) ≤
            (5065442709200937737383 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1037177490608679 / 5000000000000000 : ℝ)) (q :=
      (259304114343663 / 1250000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_250_2 :
    Uω (aρ 2) (bρ 2) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(7923179288548330911731 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1025112183526729 / 5000000000000000 : ℝ) ≤
      (-(7923179288548330911731 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1025112183526729 / 5000000000000000 : ℝ) =
            (1025112183526729 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1025112183526729 / 625000000000000 : ℝ) ≤
            (2474028415951669088269 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1024853449167833 / 5000000000000000 : ℝ)) (q :=
      (1025112183526729 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_250_3 :
    Uω (aρ 3) (bρ 3) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(1608689395258738273783 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (400299518641533 / 2000000000000000 : ℝ) ≤
      (-(1608689395258738273783 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (400299518641533 / 2000000000000000 : ℝ) =
            (400299518641533 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (400299518641533 / 250000000000000 : ℝ) ≤
            (470752145641261726217 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (12497809106213 / 62500000000000 : ℝ)) (q :=
      (400299518641533 / 2000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_250_4 :
    Uω (aρ 4) (bρ 4) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(16504834306304953880329 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (239946360125701 / 1250000000000000 : ℝ) ≤
      (-(16504834306304953880329 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (239946360125701 / 1250000000000000 : ℝ) =
            (239946360125701 / 156250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (239946360125701 / 156250000000000 : ℝ) ≤
            (4289581102695046119671 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (957045106827483 / 5000000000000000 : ℝ)) (q :=
      (239946360125701 / 1250000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_250_5 :
    Uω (aρ 5) (bρ 5) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(17192516474548806354561 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3584004050662709 / 20000000000000000 : ℝ) ≤
      (-(17192516474548806354561 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3584004050662709 / 20000000000000000 : ℝ) =
            (3584004050662709 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3584004050662709 / 2500000000000000 : ℝ) ≤
            (3601898934451193645439 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1777142421641459 / 10000000000000000 : ℝ)) (q :=
      (3584004050662709 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_250_6 :
    Uω (aρ 6) (bρ 6) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(9158841077746681639 / 5000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3202603450222341 / 20000000000000000 : ℝ) ≤
      (-(9158841077746681639 / 5000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3202603450222341 / 20000000000000000 : ℝ) =
            (3202603450222341 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3202603450222341 / 2500000000000000 : ℝ) ≤
            (1238366626753318361 / 5000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1562982196341091 / 10000000000000000 : ℝ)) (q :=
      (3202603450222341 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_250_7 :
    Uω (aρ 7) (bρ 7) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(4053641396807687271301 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32938435187193 / 250000000000000 : ℝ) ≤
      (-(4053641396807687271301 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (32938435187193 / 250000000000000 : ℝ) = (32938435187193 / 31250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32938435187193 / 31250000000000 : ℝ) ≤
            (105241684992312728699 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (121911494185419 / 1000000000000000 : ℝ)) (q :=
      (32938435187193 / 250000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_250_8 :
    Uω (aρ 8) (bρ 8) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(24917441486620581692963 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12932107065137 / 156250000000000 : ℝ) ≤
      (-(24917441486620581692963 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (12932107065137 / 156250000000000 : ℝ) = (12932107065137 / 9765625000000 : ℝ) / 2 ^ 4 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12932107065137 / 9765625000000 : ℝ) ≤
            (2808445725379418307037 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (261445741278143 / 5000000000000000 : ℝ)) (q :=
      (12932107065137 / 156250000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_250_9 :
    Uω (aρ 9) (bρ 9) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_250_10 :
    Uω (aρ 10) (bρ 10) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_250_11 :
    Uω (aρ 11) (bρ 11) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_250_12 :
    Uω (aρ 12) (bρ 12) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_250_13 :
    Uω (aρ 13) (bρ 13) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_250_14 :
    Uω (aρ 14) (bρ 14) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_250_15 :
    Uω (aρ 15) (bρ 15) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_250_16 :
    Uω (aρ 16) (bρ 16) (1711206453093 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_250 :
    Uρ (1711206453093 / 8000000000000 : ℝ) ≤
      (-(2381627086733213812727 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1711206453093 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15728972699799062262617 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1711206453093 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(7923179288548330911731 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1711206453093 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1608689395258738273783 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1711206453093 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(16504834306304953880329 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1711206453093 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(17192516474548806354561 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1711206453093 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(9158841077746681639 / 5000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1711206453093 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4053641396807687271301 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1711206453093 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(24917441486620581692963 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1711206453093 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1711206453093 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1711206453093 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1711206453093 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1711206453093 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1711206453093 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1711206453093 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1711206453093 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_250_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_251_1 :
    Uω (aρ 1) (bρ 1) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(15703304824046411768787 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16638115062611679 / 80000000000000000 : ℝ) ≤
      (-(15703304824046411768787 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16638115062611679 / 80000000000000000 : ℝ) =
            (16638115062611679 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16638115062611679 / 10000000000000000 : ℝ) ≤
            (5091110584953588231213 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1039843324538413 / 5000000000000000 : ℝ)) (q :=
      (16638115062611679 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_251_2 :
    Uω (aρ 2) (bρ 2) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(15820382455700095831141 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16444455822296023 / 80000000000000000 : ℝ) ≤
      (-(15820382455700095831141 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16444455822296023 / 80000000000000000 : ℝ) =
            (16444455822296023 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16444455822296023 / 10000000000000000 : ℝ) ≤
            (4974032953299904168859 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (256880106438489 / 1250000000000000 : ℝ)) (q :=
      (16444455822296023 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_251_3 :
    Uω (aρ 3) (bρ 3) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(8030134240491908589773 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3210934041131651 / 16000000000000000 : ℝ) ≤
      (-(8030134240491908589773 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3210934041131651 / 16000000000000000 : ℝ) =
            (3210934041131651 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3210934041131651 / 2000000000000000 : ℝ) ≤
            (2367073464008091410227 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (200499055369847 / 1000000000000000 : ℝ)) (q :=
      (3210934041131651 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_251_4 :
    Uω (aρ 4) (bρ 4) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(1029813780661990088497 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15399338975582483 / 80000000000000000 : ℝ) ≤
      (-(1029813780661990088497 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (15399338975582483 / 80000000000000000 : ℝ) =
            (15399338975582483 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15399338975582483 / 10000000000000000 : ℝ) ≤
            (269837182400509911503 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1919451927244527 / 10000000000000000 : ℝ)) (q :=
      (15399338975582483 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_251_5 :
    Uω (aρ 5) (bρ 5) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(17162563024561307747881 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14379021893371507 / 80000000000000000 : ℝ) ≤
      (-(17162563024561307747881 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (14379021893371507 / 80000000000000000 : ℝ) =
            (14379021893371507 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14379021893371507 / 10000000000000000 : ℝ) ≤
            (3631852384438692252119 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1782562576026783 / 10000000000000000 : ℝ)) (q :=
      (14379021893371507 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_251_6 :
    Uω (aρ 6) (bρ 6) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(18283633438707248311039 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12854105956912811 / 80000000000000000 : ℝ) ≤
      (-(18283633438707248311039 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12854105956912811 / 80000000000000000 : ℝ) =
            (12854105956912811 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12854105956912811 / 10000000000000000 : ℝ) ≤
            (2510781970292751688961 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1568573967052109 / 10000000000000000 : ℝ)) (q :=
      (12854105956912811 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_251_7 :
    Uω (aρ 7) (bρ 7) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(4044917394737842997651 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10586376477557943 / 80000000000000000 : ℝ) ≤
      (-(4044917394737842997651 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10586376477557943 / 80000000000000000 : ℝ) =
            (10586376477557943 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10586376477557943 / 10000000000000000 : ℝ) ≤
            (113965687062157002349 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (76581436123337 / 625000000000000 : ℝ)) (q :=
      (10586376477557943 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_251_8 :
    Uω (aρ 8) (bρ 8) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(24816587177418204207001 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6688354741662559 / 80000000000000000 : ℝ) ≤
      (-(24816587177418204207001 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (6688354741662559 / 80000000000000000 : ℝ) =
            (6688354741662559 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6688354741662559 / 5000000000000000 : ℝ) ≤
            (2909300034581795792999 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (267169597669773 / 5000000000000000 : ℝ)) (q :=
      (6688354741662559 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_251_9 :
    Uω (aρ 9) (bρ 9) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_251_10 :
    Uω (aρ 10) (bρ 10) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_251_11 :
    Uω (aρ 11) (bρ 11) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_251_12 :
    Uω (aρ 12) (bρ 12) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_251_13 :
    Uω (aρ 13) (bρ 13) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_251_14 :
    Uω (aρ 14) (bρ 14) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_251_15 :
    Uω (aρ 15) (bρ 15) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_251_16 :
    Uω (aρ 16) (bρ 16) (13723771741831 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_251 :
    Uρ (13723771741831 / 64000000000000 : ℝ) ≤
      (-(19031849196494214193577 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (13723771741831 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15703304824046411768787 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (13723771741831 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(15820382455700095831141 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (13723771741831 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8030134240491908589773 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (13723771741831 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1029813780661990088497 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (13723771741831 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(17162563024561307747881 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (13723771741831 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(18283633438707248311039 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (13723771741831 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4044917394737842997651 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (13723771741831 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(24816587177418204207001 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (13723771741831 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (13723771741831 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (13723771741831 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (13723771741831 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (13723771741831 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (13723771741831 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (13723771741831 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (13723771741831 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_251_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_252_1 :
    Uω (aρ 1) (bρ 1) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(7838851334268503496127 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8340383399527659 / 40000000000000000 : ℝ) ≤
      (-(7838851334268503496127 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8340383399527659 / 40000000000000000 : ℝ) =
            (8340383399527659 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8340383399527659 / 5000000000000000 : ℝ) ≤
            (2558356370231496503873 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (521254578723223 / 2500000000000000 : ℝ)) (q :=
      (8340383399527659 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_252_2 :
    Uω (aρ 2) (bρ 2) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(3158894733825103070931 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8243558326286459 / 40000000000000000 : ℝ) ≤
      (-(3158894733825103070931 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8243558326286459 / 40000000000000000 : ℝ) =
            (8243558326286459 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8243558326286459 / 5000000000000000 : ℝ) ≤
            (999988347974896929069 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (515093697695573 / 2500000000000000 : ℝ)) (q :=
      (8243558326286459 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_252_3 :
    Uω (aρ 3) (bρ 3) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(8016856921198687784309 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8048679728474291 / 40000000000000000 : ℝ) ≤
      (-(8016856921198687784309 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8048679728474291 / 40000000000000000 : ℝ) =
            (8048679728474291 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8048679728474291 / 5000000000000000 : ℝ) ≤
            (2380350783301312215691 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (62822862444569 / 312500000000000 : ℝ)) (q :=
      (8048679728474291 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_252_4 :
    Uω (aρ 4) (bρ 4) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(8224642129649983668167 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7721055113292499 / 40000000000000000 : ℝ) ≤
      (-(8224642129649983668167 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7721055113292499 / 40000000000000000 : ℝ) =
            (7721055113292499 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7721055113292499 / 5000000000000000 : ℝ) ≤
            (2172565574850016331833 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (240601683962539 / 1250000000000000 : ℝ)) (q :=
      (7721055113292499 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_252_5 :
    Uω (aρ 5) (bρ 5) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(3426540102006141285593 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7211012723073717 / 40000000000000000 : ℝ) ≤
      (-(3426540102006141285593 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7211012723073717 / 40000000000000000 : ℝ) =
            (7211012723073717 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7211012723073717 / 5000000000000000 : ℝ) ≤
            (732342979793858714407 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1787982195925921 / 10000000000000000 : ℝ)) (q :=
      (7211012723073717 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_252_6 :
    Uω (aρ 6) (bρ 6) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(18249705866105557760711 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6448895441245641 / 40000000000000000 : ℝ) ≤
      (-(18249705866105557760711 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6448895441245641 / 40000000000000000 : ℝ) =
            (6448895441245641 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6448895441245641 / 5000000000000000 : ℝ) ≤
            (2544709542894442239289 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1574163930151883 / 10000000000000000 : ℝ)) (q :=
      (6448895441245641 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_252_7 :
    Uω (aρ 7) (bρ 7) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(20181186557770656385763 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5316210819229457 / 40000000000000000 : ℝ) ≤
      (-(20181186557770656385763 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5316210819229457 / 40000000000000000 : ℝ) =
            (5316210819229457 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5316210819229457 / 5000000000000000 : ℝ) ≤
            (613228851229343614237 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1231482999903791 / 10000000000000000 : ℝ)) (q :=
      (5316210819229457 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_252_8 :
    Uω (aρ 8) (bρ 8) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(6179463379973671333507 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (675471839149047 / 8000000000000000 : ℝ) ≤
      (-(6179463379973671333507 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (675471839149047 / 8000000000000000 : ℝ) =
            (675471839149047 / 500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (675471839149047 / 500000000000000 : ℝ) ≤
            (752008423026328666493 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6819985493771 / 125000000000000 : ℝ)) (q :=
      (675471839149047 / 8000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_252_9 :
    Uω (aρ 9) (bρ 9) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_252_10 :
    Uω (aρ 10) (bρ 10) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_252_11 :
    Uω (aρ 11) (bρ 11) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_252_12 :
    Uω (aρ 12) (bρ 12) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_252_13 :
    Uω (aρ 13) (bρ 13) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_252_14 :
    Uω (aρ 14) (bρ 14) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_252_15 :
    Uω (aρ 15) (bρ 15) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_252_16 :
    Uω (aρ 16) (bρ 16) (6878945929459 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_252 :
    Uρ (6878945929459 / 32000000000000 : ℝ) ≤
      (-(19010913855813137707793 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (6878945929459 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7838851334268503496127 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (6878945929459 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3158894733825103070931 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (6878945929459 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8016856921198687784309 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (6878945929459 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8224642129649983668167 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (6878945929459 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3426540102006141285593 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (6878945929459 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(18249705866105557760711 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (6878945929459 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(20181186557770656385763 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (6878945929459 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6179463379973671333507 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (6878945929459 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (6878945929459 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (6878945929459 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (6878945929459 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (6878945929459 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (6878945929459 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (6878945929459 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (6878945929459 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_252_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_253_1 :
    Uω (aρ 1) (bρ 1) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(31304331795127864129 / 20000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16723418527387889 / 80000000000000000 : ℝ) ≤
      (-(31304331795127864129 / 20000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16723418527387889 / 80000000000000000 : ℝ) =
            (16723418527387889 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16723418527387889 / 10000000000000000 : ℝ) ≤
            (10284499022872135871 / 20000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2090349978681191 / 10000000000000000 : ℝ)) (q :=
      (16723418527387889 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_253_2 :
    Uω (aρ 2) (bρ 2) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(3153726373802742696967 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16529777427688981 / 80000000000000000 : ℝ) ≤
      (-(3153726373802742696967 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16529777427688981 / 80000000000000000 : ℝ) =
            (16529777427688981 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16529777427688981 / 10000000000000000 : ℝ) ≤
            (1005156707997257303033 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (64553397383327 / 312500000000000 : ℝ)) (q :=
      (16529777427688981 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_253_3 :
    Uω (aρ 3) (bρ 3) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(16007229660263138625569 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16140048501191369 / 80000000000000000 : ℝ) ≤
      (-(16007229660263138625569 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16140048501191369 / 80000000000000000 : ℝ) =
            (16140048501191369 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16140048501191369 / 10000000000000000 : ℝ) ≤
            (4787185748736861374431 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2015672590992061 / 10000000000000000 : ℝ)) (q :=
      (16140048501191369 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_253_4 :
    Uω (aρ 4) (bρ 4) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(4105406294596253327 / 2500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3096976161338029 / 16000000000000000 : ℝ) ≤
      (-(4105406294596253327 / 2500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3096976161338029 / 16000000000000000 : ℝ) =
            (3096976161338029 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3096976161338029 / 2000000000000000 : ℝ) ≤
            (1093197557653746673 / 2500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (386034969686351 / 2000000000000000 : ℝ)) (q :=
      (3096976161338029 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_253_5 :
    Uω (aρ 5) (bρ 5) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(4275732092910269981083 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14465026880361081 / 80000000000000000 : ℝ) ≤
      (-(4275732092910269981083 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (14465026880361081 / 80000000000000000 : ℝ) =
            (14465026880361081 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14465026880361081 / 10000000000000000 : ℝ) ≤
            (922871759339730018917 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1793401286184489 / 10000000000000000 : ℝ)) (q :=
      (14465026880361081 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_253_6 :
    Uω (aρ 6) (bρ 6) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(9107949270071717081159 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12941468654379713 / 80000000000000000 : ℝ) ≤
      (-(9107949270071717081159 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12941468654379713 / 80000000000000000 : ℝ) =
            (12941468654379713 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12941468654379713 / 10000000000000000 : ℝ) ≤
            (1289258434428282918841 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1579752104829147 / 10000000000000000 : ℝ)) (q :=
      (12941468654379713 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_253_7 :
    Uω (aρ 7) (bρ 7) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(2013800325814052412029 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10678435222814689 / 80000000000000000 : ℝ) ≤
      (-(2013800325814052412029 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10678435222814689 / 80000000000000000 : ℝ) =
            (10678435222814689 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10678435222814689 / 10000000000000000 : ℝ) ≤
            (65641215085947587971 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1237655127697891 / 10000000000000000 : ℝ)) (q :=
      (10678435222814689 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_253_8 :
    Uω (aρ 8) (bρ 8) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(24621121171626664245687 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6820375414613733 / 80000000000000000 : ℝ) ≤
      (-(24621121171626664245687 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (6820375414613733 / 80000000000000000 : ℝ) =
            (6820375414613733 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6820375414613733 / 5000000000000000 : ℝ) ≤
            (3104766040373335754313 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (139170456746913 / 2500000000000000 : ℝ)) (q :=
      (6820375414613733 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_253_9 :
    Uω (aρ 9) (bρ 9) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_253_10 :
    Uω (aρ 10) (bρ 10) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_253_11 :
    Uω (aρ 11) (bρ 11) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_253_12 :
    Uω (aρ 12) (bρ 12) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_253_13 :
    Uω (aρ 13) (bρ 13) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_253_14 :
    Uω (aρ 14) (bρ 14) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_253_15 :
    Uω (aρ 15) (bρ 15) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_253_16 :
    Uω (aρ 16) (bρ 16) (2758402395201 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_253 :
    Uρ (2758402395201 / 12800000000000 : ℝ) ≤
      (-(4747549936875150188239 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2758402395201 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(31304331795127864129 / 20000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2758402395201 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3153726373802742696967 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2758402395201 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(16007229660263138625569 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2758402395201 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(4105406294596253327 / 2500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2758402395201 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4275732092910269981083 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2758402395201 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9107949270071717081159 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2758402395201 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2013800325814052412029 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2758402395201 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(24621121171626664245687 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2758402395201 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2758402395201 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2758402395201 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2758402395201 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2758402395201 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2758402395201 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2758402395201 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2758402395201 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_253_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_254_1 :
    Uω (aρ 1) (bρ 1) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(15626694177986153223101 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (167660702476713 / 800000000000000 : ℝ) ≤
      (-(15626694177986153223101 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (167660702476713 / 800000000000000 : ℝ) =
            (167660702476713 / 100000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (167660702476713 / 100000000000000 : ℝ) ≤
            (5167721231013846776899 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5239204101143 / 25000000000000 : ℝ)) (q :=
      (167660702476713 / 800000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_254_2 :
    Uω (aρ 2) (bρ 2) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(15742856709703212177573 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1035777384254401 / 5000000000000000 : ℝ) ≤
      (-(15742856709703212177573 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1035777384254401 / 5000000000000000 : ℝ) =
            (1035777384254401 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1035777384254401 / 625000000000000 : ℝ) ≤
            (5051558699296787822427 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2071042628066979 / 10000000000000000 : ℝ)) (q :=
      (1035777384254401 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_254_3 :
    Uω (aρ 3) (bρ 3) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(1997601945127060592757 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (404568433500703 / 2000000000000000 : ℝ) ≤
      (-(1997601945127060592757 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (404568433500703 / 2000000000000000 : ℝ) =
            (404568433500703 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (404568433500703 / 250000000000000 : ℝ) ≤
            (601699980997939407243 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (404202706481281 / 2000000000000000 : ℝ)) (q :=
      (404568433500703 / 2000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_254_4 :
    Uω (aρ 4) (bρ 4) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(4098510704363691246301 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (30327442815377 / 156250000000000 : ℝ) ≤
      (-(4098510704363691246301 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (30327442815377 / 156250000000000 : ℝ) = (30327442815377 / 19531250000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (30327442815377 / 19531250000000 : ℝ) ≤
            (1100093147886308753699 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1935536058832631 / 10000000000000000 : ℝ)) (q :=
      (30327442815377 / 156250000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_254_5 :
    Uω (aρ 5) (bρ 5) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(4268311513824813753719 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1813503276894933 / 10000000000000000 : ℝ) ≤
      (-(4268311513824813753719 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1813503276894933 / 10000000000000000 : ℝ) =
            (1813503276894933 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1813503276894933 / 1250000000000000 : ℝ) ≤
            (930292338425186246281 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1798819851589241 / 10000000000000000 : ℝ)) (q :=
      (1813503276894933 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_254_6 :
    Uω (aρ 6) (bρ 6) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(1818221057360102248173 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1623142418528303 / 10000000000000000 : ℝ) ≤
      (-(1818221057360102248173 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1623142418528303 / 10000000000000000 : ℝ) =
            (1623142418528303 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1623142418528303 / 1250000000000000 : ℝ) ≤
            (261220483539897751827 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1585338509995981 / 10000000000000000 : ℝ)) (q :=
      (1623142418528303 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_254_7 :
    Uω (aρ 7) (bρ 7) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(10047517320976467956059 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1340552212587031 / 10000000000000000 : ℝ) ≤
      (-(10047517320976467956059 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1340552212587031 / 10000000000000000 : ℝ) =
            (1340552212587031 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1340552212587031 / 1250000000000000 : ℝ) ≤
            (349690383523532043941 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1243819478873437 / 10000000000000000 : ℝ)) (q :=
      (1340552212587031 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_254_8 :
    Uω (aρ 8) (bρ 8) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(3065785211127408859203 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1680997852639 / 19531250000000 : ℝ) ≤
      (-(3065785211127408859203 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show (1680997852639 / 19531250000000 : ℝ) = (1680997852639 / 1220703125000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1680997852639 / 1220703125000 : ℝ) ≤
            (399950690372591140797 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (567598506141711 / 10000000000000000 : ℝ)) (q :=
      (1680997852639 / 19531250000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_254_9 :
    Uω (aρ 9) (bρ 9) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_254_10 :
    Uω (aρ 10) (bρ 10) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_254_11 :
    Uω (aρ 11) (bρ 11) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_254_12 :
    Uω (aρ 12) (bρ 12) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_254_13 :
    Uω (aρ 13) (bρ 13) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_254_14 :
    Uω (aρ 14) (bρ 14) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_254_15 :
    Uω (aρ 15) (bρ 15) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_254_16 :
    Uω (aρ 16) (bρ 16) (3456533023273 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_254 :
    Uρ (3456533023273 / 16000000000000 : ℝ) ≤
      (-(9484848458057468868523 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3456533023273 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15626694177986153223101 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3456533023273 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(15742856709703212177573 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3456533023273 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1997601945127060592757 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3456533023273 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4098510704363691246301 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3456533023273 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4268311513824813753719 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3456533023273 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1818221057360102248173 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3456533023273 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(10047517320976467956059 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3456533023273 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3065785211127408859203 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3456533023273 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3456533023273 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3456533023273 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3456533023273 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3456533023273 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3456533023273 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3456533023273 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3456533023273 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_254_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_255_1 :
    Uω (aρ 1) (bρ 1) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(3900321794800609828613 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16808721959966827 / 80000000000000000 : ℝ) ≤
      (-(3900321794800609828613 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16808721959966827 / 80000000000000000 : ℝ) =
            (16808721959966827 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16808721959966827 / 10000000000000000 : ℝ) ≤
            (1298282057449390171387 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1050506650118119 / 5000000000000000 : ℝ)) (q :=
      (16808721959966827 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_255_2 :
    Uω (aρ 2) (bρ 2) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(15717147848202477416551 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3323019762827807 / 16000000000000000 : ℝ) ≤
      (-(15717147848202477416551 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3323019762827807 / 16000000000000000 : ℝ) =
            (3323019762827807 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3323019762827807 / 2000000000000000 : ℝ) ≤
            (5077267560797522583449 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (207637652628929 / 1000000000000000 : ℝ)) (q :=
      (3323019762827807 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_255_3 :
    Uω (aρ 3) (bρ 3) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(15954471174061227251973 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3245085195016607 / 16000000000000000 : ℝ) ≤
      (-(15954471174061227251973 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3245085195016607 / 16000000000000000 : ℝ) =
            (3245085195016607 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3245085195016607 / 2000000000000000 : ℝ) ≤
            (4839944234938772748027 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (202635442287529 / 1000000000000000 : ℝ)) (q :=
      (3245085195016607 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_255_4 :
    Uω (aρ 4) (bρ 4) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(255727136714500718647 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3114083995289391 / 16000000000000000 : ℝ) ≤
      (-(255727136714500718647 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3114083995289391 / 16000000000000000 : ℝ) =
            (3114083995289391 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3114083995289391 / 2000000000000000 : ℝ) ≤
            (69185604051124281353 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (194089710428127 / 1000000000000000 : ℝ)) (q :=
      (3114083995289391 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_255_5 :
    Uω (aρ 5) (bρ 5) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(17043653012069059339703 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14551023469457759 / 80000000000000000 : ℝ) ≤
      (-(17043653012069059339703 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (14551023469457759 / 80000000000000000 : ℝ) =
            (14551023469457759 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14551023469457759 / 10000000000000000 : ℝ) ≤
            (3750762396930940660297 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1804237896868971 / 10000000000000000 : ℝ)) (q :=
      (14551023469457759 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_255_6 :
    Uω (aρ 6) (bρ 6) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(18148641089420613638953 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2605760607718687 / 16000000000000000 : ℝ) ≤
      (-(18148641089420613638953 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2605760607718687 / 16000000000000000 : ℝ) =
            (2605760607718687 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2605760607718687 / 2000000000000000 : ℝ) ≤
            (2645774319579386361047 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (159092316429289 / 1000000000000000 : ℝ)) (q :=
      (2605760607718687 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_255_7 :
    Uω (aρ 7) (bρ 7) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(5013069580125437245247 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10770369532315343 / 80000000000000000 : ℝ) ≤
      (-(5013069580125437245247 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10770369532315343 / 80000000000000000 : ℝ) =
            (10770369532315343 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10770369532315343 / 10000000000000000 : ℝ) ≤
            (185534272124562754753 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1249976168483367 / 10000000000000000 : ℝ)) (q :=
      (10770369532315343 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_255_8 :
    Uω (aρ 8) (bρ 8) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(6108309044709731099283 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6949731430595183 / 80000000000000000 : ℝ) ≤
      (-(6108309044709731099283 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (6949731430595183 / 80000000000000000 : ℝ) =
            (6949731430595183 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6949731430595183 / 5000000000000000 : ℝ) ≤
            (823162758290268900717 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (578358294393327 / 10000000000000000 : ℝ)) (q :=
      (6949731430595183 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_255_9 :
    Uω (aρ 9) (bρ 9) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_255_10 :
    Uω (aρ 10) (bρ 10) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_255_11 :
    Uω (aρ 11) (bρ 11) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_255_12 :
    Uω (aρ 12) (bρ 12) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_255_13 :
    Uω (aρ 13) (bρ 13) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_255_14 :
    Uω (aρ 14) (bρ 14) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_255_15 :
    Uω (aρ 15) (bρ 15) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_255_16 :
    Uω (aρ 16) (bρ 16) (13860252210179 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_255 :
    Uρ (13860252210179 / 64000000000000 : ℝ) ≤
      (-(18949396255775099006671 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (13860252210179 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3900321794800609828613 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (13860252210179 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(15717147848202477416551 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (13860252210179 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(15954471174061227251973 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (13860252210179 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(255727136714500718647 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (13860252210179 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(17043653012069059339703 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (13860252210179 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(18148641089420613638953 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (13860252210179 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5013069580125437245247 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (13860252210179 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6108309044709731099283 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (13860252210179 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (13860252210179 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (13860252210179 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (13860252210179 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (13860252210179 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (13860252210179 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (13860252210179 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (13860252210179 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_255_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
