/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U22) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_268_1 :
    Uω (aρ 1) (bρ 1) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(7638369915361229297179 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8681596759848461 / 40000000000000000 : ℝ) ≤
      (-(7638369915361229297179 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8681596759848461 / 40000000000000000 : ℝ) =
            (8681596759848461 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8681596759848461 / 5000000000000000 : ℝ) ≤
            (2758837789138770702821 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2170324702335793 / 10000000000000000 : ℝ)) (q :=
      (8681596759848461 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_268_2 :
    Uω (aρ 2) (bρ 2) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(7694407190984975856153 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1716968271485583 / 8000000000000000 : ℝ) ≤
      (-(7694407190984975856153 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1716968271485583 / 8000000000000000 : ℝ) =
            (1716968271485583 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1716968271485583 / 1000000000000000 : ℝ) ≤
            (2702800513515024143847 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6705362542611 / 31250000000000 : ℝ)) (q :=
      (1716968271485583 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_268_3 :
    Uω (aρ 3) (bρ 3) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(3123634910807985488307 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8390180197748917 / 40000000000000000 : ℝ) ≤
      (-(3123634910807985488307 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8390180197748917 / 40000000000000000 : ℝ) =
            (8390180197748917 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8390180197748917 / 5000000000000000 : ℝ) ≤
            (1035248170992014511693 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2095781540146021 / 10000000000000000 : ℝ)) (q :=
      (8390180197748917 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_268_4 :
    Uω (aρ 4) (bρ 4) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(16015712693712828402873 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8063181324878669 / 40000000000000000 : ℝ) ≤
      (-(16015712693712828402873 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8063181324878669 / 40000000000000000 : ℝ) =
            (8063181324878669 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8063181324878669 / 5000000000000000 : ℝ) ≤
            (4778702715287171597127 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2010576284775897 / 10000000000000000 : ℝ)) (q :=
      (8063181324878669 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_268_5 :
    Uω (aρ 5) (bρ 5) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(16666826535024517328497 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7554903327646481 / 40000000000000000 : ℝ) ≤
      (-(16666826535024517328497 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7554903327646481 / 40000000000000000 : ℝ) =
            (7554903327646481 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7554903327646481 / 5000000000000000 : ℝ) ≤
            (4127588873975482671503 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1874627205494803 / 10000000000000000 : ℝ)) (q :=
      (7554903327646481 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_268_6 :
    Uω (aρ 6) (bρ 6) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(8861319087358917193727 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (54383303051121 / 320000000000000 : ℝ) ≤
      (-(8861319087358917193727 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (54383303051121 / 320000000000000 : ℝ) = (54383303051121 / 40000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (54383303051121 / 40000000000000 : ℝ) ≤
            (1535888617141082806273 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (13306978860053 / 80000000000000 : ℝ)) (q :=
      (54383303051121 / 320000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_268_7 :
    Uω (aρ 7) (bρ 7) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(1951475193735104412929 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5682573775549233 / 40000000000000000 : ℝ) ≤
      (-(1951475193735104412929 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5682573775549233 / 40000000000000000 : ℝ) =
            (5682573775549233 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5682573775549233 / 5000000000000000 : ℝ) ≤
            (127966347164895587071 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1329364185346179 / 10000000000000000 : ℝ)) (q :=
      (5682573775549233 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_268_8 :
    Uω (aρ 8) (bρ 8) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(23353858451496383736881 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3870925431047819 / 40000000000000000 : ℝ) ≤
      (-(23353858451496383736881 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3870925431047819 / 40000000000000000 : ℝ) =
            (3870925431047819 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3870925431047819 / 2500000000000000 : ℝ) ≤
            (4372028760503616263119 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (44192604027217 / 625000000000000 : ℝ)) (q :=
      (3870925431047819 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_268_9 :
    Uω (aρ 9) (bρ 9) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_268_10 :
    Uω (aρ 10) (bρ 10) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_268_11 :
    Uω (aρ 11) (bρ 11) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_268_12 :
    Uω (aρ 12) (bρ 12) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_268_13 :
    Uω (aρ 13) (bρ 13) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_268_14 :
    Uω (aρ 14) (bρ 14) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_268_15 :
    Uω (aρ 15) (bρ 15) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_268_16 :
    Uω (aρ 16) (bρ 16) (1430381373231 / 6400000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_268 :
    Uρ (1430381373231 / 6400000000000 : ℝ) ≤
      (-(18700808222836457915203 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1430381373231 / 6400000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7638369915361229297179 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1430381373231 / 6400000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(7694407190984975856153 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1430381373231 / 6400000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3123634910807985488307 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1430381373231 / 6400000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(16015712693712828402873 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1430381373231 / 6400000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(16666826535024517328497 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1430381373231 / 6400000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(8861319087358917193727 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1430381373231 / 6400000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1951475193735104412929 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1430381373231 / 6400000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(23353858451496383736881 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1430381373231 / 6400000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1430381373231 / 6400000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1430381373231 / 6400000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1430381373231 / 6400000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1430381373231 / 6400000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1430381373231 / 6400000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1430381373231 / 6400000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1430381373231 / 6400000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_268_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_269_1 :
    Uω (aρ 1) (bρ 1) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(7626102786438175269679 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17405845126262593 / 80000000000000000 : ℝ) ≤
      (-(7626102786438175269679 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17405845126262593 / 80000000000000000 : ℝ) =
            (17405845126262593 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17405845126262593 / 10000000000000000 : ℝ) ≤
            (2771104918061824730321 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2175656335682367 / 10000000000000000 : ℝ)) (q :=
      (17405845126262593 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_269_2 :
    Uω (aρ 2) (bρ 2) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(7681999553831932135529 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17212342662511157 / 80000000000000000 : ℝ) ≤
      (-(7681999553831932135529 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17212342662511157 / 80000000000000000 : ℝ) =
            (17212342662511157 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17212342662511157 / 10000000000000000 : ℝ) ≤
            (2715208150668067864471 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (537762433063627 / 2500000000000000 : ℝ)) (q :=
      (17212342662511157 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_269_3 :
    Uω (aρ 3) (bρ 3) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(7796384408299785382657 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16823046338967949 / 80000000000000000 : ℝ) ≤
      (-(7796384408299785382657 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16823046338967949 / 80000000000000000 : ℝ) =
            (16823046338967949 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16823046338967949 / 10000000000000000 : ℝ) ≤
            (2600823296200214617343 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1050560878859353 / 5000000000000000 : ℝ)) (q :=
      (16823046338967949 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_269_4 :
    Uω (aρ 4) (bρ 4) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(7994615924007200057329 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16169123213664917 / 80000000000000000 : ℝ) ≤
      (-(7994615924007200057329 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16169123213664917 / 80000000000000000 : ℝ) =
            (16169123213664917 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16169123213664917 / 10000000000000000 : ℝ) ≤
            (2402591780492799942671 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (503983789364487 / 2500000000000000 : ℝ)) (q :=
      (16169123213664917 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_269_5 :
    Uω (aρ 5) (bρ 5) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(16638428417119872482403 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15152776646850901 / 80000000000000000 : ℝ) ≤
      (-(16638428417119872482403 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (15152776646850901 / 80000000000000000 : ℝ) =
            (15152776646850901 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15152776646850901 / 10000000000000000 : ℝ) ≤
            (4155986991880127517597 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (470009608772361 / 2500000000000000 : ℝ)) (q :=
      (15152776646850901 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_269_6 :
    Uω (aρ 6) (bρ 6) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(3538128136498892697533 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13639398669702877 / 80000000000000000 : ℝ) ≤
      (-(3538128136498892697533 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13639398669702877 / 80000000000000000 : ℝ) =
            (13639398669702877 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13639398669702877 / 10000000000000000 : ℝ) ≤
            (620754945301107302467 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (834467157971219 / 5000000000000000 : ℝ)) (q :=
      (13639398669702877 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_269_7 :
    Uω (aρ 7) (bρ 7) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(4868684798127873941503 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (91285709812761 / 640000000000000 : ℝ) ≤
      (-(4868684798127873941503 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (91285709812761 / 640000000000000 : ℝ) = (91285709812761 / 80000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (91285709812761 / 80000000000000 : ℝ) ≤
            (329919054122126058497 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2670848921851 / 20000000000000 : ℝ)) (q :=
      (91285709812761 / 640000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_269_8 :
    Uω (aρ 8) (bρ 8) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(23278948388726262110201 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1560012575313533 / 16000000000000000 : ℝ) ≤
      (-(23278948388726262110201 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1560012575313533 / 16000000000000000 : ℝ) =
            (1560012575313533 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1560012575313533 / 1000000000000000 : ℝ) ≤
            (4446938823273737889799 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (143260679951727 / 2000000000000000 : ℝ)) (q :=
      (1560012575313533 / 16000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_269_9 :
    Uω (aρ 9) (bρ 9) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_269_10 :
    Uω (aρ 10) (bρ 10) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_269_11 :
    Uω (aρ 11) (bρ 11) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_269_12 :
    Uω (aρ 12) (bρ 12) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_269_13 :
    Uω (aρ 13) (bρ 13) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_269_14 :
    Uω (aρ 14) (bρ 14) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_269_15 :
    Uω (aρ 15) (bρ 15) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_269_16 :
    Uω (aρ 16) (bρ 16) (14337933849397 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_269 :
    Uρ (14337933849397 / 64000000000000 : ℝ) ≤
      (-(3736537088496720148241 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (14337933849397 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7626102786438175269679 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (14337933849397 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(7681999553831932135529 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (14337933849397 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(7796384408299785382657 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (14337933849397 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(7994615924007200057329 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (14337933849397 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(16638428417119872482403 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (14337933849397 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3538128136498892697533 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (14337933849397 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4868684798127873941503 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (14337933849397 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(23278948388726262110201 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (14337933849397 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (14337933849397 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (14337933849397 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (14337933849397 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (14337933849397 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (14337933849397 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (14337933849397 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (14337933849397 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_269_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_270_1 :
    Uω (aρ 1) (bρ 1) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(15227731364814907513837 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2181062090711159 / 10000000000000000 : ℝ) ≤
      (-(15227731364814907513837 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2181062090711159 / 10000000000000000 : ℝ) =
            (2181062090711159 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2181062090711159 / 1250000000000000 : ℝ) ≤
            (5566684044185092486163 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2180987967244193 / 10000000000000000 : ℝ)) (q :=
      (2181062090711159 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_270_2 :
    Uω (aρ 2) (bρ 2) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(7669622644416340882011 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (431375064042287 / 2000000000000000 : ℝ) ≤
      (-(7669622644416340882011 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (431375064042287 / 2000000000000000 : ℝ) =
            (431375064042287 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (431375064042287 / 250000000000000 : ℝ) ≤
            (2727585060083659117989 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (431276687750949 / 2000000000000000 : ℝ)) (q :=
      (431375064042287 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_270_3 :
    Uω (aρ 3) (bρ 3) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(15567427568303136711517 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4216433025271839 / 20000000000000000 : ℝ) ≤
      (-(15567427568303136711517 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4216433025271839 / 20000000000000000 : ℝ) =
            (4216433025271839 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4216433025271839 / 2500000000000000 : ℝ) ≤
            (5226987840696863288483 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1053230964976857 / 5000000000000000 : ℝ)) (q :=
      (4216433025271839 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_270_4 :
    Uω (aρ 4) (bρ 4) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(7981410650442638429787 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4052970798400113 / 20000000000000000 : ℝ) ≤
      (-(7981410650442638429787 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4052970798400113 / 20000000000000000 : ℝ) =
            (4052970798400113 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4052970798400113 / 2500000000000000 : ℝ) ≤
            (2415797054057361570213 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (505323471036747 / 2500000000000000 : ℝ)) (q :=
      (4052970798400113 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_270_5 :
    Uω (aρ 5) (bρ 5) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(16610111915455838225121 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (759787240803271 / 4000000000000000 : ℝ) ≤
      (-(16610111915455838225121 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (759787240803271 / 4000000000000000 : ℝ) =
            (759787240803271 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (759787240803271 / 500000000000000 : ℝ) ≤
            (4184303493544161774879 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (188544920909823 / 1000000000000000 : ℝ)) (q :=
      (759787240803271 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_270_6 :
    Uω (aρ 6) (bρ 6) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(17658749634887927061711 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (855185348357439 / 5000000000000000 : ℝ) ≤
      (-(17658749634887927061711 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (855185348357439 / 5000000000000000 : ℝ) =
            (855185348357439 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (855185348357439 / 625000000000000 : ℝ) ≤
            (3135665774112072938289 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1674494773651631 / 10000000000000000 : ℝ)) (q :=
      (855185348357439 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_270_7 :
    Uω (aρ 7) (bρ 7) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(9717453763183694041361 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2864063784966021 / 20000000000000000 : ℝ) ≤
      (-(9717453763183694041361 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2864063784966021 / 20000000000000000 : ℝ) =
            (2864063784966021 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2864063784966021 / 2500000000000000 : ℝ) ≤
            (679753941316305958639 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (167684818243487 / 1250000000000000 : ℝ)) (q :=
      (2864063784966021 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_270_8 :
    Uω (aρ 8) (bρ 8) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(5801248140116723696391 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (491122670330093 / 5000000000000000 : ℝ) ≤
      (-(5801248140116723696391 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (491122670330093 / 5000000000000000 : ℝ) =
            (491122670330093 / 312500000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (491122670330093 / 312500000000000 : ℝ) ≤
            (1130223662883276303609 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (725447093642247 / 10000000000000000 : ℝ)) (q :=
      (491122670330093 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_270_9 :
    Uω (aρ 9) (bρ 9) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_270_10 :
    Uω (aρ 10) (bρ 10) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_270_11 :
    Uω (aρ 11) (bρ 11) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_270_12 :
    Uω (aρ 12) (bρ 12) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_270_13 :
    Uω (aρ 13) (bρ 13) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_270_14 :
    Uω (aρ 14) (bρ 14) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_270_15 :
    Uω (aρ 15) (bρ 15) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_270_16 :
    Uω (aρ 16) (bρ 16) (3593013491621 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_270 :
    Uρ (3593013491621 / 16000000000000 : ℝ) ≤
      (-(2333085713962513780869 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3593013491621 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15227731364814907513837 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3593013491621 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(7669622644416340882011 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3593013491621 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(15567427568303136711517 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3593013491621 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(7981410650442638429787 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3593013491621 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(16610111915455838225121 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3593013491621 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(17658749634887927061711 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3593013491621 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(9717453763183694041361 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3593013491621 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(5801248140116723696391 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3593013491621 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3593013491621 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3593013491621 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3593013491621 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3593013491621 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3593013491621 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3593013491621 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3593013491621 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_270_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_271_1 :
    Uω (aρ 1) (bρ 1) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(7601658456640705685281 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3498229663605839 / 16000000000000000 : ℝ) ≤
      (-(7601658456640705685281 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3498229663605839 / 16000000000000000 : ℝ) =
            (3498229663605839 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3498229663605839 / 2000000000000000 : ℝ) ≤
            (2795549247859294314719 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (218631959703433 / 1000000000000000 : ℝ)) (q :=
      (3498229663605839 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_271_2 :
    Uω (aρ 2) (bρ 2) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(15314552621698947647151 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17297662412755607 / 80000000000000000 : ℝ) ≤
      (-(15314552621698947647151 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17297662412755607 / 80000000000000000 : ℝ) =
            (17297662412755607 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17297662412755607 / 10000000000000000 : ℝ) ≤
            (5479862787301052352849 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2161717133225933 / 10000000000000000 : ℝ)) (q :=
      (17297662412755607 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_271_3 :
    Uω (aρ 3) (bρ 3) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(7771075241021788038101 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3381683536646363 / 16000000000000000 : ℝ) ≤
      (-(7771075241021788038101 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3381683536646363 / 16000000000000000 : ℝ) =
            (3381683536646363 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3381683536646363 / 2000000000000000 : ℝ) ≤
            (2626132463478211961899 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (422360411438997 / 2000000000000000 : ℝ)) (q :=
      (3381683536646363 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_271_4 :
    Uω (aρ 4) (bρ 4) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(15936480678178473697243 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3250928518839247 / 16000000000000000 : ℝ) ≤
      (-(15936480678178473697243 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3250928518839247 / 16000000000000000 : ℝ) =
            (3250928518839247 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3250928518839247 / 2000000000000000 : ℝ) ≤
            (4857934730821526302757 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (202665246600109 / 1000000000000000 : ℝ)) (q :=
      (3250928518839247 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_271_5 :
    Uω (aρ 5) (bρ 5) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(103636728471640727917 / 62500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15238711178580651 / 80000000000000000 : ℝ) ≤
      (-(103636728471640727917 / 62500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (15238711178580651 / 80000000000000000 : ℝ) =
            (15238711178580651 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15238711178580651 / 10000000000000000 : ℝ) ≤
            (26328367834609272083 / 62500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (945429765716097 / 5000000000000000 : ℝ)) (q :=
      (15238711178580651 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_271_6 :
    Uω (aρ 6) (bρ 6) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(17626964297738276232173 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13726526534431967 / 80000000000000000 : ℝ) ≤
      (-(17626964297738276232173 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13726526534431967 / 80000000000000000 : ℝ) =
            (13726526534431967 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13726526534431967 / 10000000000000000 : ℝ) ≤
            (3167451111261723767827 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1680053745535023 / 10000000000000000 : ℝ)) (q :=
      (13726526534431967 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_271_7 :
    Uω (aρ 7) (bρ 7) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(9697627563002555907191 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11501772124656023 / 80000000000000000 : ℝ) ≤
      (-(9697627563002555907191 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11501772124656023 / 80000000000000000 : ℝ) =
            (11501772124656023 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11501772124656023 / 10000000000000000 : ℝ) ≤
            (699580141497444092809 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1347526523851037 / 10000000000000000 : ℝ)) (q :=
      (11501772124656023 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_271_8 :
    Uω (aρ 8) (bρ 8) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(23131959300184916443993 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7915562066343051 / 80000000000000000 : ℝ) ≤
      (-(23131959300184916443993 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (7915562066343051 / 80000000000000000 : ℝ) =
            (7915562066343051 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7915562066343051 / 5000000000000000 : ℝ) ≤
            (4593927911815083556007 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (367257830306397 / 5000000000000000 : ℝ)) (q :=
      (7915562066343051 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_271_9 :
    Uω (aρ 9) (bρ 9) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_271_10 :
    Uω (aρ 10) (bρ 10) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_271_11 :
    Uω (aρ 11) (bρ 11) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_271_12 :
    Uω (aρ 12) (bρ 12) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_271_13 :
    Uω (aρ 13) (bρ 13) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_271_14 :
    Uω (aρ 14) (bρ 14) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_271_15 :
    Uω (aρ 15) (bρ 15) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_271_16 :
    Uω (aρ 16) (bρ 16) (14406174083571 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_271 :
    Uρ (14406174083571 / 64000000000000 : ℝ) ≤
      (-(18646805938925348800429 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (14406174083571 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7601658456640705685281 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (14406174083571 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(15314552621698947647151 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (14406174083571 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(7771075241021788038101 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (14406174083571 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(15936480678178473697243 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (14406174083571 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(103636728471640727917 / 62500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (14406174083571 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(17626964297738276232173 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (14406174083571 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(9697627563002555907191 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (14406174083571 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(23131959300184916443993 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (14406174083571 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (14406174083571 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (14406174083571 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (14406174083571 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (14406174083571 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (14406174083571 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (14406174083571 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (14406174083571 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_271_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_272_1 :
    Uω (aρ 1) (bρ 1) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(15178961927162266424097 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8766899951667041 / 40000000000000000 : ℝ) ≤
      (-(15178961927162266424097 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8766899951667041 / 40000000000000000 : ℝ) =
            (8766899951667041 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8766899951667041 / 5000000000000000 : ℝ) ≤
            (5615453481837733575903 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (547912806266427 / 2500000000000000 : ℝ)) (q :=
      (8766899951667041 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_272_2 :
    Uω (aρ 2) (bρ 2) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(1528992080473304163929 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8670161108029413 / 40000000000000000 : ℝ) ≤
      (-(1528992080473304163929 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8670161108029413 / 40000000000000000 : ℝ) =
            (8670161108029413 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8670161108029413 / 5000000000000000 : ℝ) ≤
            (550449460426695836071 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1083525407878447 / 5000000000000000 : ℝ)) (q :=
      (8670161108029413 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_272_3 :
    Uω (aρ 3) (bρ 3) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(3879234308300097326093 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1695110308676319 / 8000000000000000 : ℝ) ≤
      (-(3879234308300097326093 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1695110308676319 / 8000000000000000 : ℝ) =
            (1695110308676319 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1695110308676319 / 1000000000000000 : ℝ) ≤
            (1319369543949902673907 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (423428427956597 / 2000000000000000 : ℝ)) (q :=
      (1695110308676319 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_272_4 :
    Uω (aρ 4) (bρ 4) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(15910209608740880248149 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8148700710017781 / 40000000000000000 : ℝ) ≤
      (-(15910209608740880248149 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8148700710017781 / 40000000000000000 : ℝ) =
            (8148700710017781 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8148700710017781 / 5000000000000000 : ℝ) ≤
            (4884205800259119751851 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1016005452083039 / 5000000000000000 : ℝ)) (q :=
      (8148700710017781 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_272_5 :
    Uω (aρ 5) (bρ 5) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(16553721866754159805869 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7640837874930451 / 40000000000000000 : ℝ) ≤
      (-(16553721866754159805869 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7640837874930451 / 40000000000000000 : ℝ) =
            (7640837874930451 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7640837874930451 / 5000000000000000 : ℝ) ≤
            (4240693542245840194131 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1896269405957413 / 10000000000000000 : ℝ)) (q :=
      (7640837874930451 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_272_6 :
    Uω (aρ 6) (bρ 6) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(54985262327256662747 / 31250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6885040805321457 / 40000000000000000 : ℝ) ≤
      (-(54985262327256662747 / 31250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6885040805321457 / 40000000000000000 : ℝ) =
            (6885040805321457 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6885040805321457 / 5000000000000000 : ℝ) ≤
            (9997285825868337253 / 31250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (421402811573229 / 2500000000000000 : ℝ)) (q :=
      (6885040805321457 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_272_7 :
    Uω (aρ 7) (bρ 7) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(19355780207743348837579 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5773632504211469 / 40000000000000000 : ℝ) ≤
      (-(19355780207743348837579 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5773632504211469 / 40000000000000000 : ℝ) =
            (5773632504211469 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5773632504211469 / 5000000000000000 : ℝ) ≤
            (1438635201256651162421 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (676784238248961 / 5000000000000000 : ℝ)) (q :=
      (5773632504211469 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_272_8 :
    Uω (aρ 8) (bρ 8) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(23059818675209941582027 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3986435947795567 / 40000000000000000 : ℝ) ≤
      (-(23059818675209941582027 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3986435947795567 / 40000000000000000 : ℝ) =
            (3986435947795567 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3986435947795567 / 2500000000000000 : ℝ) ≤
            (4666068536790058417973 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (743511849629971 / 10000000000000000 : ℝ)) (q :=
      (3986435947795567 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_272_9 :
    Uω (aρ 9) (bρ 9) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_272_10 :
    Uω (aρ 10) (bρ 10) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_272_11 :
    Uω (aρ 11) (bρ 11) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_272_12 :
    Uω (aρ 12) (bρ 12) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_272_13 :
    Uω (aρ 13) (bρ 13) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_272_14 :
    Uω (aρ 14) (bρ 14) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_272_15 :
    Uω (aρ 15) (bρ 15) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_272_16 :
    Uω (aρ 16) (bρ 16) (7220147100329 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_272 :
    Uρ (7220147100329 / 32000000000000 : ℝ) ≤
      (-(9314521594811334388811 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (7220147100329 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15178961927162266424097 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (7220147100329 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1528992080473304163929 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (7220147100329 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3879234308300097326093 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (7220147100329 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(15910209608740880248149 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (7220147100329 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(16553721866754159805869 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (7220147100329 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(54985262327256662747 / 31250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (7220147100329 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(19355780207743348837579 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (7220147100329 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(23059818675209941582027 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (7220147100329 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (7220147100329 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (7220147100329 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (7220147100329 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (7220147100329 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (7220147100329 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (7220147100329 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (7220147100329 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_272_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_273_1 :
    Uω (aρ 1) (bρ 1) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(15154666117466165170289 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3515290296331029 / 16000000000000000 : ℝ) ≤
      (-(15154666117466165170289 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3515290296331029 / 16000000000000000 : ℝ) =
            (3515290296331029 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3515290296331029 / 2000000000000000 : ℝ) ≤
            (5639749291533834829711 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (219698285135113 / 1000000000000000 : ℝ)) (q :=
      (3515290296331029 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_273_2 :
    Uω (aρ 2) (bρ 2) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(3816337384657765063509 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (695319278878117 / 3200000000000000 : ℝ) ≤
      (-(3816337384657765063509 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (695319278878117 / 3200000000000000 : ℝ) =
            (695319278878117 / 400000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (695319278878117 / 400000000000000 : ℝ) ≤
            (1382266467592234936491 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (86895379457423 / 400000000000000 : ℝ)) (q :=
      (695319278878117 / 3200000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_273_3 :
    Uω (aρ 3) (bρ 3) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(7745893749807219680829 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16993788313029637 / 80000000000000000 : ℝ) ≤
      (-(7745893749807219680829 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16993788313029637 / 80000000000000000 : ℝ) =
            (16993788313029637 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16993788313029637 / 10000000000000000 : ℝ) ≤
            (2651313954692780319171 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2122482178054753 / 10000000000000000 : ℝ)) (q :=
      (16993788313029637 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_273_4 :
    Uω (aρ 4) (bρ 4) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(15884007724381241620549 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16340159675653393 / 80000000000000000 : ℝ) ≤
      (-(15884007724381241620549 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16340159675653393 / 80000000000000000 : ℝ) =
            (16340159675653393 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16340159675653393 / 10000000000000000 : ℝ) ≤
            (4910407684618758379451 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (509342299943923 / 2500000000000000 : ℝ)) (q :=
      (16340159675653393 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_273_5 :
    Uω (aρ 5) (bρ 5) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(4131411845769879803169 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15324638545193217 / 80000000000000000 : ℝ) ≤
      (-(4131411845769879803169 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (15324638545193217 / 80000000000000000 : ℝ) =
            (15324638545193217 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15324638545193217 / 10000000000000000 : ℝ) ≤
            (1067192006480120196831 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (59427463640489 / 312500000000000 : ℝ)) (q :=
      (15324638545193217 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_273_6 :
    Uω (aρ 6) (bρ 6) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(4390926964309566989123 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13813630860364677 / 80000000000000000 : ℝ) ≤
      (-(4390926964309566989123 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13813630860364677 / 80000000000000000 : ℝ) =
            (13813630860364677 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13813630860364677 / 10000000000000000 : ℝ) ≤
            (807676887940433010877 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1691167290428513 / 10000000000000000 : ℝ)) (q :=
      (13813630860364677 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_273_7 :
    Uω (aρ 7) (bρ 7) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(9658240508237714690711 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11592734112472793 / 80000000000000000 : ℝ) ≤
      (-(9658240508237714690711 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11592734112472793 / 80000000000000000 : ℝ) =
            (11592734112472793 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11592734112472793 / 10000000000000000 : ℝ) ≤
            (738967196262285309289 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (679802242107771 / 5000000000000000 : ℝ)) (q :=
      (11592734112472793 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_273_8 :
    Uω (aρ 8) (bρ 8) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(22988542356000148652769 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8029902597296329 / 80000000000000000 : ℝ) ≤
      (-(22988542356000148652769 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8029902597296329 / 80000000000000000 : ℝ) =
            (8029902597296329 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8029902597296329 / 5000000000000000 : ℝ) ≤
            (4737344855999851347231 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (376219128380713 / 5000000000000000 : ℝ)) (q :=
      (8029902597296329 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_273_9 :
    Uω (aρ 9) (bρ 9) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_273_10 :
    Uω (aρ 10) (bρ 10) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_273_11 :
    Uω (aρ 11) (bρ 11) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_273_12 :
    Uω (aρ 12) (bρ 12) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_273_13 :
    Uω (aρ 13) (bρ 13) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_273_14 :
    Uω (aρ 14) (bρ 14) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_273_15 :
    Uω (aρ 15) (bρ 15) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_273_16 :
    Uω (aρ 16) (bρ 16) (2894882863549 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_273 :
    Uρ (2894882863549 / 12800000000000 : ℝ) ≤
      (-(9305697337325464503709 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2894882863549 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15154666117466165170289 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2894882863549 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3816337384657765063509 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2894882863549 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(7745893749807219680829 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2894882863549 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(15884007724381241620549 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2894882863549 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4131411845769879803169 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2894882863549 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4390926964309566989123 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2894882863549 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(9658240508237714690711 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2894882863549 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(22988542356000148652769 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2894882863549 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2894882863549 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2894882863549 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2894882863549 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2894882863549 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2894882863549 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2894882863549 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2894882863549 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_273_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_274_1 :
    Uω (aρ 1) (bρ 1) (906783402177 / 4000000000000 : ℝ) ≤
      (-(15130429197303497441467 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2202387881630389 / 10000000000000000 : ℝ) ≤
      (-(15130429197303497441467 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2202387881630389 / 10000000000000000 : ℝ) =
            (2202387881630389 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2202387881630389 / 1250000000000000 : ℝ) ≤
            (5663986211696502558533 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1101157237951639 / 5000000000000000 : ℝ)) (q :=
      (2202387881630389 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_274_2 :
    Uω (aρ 2) (bρ 2) (906783402177 / 4000000000000 : ℝ) ≤
      (-(15240838526292947970749 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2178205210098281 / 10000000000000000 : ℝ) ≤
      (-(15240838526292947970749 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2178205210098281 / 10000000000000000 : ℝ) =
            (2178205210098281 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2178205210098281 / 1250000000000000 : ℝ) ≤
            (5553576882707052029251 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1088859072674531 / 5000000000000000 : ℝ)) (q :=
      (2178205210098281 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_274_3 :
    Uω (aρ 3) (bρ 3) (906783402177 / 4000000000000 : ℝ) ≤
      (-(3866675240390775093581 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26619489630259 / 125000000000000 : ℝ) ≤
      (-(3866675240390775093581 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (26619489630259 / 125000000000000 : ℝ) = (26619489630259 / 15625000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26619489630259 / 15625000000000 : ℝ) ≤
            (1331928611859224906419 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (106391108617197 / 500000000000000 : ℝ)) (q :=
      (26619489630259 / 125000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_274_4 :
    Uω (aρ 4) (bρ 4) (906783402177 / 4000000000000 : ℝ) ≤
      (-(15857874659838571656279 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4095729341384249 / 20000000000000000 : ℝ) ≤
      (-(15857874659838571656279 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4095729341384249 / 20000000000000000 : ℝ) =
            (4095729341384249 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4095729341384249 / 2500000000000000 : ℝ) ≤
            (4936540749161428343721 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2042727353951749 / 10000000000000000 : ℝ)) (q :=
      (4095729341384249 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_274_5 :
    Uω (aρ 5) (bρ 5) (906783402177 / 4000000000000 : ℝ) ≤
      (-(6444395563387845643 / 3906250000000000000 : ℝ)) := by
  have hlg :
    Real.log (960474973730623 / 5000000000000000 : ℝ) ≤
      (-(6444395563387845643 / 3906250000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (960474973730623 / 5000000000000000 : ℝ) =
            (960474973730623 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (960474973730623 / 625000000000000 : ℝ) ≤
            (1678422955752779357 / 3906250000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (59596494588281 / 312500000000000 : ℝ)) (q :=
      (960474973730623 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_274_6 :
    Uω (aρ 6) (bρ 6) (906783402177 / 4000000000000 : ℝ) ≤
      (-(17532235324295299403419 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3464293585208773 / 20000000000000000 : ℝ) ≤
      (-(17532235324295299403419 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3464293585208773 / 20000000000000000 : ℝ) =
            (3464293585208773 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3464293585208773 / 2500000000000000 : ℝ) ≤
            (3262180084704700596581 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1696721892251273 / 10000000000000000 : ℝ)) (q :=
      (3464293585208773 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_274_7 :
    Uω (aρ 7) (bρ 7) (906783402177 / 4000000000000 : ℝ) ≤
      (-(4819338956257651832129 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2909544938029893 / 20000000000000000 : ℝ) ≤
      (-(4819338956257651832129 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2909544938029893 / 20000000000000000 : ℝ) =
            (2909544938029893 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2909544938029893 / 2500000000000000 : ℝ) ≤
            (379264895992348167871 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1365634625832393 / 10000000000000000 : ℝ)) (q :=
      (2909544938029893 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_274_8 :
    Uω (aρ 8) (bρ 8) (906783402177 / 4000000000000 : ℝ) ≤
      (-(11459051748918678550413 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2021665997500307 / 20000000000000000 : ℝ) ≤
      (-(11459051748918678550413 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2021665997500307 / 20000000000000000 : ℝ) =
            (2021665997500307 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2021665997500307 / 1250000000000000 : ℝ) ≤
            (2403891857081321449587 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (761297336642807 / 10000000000000000 : ℝ)) (q :=
      (2021665997500307 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_274_9 :
    Uω (aρ 9) (bρ 9) (906783402177 / 4000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_274_10 :
    Uω (aρ 10) (bρ 10) (906783402177 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_274_11 :
    Uω (aρ 11) (bρ 11) (906783402177 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_274_12 :
    Uω (aρ 12) (bρ 12) (906783402177 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_274_13 :
    Uω (aρ 13) (bρ 13) (906783402177 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_274_14 :
    Uω (aρ 14) (bρ 14) (906783402177 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_274_15 :
    Uω (aρ 15) (bρ 15) (906783402177 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_274_16 :
    Uω (aρ 16) (bρ 16) (906783402177 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_274 :
    Uρ (906783402177 / 4000000000000 : ℝ) ≤
      (-(9296928869868299308561 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (906783402177 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15130429197303497441467 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (906783402177 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(15240838526292947970749 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (906783402177 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3866675240390775093581 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (906783402177 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(15857874659838571656279 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (906783402177 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(6444395563387845643 / 3906250000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (906783402177 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(17532235324295299403419 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (906783402177 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4819338956257651832129 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (906783402177 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(11459051748918678550413 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (906783402177 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (906783402177 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (906783402177 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (906783402177 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (906783402177 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (906783402177 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (906783402177 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (906783402177 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_274_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_275_1 :
    Uω (aρ 1) (bρ 1) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(15106250881866031193979 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17661754617548211 / 80000000000000000 : ℝ) ≤
      (-(15106250881866031193979 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17661754617548211 / 80000000000000000 : ℝ) =
            (17661754617548211 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17661754617548211 / 10000000000000000 : ℝ) ≤
            (5688164527133968806021 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2207646098734709 / 10000000000000000 : ℝ)) (q :=
      (17661754617548211 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_275_2 :
    Uω (aρ 2) (bρ 2) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(15216387472800909762541 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17468301342903727 / 80000000000000000 : ℝ) ≤
      (-(15216387472800909762541 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17468301342903727 / 80000000000000000 : ℝ) =
            (17468301342903727 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17468301342903727 / 10000000000000000 : ℝ) ≤
            (5578027936199090237459 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (545762948145897 / 2500000000000000 : ℝ)) (q :=
      (17468301342903727 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_275_3 :
    Uω (aρ 3) (bρ 3) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(15441677301735706487299 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17079158239092787 / 80000000000000000 : ℝ) ≤
      (-(15441677301735706487299 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17079158239092787 / 80000000000000000 : ℝ) =
            (17079158239092787 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17079158239092787 / 10000000000000000 : ℝ) ≤
            (5352738107264293512701 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2133162122980853 / 10000000000000000 : ℝ)) (q :=
      (17079158239092787 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_275_4 :
    Uω (aρ 4) (bρ 4) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(633272402110040347591 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16425674494126547 / 80000000000000000 : ℝ) ≤
      (-(633272402110040347591 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16425674494126547 / 80000000000000000 : ℝ) =
            (16425674494126547 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16425674494126547 / 10000000000000000 : ℝ) ≤
            (198504214249959652409 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2048085367804293 / 10000000000000000 : ℝ)) (q :=
      (16425674494126547 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_275_5 :
    Uω (aρ 5) (bρ 5) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(8234868593102955975117 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15410558868291319 / 80000000000000000 : ℝ) ≤
      (-(8234868593102955975117 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (15410558868291319 / 80000000000000000 : ℝ) =
            (15410558868291319 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15410558868291319 / 10000000000000000 : ℝ) ≤
            (2162339111397044024883 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (956248190340243 / 5000000000000000 : ℝ)) (q :=
      (15410558868291319 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_275_6 :
    Uω (aρ 6) (bρ 6) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(17500865642401456087003 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13900712108530163 / 80000000000000000 : ℝ) ≤
      (-(17500865642401456087003 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13900712108530163 / 80000000000000000 : ℝ) =
            (13900712108530163 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13900712108530163 / 10000000000000000 : ℝ) ≤
            (3293549766598543912997 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1702275065880197 / 10000000000000000 : ℝ)) (q :=
      (13900712108530163 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_275_7 :
    Uω (aρ 7) (bρ 7) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(384768058671075131277 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11683602236828703 / 80000000000000000 : ℝ) ≤
      (-(384768058671075131277 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (11683602236828703 / 80000000000000000 : ℝ) =
            (11683602236828703 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11683602236828703 / 10000000000000000 : ℝ) ≤
            (31120249508924868723 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (85728686169677 / 625000000000000 : ℝ)) (q :=
      (11683602236828703 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_275_8 :
    Uω (aρ 8) (bρ 8) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(22848476633536171818119 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8143165368057791 / 80000000000000000 : ℝ) ≤
      (-(22848476633536171818119 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8143165368057791 / 80000000000000000 : ℝ) =
            (8143165368057791 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8143165368057791 / 5000000000000000 : ℝ) ≤
            (4877410578463828181881 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (96261426607763 / 1250000000000000 : ℝ)) (q :=
      (8143165368057791 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_275_9 :
    Uω (aρ 9) (bρ 9) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_275_10 :
    Uω (aρ 10) (bρ 10) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_275_11 :
    Uω (aρ 11) (bρ 11) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_275_12 :
    Uω (aρ 12) (bρ 12) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_275_13 :
    Uω (aρ 13) (bρ 13) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_275_14 :
    Uω (aρ 14) (bρ 14) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_275_15 :
    Uω (aρ 15) (bρ 15) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_275_16 :
    Uω (aρ 16) (bρ 16) (14542654551919 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_275 :
    Uρ (14542654551919 / 64000000000000 : ℝ) ≤
      (-(290256716498770197431 / 156250000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (14542654551919 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15106250881866031193979 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (14542654551919 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(15216387472800909762541 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (14542654551919 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(15441677301735706487299 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (14542654551919 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(633272402110040347591 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (14542654551919 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8234868593102955975117 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (14542654551919 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(17500865642401456087003 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (14542654551919 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(384768058671075131277 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (14542654551919 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(22848476633536171818119 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (14542654551919 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (14542654551919 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (14542654551919 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (14542654551919 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (14542654551919 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (14542654551919 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (14542654551919 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (14542654551919 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_275_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_276_1 :
    Uω (aρ 1) (bρ 1) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(1508213088840681581873 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8852203087610097 / 40000000000000000 : ℝ) ≤
      (-(1508213088840681581873 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8852203087610097 / 40000000000000000 : ℝ) =
            (8852203087610097 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8852203087610097 / 5000000000000000 : ℝ) ≤
            (571228452059318418127 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2212977719857861 / 10000000000000000 : ℝ)) (q :=
      (8852203087610097 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_276_2 :
    Uω (aρ 2) (bρ 2) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(15191996085398068846649 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8755480479323473 / 40000000000000000 : ℝ) ≤
      (-(15191996085398068846649 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8755480479323473 / 40000000000000000 : ℝ) =
            (8755480479323473 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8755480479323473 / 5000000000000000 : ℝ) ≤
            (5602419323601931153351 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2188385428224549 / 10000000000000000 : ℝ)) (q :=
      (8755480479323473 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_276_3 :
    Uω (aρ 3) (bρ 3) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(3854179051302327034767 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8560921470759373 / 40000000000000000 : ℝ) ≤
      (-(3854179051302327034767 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8560921470759373 / 40000000000000000 : ℝ) =
            (8560921470759373 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8560921470759373 / 5000000000000000 : ℝ) ≤
            (1344424800947672965233 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2138502030292499 / 10000000000000000 : ℝ)) (q :=
      (8560921470759373 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_276_4 :
    Uω (aρ 4) (bρ 4) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(1975726692953131972251 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1646843106581577 / 8000000000000000 : ℝ) ≤
      (-(1975726692953131972251 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1646843106581577 / 8000000000000000 : ℝ) =
            (1646843106581577 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1646843106581577 / 1000000000000000 : ℝ) ≤
            (623575233171868027749 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (410688648486351 / 2000000000000000 : ℝ)) (q :=
      (1646843106581577 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_276_5 :
    Uω (aρ 5) (bρ 5) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(328838011214802240827 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7726758212883863 / 40000000000000000 : ℝ) ≤
      (-(328838011214802240827 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7726758212883863 / 40000000000000000 : ℝ) =
            (7726758212883863 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7726758212883863 / 5000000000000000 : ℝ) ≤
            (87050296965197759173 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (239738062719343 / 1250000000000000 : ℝ)) (q :=
      (7726758212883863 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_276_6 :
    Uω (aρ 6) (bρ 6) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(17469598115456413670451 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6972122109588451 / 40000000000000000 : ℝ) ≤
      (-(17469598115456413670451 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6972122109588451 / 40000000000000000 : ℝ) =
            (6972122109588451 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6972122109588451 / 5000000000000000 : ℝ) ≤
            (3324817293543586329549 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (853913412623519 / 5000000000000000 : ℝ)) (q :=
      (6972122109588451 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_276_7 :
    Uω (aρ 7) (bρ 7) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(3839924133780546951883 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5864500935179073 / 40000000000000000 : ℝ) ≤
      (-(3839924133780546951883 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5864500935179073 / 40000000000000000 : ℝ) =
            (5864500935179073 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5864500935179073 / 5000000000000000 : ℝ) ≤
            (318958948019453048117 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1377677618802349 / 10000000000000000 : ℝ)) (q :=
      (5864500935179073 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_276_8 :
    Uω (aρ 8) (bρ 8) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(2277963757593818057009 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4099707769672261 / 40000000000000000 : ℝ) ≤
      (-(2277963757593818057009 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4099707769672261 / 40000000000000000 : ℝ) =
            (4099707769672261 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4099707769672261 / 2500000000000000 : ℝ) ≤
            (494624963606181942991 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (778822687388943 / 10000000000000000 : ℝ)) (q :=
      (4099707769672261 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_276_9 :
    Uω (aρ 9) (bρ 9) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_276_10 :
    Uω (aρ 10) (bρ 10) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_276_11 :
    Uω (aρ 11) (bρ 11) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_276_12 :
    Uω (aρ 12) (bρ 12) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_276_13 :
    Uω (aρ 13) (bρ 13) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_276_14 :
    Uω (aρ 14) (bρ 14) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_276_15 :
    Uω (aρ 15) (bρ 15) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_276_16 :
    Uω (aρ 16) (bρ 16) (7288387334503 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_276 :
    Uρ (7288387334503 / 32000000000000 : ℝ) ≤
      (-(4639777152719005169681 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (7288387334503 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1508213088840681581873 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (7288387334503 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(15191996085398068846649 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (7288387334503 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3854179051302327034767 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (7288387334503 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1975726692953131972251 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (7288387334503 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(328838011214802240827 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (7288387334503 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(17469598115456413670451 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (7288387334503 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3839924133780546951883 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (7288387334503 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2277963757593818057009 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (7288387334503 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (7288387334503 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (7288387334503 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (7288387334503 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (7288387334503 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (7288387334503 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (7288387334503 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (7288387334503 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_276_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_277_1 :
    Uω (aρ 1) (bρ 1) (732250745159 / 3200000000000 : ℝ) ≤
      (-(15034064746622953868251 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (88948546351307 / 400000000000000 : ℝ) ≤
      (-(15034064746622953868251 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (88948546351307 / 400000000000000 : ℝ) = (88948546351307 / 50000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (88948546351307 / 50000000000000 : ℝ) ≤
            (5760350662377046131749 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (88945638281139 / 400000000000000 : ℝ)) (q :=
      (88948546351307 / 400000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_277_2 :
    Uω (aρ 2) (bρ 2) (732250745159 / 3200000000000 : ℝ) ≤
      (-(3028678229702195023461 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27494187581813 / 125000000000000 : ℝ) ≤
      (-(3028678229702195023461 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (27494187581813 / 125000000000000 : ℝ) = (27494187581813 / 15625000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27494187581813 / 15625000000000 : ℝ) ≤
            (1130204852097804976539 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (439810533012641 / 2000000000000000 : ℝ)) (q :=
      (27494187581813 / 125000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_277_3 :
    Uω (aρ 3) (bρ 3) (732250745159 / 3200000000000 : ℝ) ≤
      (-(384174511354075211361 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34414423663269 / 160000000000000 : ℝ) ≤
      (-(384174511354075211361 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (34414423663269 / 160000000000000 : ℝ) = (34414423663269 / 20000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34414423663269 / 20000000000000 : ℝ) ≤
            (135685873870924788639 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (8596726864927 / 40000000000000 : ℝ)) (q :=
      (34414423663269 / 160000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_277_4 :
    Uω (aρ 4) (bρ 4) (732250745159 / 3200000000000 : ℝ) ≤
      (-(7877011697722102677853 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4138485638959871 / 20000000000000000 : ℝ) ≤
      (-(7877011697722102677853 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4138485638959871 / 20000000000000000 : ℝ) =
            (4138485638959871 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4138485638959871 / 2500000000000000 : ℝ) ≤
            (2520196006777897322147 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (516039644586999 / 2500000000000000 : ℝ)) (q :=
      (4138485638959871 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_277_5 :
    Uω (aρ 5) (bρ 5) (732250745159 / 3200000000000 : ℝ) ≤
      (-(4096615501181864826651 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3884856601398333 / 20000000000000000 : ℝ) ≤
      (-(4096615501181864826651 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3884856601398333 / 20000000000000000 : ℝ) =
            (3884856601398333 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3884856601398333 / 2500000000000000 : ℝ) ≤
            (1101988351068135173349 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (964359730060729 / 5000000000000000 : ℝ)) (q :=
      (3884856601398333 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_277_6 :
    Uω (aρ 6) (bρ 6) (732250745159 / 3200000000000 : ℝ) ≤
      (-(870368338916667326583 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (701564584428197 / 4000000000000000 : ℝ) ≤
      (-(870368338916667326583 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (701564584428197 / 4000000000000000 : ℝ) =
            (701564584428197 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (701564584428197 / 500000000000000 : ℝ) ≤
            (169352431533332673417 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (171892615600411 / 1000000000000000 : ℝ)) (q :=
      (701564584428197 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_277_7 :
    Uω (aρ 7) (bρ 7) (732250745159 / 3200000000000 : ℝ) ≤
      (-(9561280728788798957347 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2954933442797441 / 20000000000000000 : ℝ) ≤
      (-(9561280728788798957347 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2954933442797441 / 20000000000000000 : ℝ) =
            (2954933442797441 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2954933442797441 / 2500000000000000 : ℝ) ≤
            (835926975711201042653 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (694849028710283 / 5000000000000000 : ℝ)) (q :=
      (2954933442797441 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_277_8 :
    Uω (aρ 8) (bρ 8) (732250745159 / 3200000000000 : ℝ) ≤
      (-(11322116003695119553231 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1038899407952763 / 10000000000000000 : ℝ) ≤
      (-(11322116003695119553231 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1038899407952763 / 10000000000000000 : ℝ) =
            (1038899407952763 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1038899407952763 / 625000000000000 : ℝ) ≤
            (2540827602304880446769 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (796105081868651 / 10000000000000000 : ℝ)) (q :=
      (1038899407952763 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_277_9 :
    Uω (aρ 9) (bρ 9) (732250745159 / 3200000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_277_10 :
    Uω (aρ 10) (bρ 10) (732250745159 / 3200000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_277_11 :
    Uω (aρ 11) (bρ 11) (732250745159 / 3200000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_277_12 :
    Uω (aρ 12) (bρ 12) (732250745159 / 3200000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_277_13 :
    Uω (aρ 13) (bρ 13) (732250745159 / 3200000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_277_14 :
    Uω (aρ 14) (bρ 14) (732250745159 / 3200000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_277_15 :
    Uω (aρ 15) (bρ 15) (732250745159 / 3200000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_277_16 :
    Uω (aρ 16) (bρ 16) (732250745159 / 3200000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_277 :
    Uρ (732250745159 / 3200000000000 : ℝ) ≤
      (-(4631194231033519735309 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (732250745159 / 3200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(15034064746622953868251 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (732250745159 / 3200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3028678229702195023461 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (732250745159 / 3200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(384174511354075211361 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (732250745159 / 3200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(7877011697722102677853 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (732250745159 / 3200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4096615501181864826651 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (732250745159 / 3200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(870368338916667326583 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (732250745159 / 3200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(9561280728788798957347 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (732250745159 / 3200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(11322116003695119553231 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (732250745159 / 3200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (732250745159 / 3200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (732250745159 / 3200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (732250745159 / 3200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (732250745159 / 3200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (732250745159 / 3200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (732250745159 / 3200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (732250745159 / 3200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_277_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_278_1 :
    Uω (aρ 1) (bρ 1) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(14986228550453869444753 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8937506169277629 / 40000000000000000 : ℝ) ≤
      (-(14986228550453869444753 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8937506169277629 / 40000000000000000 : ℝ) =
            (8937506169277629 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8937506169277629 / 5000000000000000 : ℝ) ≤
            (5808186858546130555247 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (558576046878063 / 2500000000000000 : ℝ)) (q :=
      (8937506169277629 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_278_2 :
    Uω (aρ 2) (bρ 2) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(7547510708000491888651 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8840799482296617 / 40000000000000000 : ℝ) ≤
      (-(7547510708000491888651 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8840799482296617 / 40000000000000000 : ℝ) =
            (8840799482296617 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8840799482296617 / 5000000000000000 : ℝ) ≤
            (2849696996499508111349 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1104859928265873 / 5000000000000000 : ℝ)) (q :=
      (8840799482296617 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_278_3 :
    Uω (aρ 3) (bρ 3) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(7658745617946492467501 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8646290021959631 / 40000000000000000 : ℝ) ≤
      (-(7658745617946492467501 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8646290021959631 / 40000000000000000 : ℝ) =
            (8646290021959631 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8646290021959631 / 5000000000000000 : ℝ) ≤
            (2738462086553507532499 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2159861232713253 / 10000000000000000 : ℝ)) (q :=
      (8646290021959631 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_278_4 :
    Uω (aρ 4) (bρ 4) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(3140500279114518294383 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1663945186985161 / 8000000000000000 : ℝ) ≤
      (-(3140500279114518294383 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1663945186985161 / 8000000000000000 : ℝ) =
            (1663945186985161 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1663945186985161 / 1000000000000000 : ℝ) ≤
            (1018382802685481705617 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (103743668513067 / 500000000000000 : ℝ)) (q :=
      (1663945186985161 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_278_5 :
    Uω (aρ 5) (bρ 5) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(16331333419163968740737 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1562532963402677 / 8000000000000000 : ℝ) ≤
      (-(16331333419163968740737 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1562532963402677 / 8000000000000000 : ℝ) =
            (1562532963402677 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1562532963402677 / 1000000000000000 : ℝ) ≤
            (4463081989836031259263 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (193953273064013 / 1000000000000000 : ℝ)) (q :=
      (1562532963402677 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_278_6 :
    Uω (aρ 6) (bρ 6) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(17345535887965030851513 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7059158590152613 / 40000000000000000 : ℝ) ≤
      (-(17345535887965030851513 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7059158590152613 / 40000000000000000 : ℝ) =
            (7059158590152613 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7059158590152613 / 5000000000000000 : ℝ) ≤
            (3448879521034969148487 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (108126249521859 / 625000000000000 : ℝ)) (q :=
      (7059158590152613 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_278_7 :
    Uω (aρ 7) (bρ 7) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(761846612733371790459 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5955188887814863 / 40000000000000000 : ℝ) ≤
      (-(761846612733371790459 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5955188887814863 / 40000000000000000 : ℝ) =
            (5955188887814863 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5955188887814863 / 5000000000000000 : ℝ) ≤
            (69930003626628209541 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1401696521940869 / 10000000000000000 : ℝ)) (q :=
      (5955188887814863 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_278_8 :
    Uω (aρ 8) (bρ 8) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(4502343141899525609949 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4211032563555623 / 40000000000000000 : ℝ) ≤
      (-(4502343141899525609949 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4211032563555623 / 40000000000000000 : ℝ) =
            (4211032563555623 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4211032563555623 / 2500000000000000 : ℝ) ≤
            (1042834300500474390051 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (813160011151249 / 10000000000000000 : ℝ)) (q :=
      (4211032563555623 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_278_9 :
    Uω (aρ 9) (bρ 9) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_278_10 :
    Uω (aρ 10) (bρ 10) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_278_11 :
    Uω (aρ 11) (bρ 11) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_278_12 :
    Uω (aρ 12) (bρ 12) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_278_13 :
    Uω (aρ 13) (bρ 13) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_278_14 :
    Uω (aρ 14) (bρ 14) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_278_15 :
    Uω (aρ 15) (bρ 15) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_278_16 :
    Uω (aρ 16) (bρ 16) (7356627568677 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_278 :
    Uρ (7356627568677 / 32000000000000 : ℝ) ≤
      (-(2311355678676694845457 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (7356627568677 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(14986228550453869444753 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (7356627568677 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(7547510708000491888651 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (7356627568677 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(7658745617946492467501 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (7356627568677 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3140500279114518294383 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (7356627568677 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(16331333419163968740737 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (7356627568677 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(17345535887965030851513 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (7356627568677 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(761846612733371790459 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (7356627568677 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4502343141899525609949 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (7356627568677 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (7356627568677 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (7356627568677 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (7356627568677 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (7356627568677 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (7356627568677 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (7356627568677 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (7356627568677 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_278_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_279_1 :
    Uω (aρ 1) (bρ 1) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(746931005506826067739 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (179603153804829 / 800000000000000 : ℝ) ≤
      (-(746931005506826067739 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (179603153804829 / 800000000000000 : ℝ) =
            (179603153804829 / 100000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (179603153804829 / 100000000000000 : ℝ) ≤
            (292789764943173932261 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (89798696456179 / 400000000000000 : ℝ)) (q :=
      (179603153804829 / 800000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_279_2 :
    Uω (aρ 2) (bρ 2) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(150468846214901381899 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4441729424490323 / 20000000000000000 : ℝ) ≤
      (-(150468846214901381899 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4441729424490323 / 20000000000000000 : ℝ) =
            (4441729424490323 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4441729424490323 / 2500000000000000 : ℝ) ≤
            (57475307875098618101 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2220387003284073 / 10000000000000000 : ℝ)) (q :=
      (4441729424490323 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_279_3 :
    Uω (aρ 3) (bρ 3) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(7634123057285258519997 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4344486897094561 / 20000000000000000 : ℝ) ≤
      (-(7634123057285258519997 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4344486897094561 / 20000000000000000 : ℝ) =
            (4344486897094561 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4344486897094561 / 2500000000000000 : ℝ) ≤
            (2763084647214741480003 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2170540582238311 / 10000000000000000 : ℝ)) (q :=
      (4344486897094561 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_279_4 :
    Uω (aρ 4) (bρ 4) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(3130248953656063937241 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4181239760347549 / 20000000000000000 : ℝ) ≤
      (-(3130248953656063937241 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4181239760347549 / 20000000000000000 : ℝ) =
            (4181239760347549 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4181239760347549 / 2500000000000000 : ℝ) ≤
            (1028634128143936062759 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2085587626556299 / 10000000000000000 : ℝ)) (q :=
      (4181239760347549 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_279_5 :
    Uω (aρ 5) (bρ 5) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(16276511309893494333811 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (785561311168151 / 4000000000000000 : ℝ) ≤
      (-(16276511309893494333811 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (785561311168151 / 4000000000000000 : ℝ) =
            (785561311168151 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (785561311168151 / 500000000000000 : ℝ) ≤
            (4517904099106505666189 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (390068868276901 / 2000000000000000 : ℝ)) (q :=
      (785561311168151 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_279_6 :
    Uω (aρ 6) (bρ 6) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(17284100131055428922333 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1775665139313283 / 10000000000000000 : ℝ) ≤
      (-(17284100131055428922333 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1775665139313283 / 10000000000000000 : ℝ) =
            (1775665139313283 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1775665139313283 / 1250000000000000 : ℝ) ≤
            (3510315277944571077667 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (435277109827579 / 2500000000000000 : ℝ)) (q :=
      (1775665139313283 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_279_7 :
    Uω (aρ 7) (bρ 7) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(9485209885025233626713 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (600046806086179 / 4000000000000000 : ℝ) ≤
      (-(9485209885025233626713 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (600046806086179 / 4000000000000000 : ℝ) =
            (600046806086179 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (600046806086179 / 500000000000000 : ℝ) ≤
            (911997819474766373287 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (282734714374929 / 2000000000000000 : ℝ)) (q :=
      (600046806086179 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_279_8 :
    Uω (aρ 8) (bρ 8) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(11190966569279896228593 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1066510152242077 / 10000000000000000 : ℝ) ≤
      (-(11190966569279896228593 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1066510152242077 / 10000000000000000 : ℝ) =
            (1066510152242077 / 625000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1066510152242077 / 625000000000000 : ℝ) ≤
            (2671977036720103771407 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (12968773394811 / 156250000000000 : ℝ)) (q :=
      (1066510152242077 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_279_9 :
    Uω (aρ 9) (bρ 9) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_9]) (by norm_num [bρ_9])]; exact Lmid_9

lemma U_279_10 :
    Uω (aρ 10) (bρ 10) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_279_11 :
    Uω (aρ 11) (bρ 11) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_279_12 :
    Uω (aρ 12) (bρ 12) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_279_13 :
    Uω (aρ 13) (bρ 13) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_279_14 :
    Uω (aρ 14) (bρ 14) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_279_15 :
    Uω (aρ 15) (bρ 15) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_279_16 :
    Uω (aρ 16) (bρ 16) (1847686921441 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_279 :
    Uρ (1847686921441 / 8000000000000 : ℝ) ≤
      (-(1153581143868500307221 / 625000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1847686921441 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(746931005506826067739 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1847686921441 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(150468846214901381899 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1847686921441 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(7634123057285258519997 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1847686921441 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3130248953656063937241 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1847686921441 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(16276511309893494333811 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1847686921441 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(17284100131055428922333 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1847686921441 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(9485209885025233626713 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1847686921441 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(11190966569279896228593 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1847686921441 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(26986659976834617141369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1847686921441 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1847686921441 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1847686921441 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1847686921441 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1847686921441 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1847686921441 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1847686921441 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_279_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
