/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U25) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_304_1 :
    Uω (aρ 1) (bρ 1) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(319966329192450738377 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44491959966754893 / 160000000000000000 : ℝ) ≤
      (-(319966329192450738377 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44491959966754893 / 160000000000000000 : ℝ) =
            (44491959966754893 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44491959966754893 / 40000000000000000 : ℝ) ≤
            (26607260957549261623 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (695172339909899 / 2500000000000000 : ℝ)) (q :=
      (44491959966754893 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_304_2 :
    Uω (aρ 2) (bρ 2) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(12885682785381020929319 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44106428207642013 / 160000000000000000 : ℝ) ≤
      (-(12885682785381020929319 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44106428207642013 / 160000000000000000 : ℝ) =
            (44106428207642013 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44106428207642013 / 40000000000000000 : ℝ) ≤
            (977260820618979070681 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1378133451130243 / 5000000000000000 : ℝ)) (q :=
      (44106428207642013 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_304_3 :
    Uω (aρ 3) (bρ 3) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(13062733067052531422153 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8666479002615649 / 32000000000000000 : ℝ) ≤
      (-(13062733067052531422153 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8666479002615649 / 32000000000000000 : ℝ) =
            (8666479002615649 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8666479002615649 / 8000000000000000 : ℝ) ≤
            (800210538947468577847 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (541381771858003 / 2000000000000000 : ℝ)) (q :=
      (8666479002615649 / 32000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_304_4 :
    Uω (aρ 4) (bρ 4) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(2673224740282882651271 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42037473411546381 / 160000000000000000 : ℝ) ≤
      (-(2673224740282882651271 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42037473411546381 / 160000000000000000 : ℝ) =
            (42037473411546381 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42037473411546381 / 40000000000000000 : ℝ) ≤
            (99363980917117348729 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (655834460040883 / 2500000000000000 : ℝ)) (q :=
      (42037473411546381 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_304_5 :
    Uω (aρ 5) (bρ 5) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(13852885671077141140659 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40040251978887333 / 160000000000000000 : ℝ) ≤
      (-(13852885671077141140659 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40040251978887333 / 160000000000000000 : ℝ) =
            (40040251978887333 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40040251978887333 / 40000000000000000 : ℝ) ≤
            (10057934922858859341 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2491875080416151 / 10000000000000000 : ℝ)) (q :=
      (40040251978887333 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_304_6 :
    Uω (aρ 6) (bρ 6) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(14612502027911626169787 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37111378164456861 / 160000000000000000 : ℝ) ≤
      (-(14612502027911626169787 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (37111378164456861 / 160000000000000000 : ℝ) =
            (37111378164456861 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37111378164456861 / 20000000000000000 : ℝ) ≤
            (6181913381088373830213 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1146503114376171 / 5000000000000000 : ℝ)) (q :=
      (37111378164456861 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_304_7 :
    Uω (aρ 7) (bρ 7) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(7901134692862773503333 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32948537544495549 / 160000000000000000 : ℝ) ≤
      (-(7901134692862773503333 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (32948537544495549 / 160000000000000000 : ℝ) =
            (32948537544495549 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32948537544495549 / 20000000000000000 : ℝ) ≤
            (2496073011637226496667 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (998156266008589 / 5000000000000000 : ℝ)) (q :=
      (32948537544495549 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_304_8 :
    Uω (aρ 8) (bρ 8) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(4445519034434660549931 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27030509260586877 / 160000000000000000 : ℝ) ≤
      (-(4445519034434660549931 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (27030509260586877 / 160000000000000000 : ℝ) =
            (27030509260586877 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27030509260586877 / 20000000000000000 : ℝ) ≤
            (753084817815339450069 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (770050323934297 / 5000000000000000 : ℝ)) (q :=
      (27030509260586877 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_304_9 :
    Uω (aρ 9) (bρ 9) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(4456019168123497172333 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17238827114719109 / 160000000000000000 : ℝ) ≤
      (-(4456019168123497172333 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (17238827114719109 / 160000000000000000 : ℝ) =
            (17238827114719109 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17238827114719109 / 10000000000000000 : ℝ) ≤
            (1089158274276502827667 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (657106007995123 / 10000000000000000 : ℝ)) (q :=
      (17238827114719109 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_304_10 :
    Uω (aρ 10) (bρ 10) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_304_11 :
    Uω (aρ 11) (bρ 11) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_304_12 :
    Uω (aρ 12) (bρ 12) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_304_13 :
    Uω (aρ 13) (bρ 13) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_304_14 :
    Uω (aρ 14) (bρ 14) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_304_15 :
    Uω (aρ 15) (bρ 15) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_304_16 :
    Uω (aρ 16) (bρ 16) (36419876534909 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_304 :
    Uρ (36419876534909 / 128000000000000 : ℝ) ≤
      (-(3334862897898375222561 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (36419876534909 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(319966329192450738377 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (36419876534909 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12885682785381020929319 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (36419876534909 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(13062733067052531422153 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (36419876534909 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2673224740282882651271 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (36419876534909 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13852885671077141140659 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (36419876534909 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14612502027911626169787 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (36419876534909 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7901134692862773503333 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (36419876534909 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4445519034434660549931 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (36419876534909 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4456019168123497172333 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (36419876534909 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (36419876534909 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (36419876534909 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (36419876534909 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (36419876534909 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (36419876534909 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (36419876534909 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_304_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_305_1 :
    Uω (aρ 1) (bρ 1) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(12776834507854284359341 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22294570720353829 / 80000000000000000 : ℝ) ≤
      (-(12776834507854284359341 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22294570720353829 / 80000000000000000 : ℝ) =
            (22294570720353829 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22294570720353829 / 20000000000000000 : ℝ) ≤
            (1086109098145715640659 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2786763328473301 / 10000000000000000 : ℝ)) (q :=
      (22294570720353829 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_305_2 :
    Uω (aρ 2) (bρ 2) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(200994859613764106703 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (884072423872929 / 3200000000000000 : ℝ) ≤
      (-(200994859613764106703 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (884072423872929 / 3200000000000000 : ℝ) =
            (884072423872929 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (884072423872929 / 800000000000000 : ℝ) ≤
            (15613634229985893297 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (55246846202013 / 200000000000000 : ℝ)) (q :=
      (884072423872929 / 3200000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_305_3 :
    Uω (aρ 3) (bρ 3) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(13040320400032887200957 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21714811691895949 / 80000000000000000 : ℝ) ≤
      (-(13040320400032887200957 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21714811691895949 / 80000000000000000 : ℝ) =
            (21714811691895949 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21714811691895949 / 20000000000000000 : ℝ) ≤
            (822623205967112799043 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2712988690218831 / 10000000000000000 : ℝ)) (q :=
      (21714811691895949 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_305_4 :
    Uω (aρ 4) (bρ 4) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(13342997919963146336917 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (842696016982221 / 3200000000000000 : ℝ) ≤
      (-(13342997919963146336917 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (842696016982221 / 3200000000000000 : ℝ) =
            (842696016982221 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (842696016982221 / 800000000000000 : ℝ) ≤
            (519945686036853663083 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (105177202177949 / 400000000000000 : ℝ)) (q :=
      (842696016982221 / 3200000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_305_5 :
    Uω (aρ 5) (bρ 5) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(3457135375880206226739 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20068922691257481 / 80000000000000000 : ℝ) ≤
      (-(3457135375880206226739 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (20068922691257481 / 80000000000000000 : ℝ) =
            (20068922691257481 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20068922691257481 / 20000000000000000 : ℝ) ≤
            (8600525619793773261 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1249000270229607 / 5000000000000000 : ℝ)) (q :=
      (20068922691257481 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_305_6 :
    Uω (aρ 6) (bρ 6) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(7293024924857735976821 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3720967579529317 / 16000000000000000 : ℝ) ≤
      (-(7293024924857735976821 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3720967579529317 / 16000000000000000 : ℝ) =
            (3720967579529317 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3720967579529317 / 2000000000000000 : ℝ) ≤
            (3104182779642264023179 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (229921971719649 / 1000000000000000 : ℝ)) (q :=
      (3720967579529317 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_305_7 :
    Uω (aρ 7) (bρ 7) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(31543787609354435141 / 20000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16524386399945949 / 80000000000000000 : ℝ) ≤
      (-(31543787609354435141 / 20000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16524386399945949 / 80000000000000000 : ℝ) =
            (16524386399945949 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16524386399945949 / 10000000000000000 : ℝ) ≤
            (10045043208645564859 / 20000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2002768223531331 / 10000000000000000 : ℝ)) (q :=
      (16524386399945949 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_305_8 :
    Uω (aρ 8) (bρ 8) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(17742731513520089426687 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13568534637119313 / 80000000000000000 : ℝ) ≤
      (-(17742731513520089426687 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13568534637119313 / 80000000000000000 : ℝ) =
            (13568534637119313 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13568534637119313 / 10000000000000000 : ℝ) ≤
            (3051683895479910573313 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (24177295846323 / 156250000000000 : ℝ)) (q :=
      (13568534637119313 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_305_9 :
    Uω (aρ 9) (bρ 9) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(2218861948983381281 / 1000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8698622542271477 / 80000000000000000 : ℝ) ≤
      (-(2218861948983381281 / 1000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (8698622542271477 / 80000000000000000 : ℝ) =
            (8698622542271477 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8698622542271477 / 5000000000000000 : ℝ) ≤
            (553726772216618719 / 1000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (670834538812713 / 10000000000000000 : ℝ)) (q :=
      (8698622542271477 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_305_10 :
    Uω (aρ 10) (bρ 10) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_305_11 :
    Uω (aρ 11) (bρ 11) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_305_12 :
    Uω (aρ 12) (bρ 12) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_305_13 :
    Uω (aρ 13) (bρ 13) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_305_14 :
    Uω (aρ 14) (bρ 14) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_305_15 :
    Uω (aρ 15) (bρ 15) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_305_16 :
    Uω (aρ 16) (bρ 16) (18248810046081 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_305 :
    Uρ (18248810046081 / 64000000000000 : ℝ) ≤
      (-(8326613935861223524661 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (18248810046081 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(12776834507854284359341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (18248810046081 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(200994859613764106703 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (18248810046081 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(13040320400032887200957 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (18248810046081 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(13342997919963146336917 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (18248810046081 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3457135375880206226739 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (18248810046081 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7293024924857735976821 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (18248810046081 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(31543787609354435141 / 20000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (18248810046081 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(17742731513520089426687 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (18248810046081 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2218861948983381281 / 1000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (18248810046081 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (18248810046081 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (18248810046081 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (18248810046081 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (18248810046081 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (18248810046081 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (18248810046081 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_305_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_306_1 :
    Uω (aρ 1) (bρ 1) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(6377531675875982707461 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44686322905842127 / 160000000000000000 : ℝ) ≤
      (-(6377531675875982707461 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44686322905842127 / 160000000000000000 : ℝ) =
            (44686322905842127 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44686322905842127 / 40000000000000000 : ℝ) ≤
            (553940127124017292539 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2792837296204719 / 10000000000000000 : ℝ)) (q :=
      (44686322905842127 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_306_2 :
    Uω (aρ 2) (bρ 2) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(802606725249877005899 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44300814120233439 / 160000000000000000 : ℝ) ≤
      (-(802606725249877005899 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44300814120233439 / 160000000000000000 : ℝ) =
            (44300814120233439 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44300814120233439 / 40000000000000000 : ℝ) ≤
            (63827250125122994101 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2768417710513633 / 10000000000000000 : ℝ)) (q :=
      (44300814120233439 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_306_3 :
    Uω (aρ 3) (bρ 3) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(2603591580741016814553 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43526851535827023 / 160000000000000000 : ℝ) ≤
      (-(2603591580741016814553 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43526851535827023 / 160000000000000000 : ℝ) =
            (43526851535827023 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43526851535827023 / 40000000000000000 : ℝ) ≤
            (168997140458983185447 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2719068493812831 / 10000000000000000 : ℝ)) (q :=
      (43526851535827023 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_306_4 :
    Uω (aρ 4) (bρ 4) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(13319925657080517909239 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42232127603529111 / 160000000000000000 : ℝ) ≤
      (-(13319925657080517909239 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42232127603529111 / 160000000000000000 : ℝ) =
            (42232127603529111 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42232127603529111 / 40000000000000000 : ℝ) ≤
            (543017948919482090761 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (164720136458787 / 625000000000000 : ℝ)) (q :=
      (42232127603529111 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_306_5 :
    Uω (aρ 5) (bρ 5) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(13804256957131762695407 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40235436769496831 / 160000000000000000 : ℝ) ≤
      (-(13804256957131762695407 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40235436769496831 / 160000000000000000 : ℝ) =
            (40235436769496831 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40235436769496831 / 40000000000000000 : ℝ) ≤
            (58686648868237304593 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2504125748421557 / 10000000000000000 : ℝ)) (q :=
      (40235436769496831 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_306_6 :
    Uω (aρ 6) (bρ 6) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(14559669056125745715263 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7461593493314523 / 32000000000000000 : ℝ) ≤
      (-(14559669056125745715263 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7461593493314523 / 32000000000000000 : ℝ) =
            (7461593493314523 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7461593493314523 / 4000000000000000 : ℝ) ≤
            (6234746352874254284737 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (230543246069603 / 1000000000000000 : ℝ)) (q :=
      (7461593493314523 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_306_7 :
    Uω (aρ 7) (bρ 7) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(3148323192084140152897 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1325959559977023 / 6400000000000000 : ℝ) ≤
      (-(3148323192084140152897 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1325959559977023 / 6400000000000000 : ℝ) =
            (1325959559977023 / 800000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1325959559977023 / 800000000000000 : ℝ) ≤
            (1010559889715859847103 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (40184430661253 / 200000000000000 : ℝ)) (q :=
      (1325959559977023 / 6400000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_306_8 :
    Uω (aρ 8) (bρ 8) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(3540714116985614482459 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27243548913441479 / 160000000000000000 : ℝ) ≤
      (-(3540714116985614482459 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (27243548913441479 / 160000000000000000 : ℝ) =
            (27243548913441479 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27243548913441479 / 20000000000000000 : ℝ) ≤
            (618168964814385517541 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (777291586827319 / 5000000000000000 : ℝ)) (q :=
      (27243548913441479 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_306_9 :
    Uω (aρ 9) (bρ 9) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(2209898160607914061911 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17553891330828439 / 160000000000000000 : ℝ) ≤
      (-(2209898160607914061911 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (17553891330828439 / 160000000000000000 : ℝ) =
            (17553891330828439 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17553891330828439 / 10000000000000000 : ℝ) ≤
            (562690560592085938089 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (85542700523501 / 1250000000000000 : ℝ)) (q :=
      (17553891330828439 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_306_10 :
    Uω (aρ 10) (bρ 10) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_306_11 :
    Uω (aρ 11) (bρ 11) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_306_12 :
    Uω (aρ 12) (bρ 12) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_306_13 :
    Uω (aρ 13) (bρ 13) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_306_14 :
    Uω (aρ 14) (bρ 14) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_306_15 :
    Uω (aρ 15) (bρ 15) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_306_16 :
    Uω (aρ 16) (bρ 16) (7315072729883 / 25600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_306 :
    Uρ (7315072729883 / 25600000000000 : ℝ) ≤
      (-(8316172534289768010333 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (7315072729883 / 25600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6377531675875982707461 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (7315072729883 / 25600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(802606725249877005899 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (7315072729883 / 25600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2603591580741016814553 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (7315072729883 / 25600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(13319925657080517909239 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (7315072729883 / 25600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13804256957131762695407 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (7315072729883 / 25600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14559669056125745715263 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (7315072729883 / 25600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3148323192084140152897 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (7315072729883 / 25600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3540714116985614482459 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (7315072729883 / 25600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2209898160607914061911 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (7315072729883 / 25600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (7315072729883 / 25600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (7315072729883 / 25600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (7315072729883 / 25600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (7315072729883 / 25600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (7315072729883 / 25600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (7315072729883 / 25600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_306_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_307_1 :
    Uω (aρ 1) (bρ 1) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(3183334873245216212523 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11195876090553929 / 40000000000000000 : ℝ) ≤
      (-(3183334873245216212523 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11195876090553929 / 40000000000000000 : ℝ) =
            (11195876090553929 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11195876090553929 / 10000000000000000 : ℝ) ≤
            (282401028254783787477 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2798911262841027 / 10000000000000000 : ℝ)) (q :=
      (11195876090553929 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_307_2 :
    Uω (aρ 2) (bρ 2) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(12819792339455511980223 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11099501746948329 / 40000000000000000 : ℝ) ≤
      (-(12819792339455511980223 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11099501746948329 / 40000000000000000 : ℝ) =
            (11099501746948329 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11099501746948329 / 10000000000000000 : ℝ) ≤
            (1043151266544488019777 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2774493103548227 / 10000000000000000 : ℝ)) (q :=
      (11099501746948329 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_307_3 :
    Uω (aρ 3) (bρ 3) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(3248911338433372805021 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10906019867661809 / 40000000000000000 : ℝ) ≤
      (-(3248911338433372805021 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10906019867661809 / 40000000000000000 : ℝ) =
            (10906019867661809 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10906019867661809 / 10000000000000000 : ℝ) ≤
            (216824563066627194979 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2725148270254967 / 10000000000000000 : ℝ)) (q :=
      (10906019867661809 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_307_4 :
    Uω (aρ 4) (bρ 4) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(6648453332443258315593 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10582363419881751 / 40000000000000000 : ℝ) ≤
      (-(6648453332443258315593 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10582363419881751 / 40000000000000000 : ℝ) =
            (10582363419881751 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10582363419881751 / 10000000000000000 : ℝ) ≤
            (283018470556741684407 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1320807113714969 / 5000000000000000 : ℝ)) (q :=
      (10582363419881751 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_307_5 :
    Uω (aρ 5) (bρ 5) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(13780031738160772080827 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2016651307729763 / 8000000000000000 : ℝ) ≤
      (-(13780031738160772080827 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2016651307729763 / 8000000000000000 : ℝ) =
            (2016651307729763 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2016651307729763 / 2000000000000000 : ℝ) ≤
            (82911867839227919173 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (251025070614847 / 1000000000000000 : ℝ)) (q :=
      (2016651307729763 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_307_6 :
    Uω (aρ 6) (bρ 6) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(14533359254442350572721 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1870312661317283 / 8000000000000000 : ℝ) ≤
      (-(14533359254442350572721 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1870312661317283 / 8000000000000000 : ℝ) =
            (1870312661317283 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1870312661317283 / 1000000000000000 : ℝ) ≤
            (6261056154557649427279 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (231164446525727 / 1000000000000000 : ℝ)) (q :=
      (1870312661317283 / 8000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_307_7 :
    Uω (aρ 7) (bρ 7) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(628457407618548892479 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8312296581530601 / 40000000000000000 : ℝ) ≤
      (-(628457407618548892479 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8312296581530601 / 40000000000000000 : ℝ) =
            (8312296581530601 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8312296581530601 / 5000000000000000 : ℝ) ≤
            (203319208741451107521 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2015672483489363 / 10000000000000000 : ℝ)) (q :=
      (8312296581530601 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_307_8 :
    Uω (aρ 8) (bρ 8) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(17664591395044278791573 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1367497464768901 / 8000000000000000 : ℝ) ≤
      (-(17664591395044278791573 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1367497464768901 / 8000000000000000 : ℝ) =
            (1367497464768901 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1367497464768901 / 1000000000000000 : ℝ) ≤
            (3129824013955721208427 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (312361901197263 / 2000000000000000 : ℝ)) (q :=
      (1367497464768901 / 8000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_307_9 :
    Uω (aρ 9) (bρ 9) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(1375692650065395914491 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4427217190492359 / 40000000000000000 : ℝ) ≤
      (-(1375692650065395914491 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4427217190492359 / 40000000000000000 : ℝ) =
            (4427217190492359 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4427217190492359 / 2500000000000000 : ℝ) ≤
            (357175300684604085509 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (348820033835121 / 5000000000000000 : ℝ)) (q :=
      (4427217190492359 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_307_10 :
    Uω (aρ 10) (bρ 10) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_307_11 :
    Uω (aρ 11) (bρ 11) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_307_12 :
    Uω (aρ 12) (bρ 12) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_307_13 :
    Uω (aρ 13) (bρ 13) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_307_14 :
    Uω (aρ 14) (bρ 14) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_307_15 :
    Uω (aρ 15) (bρ 15) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_307_16 :
    Uω (aρ 16) (bρ 16) (9163276801667 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_307 :
    Uρ (9163276801667 / 32000000000000 : ℝ) ≤
      (-(8305828477742148551567 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (9163276801667 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3183334873245216212523 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (9163276801667 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12819792339455511980223 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (9163276801667 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3248911338433372805021 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (9163276801667 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6648453332443258315593 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (9163276801667 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13780031738160772080827 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (9163276801667 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14533359254442350572721 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (9163276801667 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(628457407618548892479 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (9163276801667 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(17664591395044278791573 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (9163276801667 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1375692650065395914491 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (9163276801667 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (9163276801667 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (9163276801667 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (9163276801667 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (9163276801667 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (9163276801667 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (9163276801667 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_307_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_308_1 :
    Uω (aρ 1) (bρ 1) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(1588957840809154527443 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44880685809885337 / 160000000000000000 : ℝ) ≤
      (-(1588957840809154527443 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44880685809885337 / 160000000000000000 : ℝ) =
            (44880685809885337 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44880685809885337 / 40000000000000000 : ℝ) ≤
            (143910109940845472557 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2804985228389339 / 10000000000000000 : ℝ)) (q :=
      (44880685809885337 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_308_2 :
    Uω (aρ 2) (bρ 2) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(2559585002193774210817 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8899039959342597 / 32000000000000000 : ℝ) ≤
      (-(2559585002193774210817 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8899039959342597 / 32000000000000000 : ℝ) =
            (8899039959342597 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8899039959342597 / 8000000000000000 : ℝ) ≤
            (213003719006225789183 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (556113697850559 / 2000000000000000 : ℝ)) (q :=
      (8899039959342597 / 32000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_308_3 :
    Uω (aρ 3) (bρ 3) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(12973382527285262823649 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43721307189703121 / 160000000000000000 : ℝ) ≤
      (-(12973382527285262823649 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43721307189703121 / 160000000000000000 : ℝ) =
            (43721307189703121 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43721307189703121 / 40000000000000000 : ℝ) ≤
            (889561078714737176351 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1365614009863281 / 5000000000000000 : ℝ)) (q :=
      (43721307189703121 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_308_4 :
    Uω (aρ 4) (bρ 4) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(6636970348612193216359 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42426779081787617 / 160000000000000000 : ℝ) ≤
      (-(6636970348612193216359 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42426779081787617 / 160000000000000000 : ℝ) =
            (42426779081787617 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42426779081787617 / 40000000000000000 : ℝ) ≤
            (294501454387806783641 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (661926546825531 / 2500000000000000 : ℝ)) (q :=
      (42426779081787617 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_308_5 :
    Uω (aρ 5) (bρ 5) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(13755865555041763943411 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40430613552428249 / 160000000000000000 : ℝ) ≤
      (-(13755865555041763943411 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40430613552428249 / 160000000000000000 : ℝ) =
            (40430613552428249 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40430613552428249 / 40000000000000000 : ℝ) ≤
            (107078050958236056589 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2516375415467203 / 10000000000000000 : ℝ)) (q :=
      (40430613552428249 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_308_6 :
    Uω (aρ 6) (bρ 6) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(7253560027631494245037 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37504533122141969 / 160000000000000000 : ℝ) ≤
      (-(7253560027631494245037 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (37504533122141969 / 160000000000000000 : ℝ) =
            (37504533122141969 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37504533122141969 / 20000000000000000 : ℝ) ≤
            (3143647676868505754963 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1158927868410709 / 5000000000000000 : ℝ)) (q :=
      (37504533122141969 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_308_7 :
    Uω (aρ 7) (bρ 7) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(7840675419673181174101 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33349364960606209 / 160000000000000000 : ℝ) ≤
      (-(7840675419673181174101 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33349364960606209 / 160000000000000000 : ℝ) =
            (33349364960606209 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33349364960606209 / 20000000000000000 : ℝ) ≤
            (2556532284826818825899 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (252765137173681 / 1250000000000000 : ℝ)) (q :=
      (33349364960606209 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_308_8 :
    Uω (aρ 8) (bρ 8) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(8812896010485875851931 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27456271515134017 / 160000000000000000 : ℝ) ≤
      (-(8812896010485875851931 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (27456271515134017 / 160000000000000000 : ℝ) =
            (27456271515134017 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27456271515134017 / 20000000000000000 : ℝ) ≤
            (1584311694014124148069 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (98064129252839 / 625000000000000 : ℝ)) (q :=
      (27456271515134017 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_308_9 :
    Uω (aρ 9) (bρ 9) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(2740603860275247694661 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17862271052765049 / 160000000000000000 : ℝ) ≤
      (-(2740603860275247694661 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (17862271052765049 / 160000000000000000 : ℝ) =
            (17862271052765049 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17862271052765049 / 10000000000000000 : ℝ) ≤
            (725132041224752305339 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (710741638609303 / 10000000000000000 : ℝ)) (q :=
      (17862271052765049 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_308_10 :
    Uω (aρ 10) (bρ 10) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_308_11 :
    Uω (aρ 11) (bρ 11) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_308_12 :
    Uω (aρ 12) (bρ 12) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_308_13 :
    Uω (aρ 13) (bρ 13) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_308_14 :
    Uω (aρ 14) (bρ 14) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_308_15 :
    Uω (aρ 15) (bρ 15) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_308_16 :
    Uω (aρ 16) (bρ 16) (36730850763921 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_308 :
    Uρ (36730850763921 / 128000000000000 : ℝ) ≤
      (-(16591155188789344255453 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (36730850763921 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1588957840809154527443 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (36730850763921 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2559585002193774210817 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (36730850763921 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12973382527285262823649 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (36730850763921 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6636970348612193216359 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (36730850763921 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13755865555041763943411 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (36730850763921 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7253560027631494245037 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (36730850763921 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7840675419673181174101 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (36730850763921 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8812896010485875851931 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (36730850763921 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2740603860275247694661 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (36730850763921 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (36730850763921 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (36730850763921 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (36730850763921 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (36730850763921 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (36730850763921 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (36730850763921 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_308_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_309_1 :
    Uω (aρ 1) (bρ 1) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(396563526515380477321 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22488933624453707 / 80000000000000000 : ℝ) ≤
      (-(396563526515380477321 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22488933624453707 / 80000000000000000 : ℝ) =
            (22488933624453707 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22488933624453707 / 20000000000000000 : ℝ) ≤
            (36653461172119522679 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (702764798214177 / 2500000000000000 : ℝ)) (q :=
      (22488933624453707 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_309_2 :
    Uω (aρ 2) (bρ 2) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(12776105409233890902293 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22296196273687991 / 80000000000000000 : ℝ) ≤
      (-(12776105409233890902293 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22296196273687991 / 80000000000000000 : ℝ) =
            (22296196273687991 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22296196273687991 / 20000000000000000 : ℝ) ≤
            (1086838196766109097707 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2786643867675279 / 10000000000000000 : ℝ)) (q :=
      (22296196273687991 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_309_3 :
    Uω (aρ 3) (bρ 3) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(12951169203016937992483 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (876370693888647 / 3200000000000000 : ℝ) ≤
      (-(12951169203016937992483 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (876370693888647 / 3200000000000000 : ℝ) =
            (876370693888647 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (876370693888647 / 800000000000000 : ℝ) ≤
            (911774402983062007517 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (109492309696293 / 400000000000000 : ℝ)) (q :=
      (876370693888647 / 3200000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_309_4 :
    Uω (aρ 4) (bρ 4) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(13251027509644650616501 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21262051907475379 / 80000000000000000 : ℝ) ≤
      (-(13251027509644650616501 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21262051907475379 / 80000000000000000 : ℝ) =
            (21262051907475379 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21262051907475379 / 20000000000000000 : ℝ) ≤
            (611916096355349383499 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1326899031768563 / 5000000000000000 : ℝ)) (q :=
      (21262051907475379 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_309_5 :
    Uω (aρ 5) (bρ 5) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(13731758118370003654299 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20264099488735607 / 80000000000000000 : ℝ) ≤
      (-(13731758118370003654299 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (20264099488735607 / 80000000000000000 : ℝ) =
            (20264099488735607 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20264099488735607 / 20000000000000000 : ℝ) ≤
            (131185487629996345701 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2522499878187183 / 10000000000000000 : ℝ)) (q :=
      (20264099488735607 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_309_6 :
    Uω (aρ 6) (bρ 6) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(905059442027853315307 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18801403600488763 / 80000000000000000 : ℝ) ≤
      (-(905059442027853315307 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (18801403600488763 / 80000000000000000 : ℝ) =
            (18801403600488763 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18801403600488763 / 10000000000000000 : ℝ) ≤
            (394591521034646684693 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (36313535644773 / 156250000000000 : ℝ)) (q :=
      (18801403600488763 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_309_7 :
    Uω (aρ 7) (bρ 7) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(2445525352896588967 / 1562500000000000000 : ℝ)) := by
  have hlg :
    Real.log (3344952508113903 / 16000000000000000 : ℝ) ≤
      (-(2445525352896588967 / 1562500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3344952508113903 / 16000000000000000 : ℝ) =
            (3344952508113903 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3344952508113903 / 2000000000000000 : ℝ) ≤
            (803602054759661033 / 1562500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (101428369852283 / 500000000000000 : ℝ)) (q :=
      (3344952508113903 / 16000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_309_8 :
    Uω (aρ 8) (bρ 8) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(8793585286503424790819 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13781258323136651 / 80000000000000000 : ℝ) ≤
      (-(8793585286503424790819 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13781258323136651 / 80000000000000000 : ℝ) =
            (13781258323136651 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13781258323136651 / 10000000000000000 : ℝ) ≤
            (1603622417996575209181 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (394058248506861 / 2500000000000000 : ℝ)) (q :=
      (13781258323136651 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_309_9 :
    Uω (aρ 9) (bρ 9) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(873605752059970258149 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9007091878016507 / 80000000000000000 : ℝ) ≤
      (-(873605752059970258149 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (9007091878016507 / 80000000000000000 : ℝ) =
            (9007091878016507 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9007091878016507 / 5000000000000000 : ℝ) ≤
            (235429736420029741851 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (45228563194213 / 625000000000000 : ℝ)) (q :=
      (9007091878016507 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_309_10 :
    Uω (aρ 10) (bρ 10) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_309_11 :
    Uω (aρ 11) (bρ 11) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_309_12 :
    Uω (aρ 12) (bρ 12) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_309_13 :
    Uω (aρ 13) (bρ 13) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_309_14 :
    Uω (aρ 14) (bρ 14) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_309_15 :
    Uω (aρ 15) (bρ 15) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_309_16 :
    Uω (aρ 16) (bρ 16) (18404297160587 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_309 :
    Uρ (18404297160587 / 64000000000000 : ℝ) ≤
      (-(16570832112858170651139 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (18404297160587 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(396563526515380477321 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (18404297160587 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12776105409233890902293 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (18404297160587 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12951169203016937992483 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (18404297160587 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(13251027509644650616501 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (18404297160587 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13731758118370003654299 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (18404297160587 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(905059442027853315307 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (18404297160587 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(2445525352896588967 / 1562500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (18404297160587 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8793585286503424790819 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (18404297160587 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(873605752059970258149 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (18404297160587 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (18404297160587 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (18404297160587 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (18404297160587 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (18404297160587 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (18404297160587 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (18404297160587 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_309_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_310_1 :
    Uω (aρ 1) (bρ 1) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(791778103538758106661 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45075048679337883 / 160000000000000000 : ℝ) ≤
      (-(791778103538758106661 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45075048679337883 / 160000000000000000 : ℝ) =
            (45075048679337883 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45075048679337883 / 40000000000000000 : ℝ) ≤
            (74655871836241893339 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1408566578125063 / 5000000000000000 : ℝ)) (q :=
      (45075048679337883 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_310_2 :
    Uω (aρ 2) (bρ 2) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(797145832894660626739 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44689585240162523 / 160000000000000000 : ℝ) ≤
      (-(797145832894660626739 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44689585240162523 / 160000000000000000 : ℝ) =
            (44689585240162523 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44689585240162523 / 40000000000000000 : ℝ) ≤
            (69288142480339373261 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1396359619431603 / 5000000000000000 : ℝ)) (q :=
      (44689585240162523 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_310_3 :
    Uω (aρ 3) (bρ 3) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(12929005161061176723777 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43915761986259859 / 160000000000000000 : ℝ) ≤
      (-(12929005161061176723777 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43915761986259859 / 160000000000000000 : ℝ) =
            (43915761986259859 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43915761986259859 / 40000000000000000 : ℝ) ≤
            (933938444938823276223 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2743387438475373 / 10000000000000000 : ℝ)) (q :=
      (43915761986259859 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_310_4 :
    Uω (aρ 4) (bρ 4) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(1322816685938930461697 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42621427883613691 / 160000000000000000 : ℝ) ≤
      (-(1322816685938930461697 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42621427883613691 / 160000000000000000 : ℝ) =
            (42621427883613691 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42621427883613691 / 40000000000000000 : ℝ) ≤
            (63477674661069538303 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1329944928354801 / 5000000000000000 : ℝ)) (q :=
      (42621427883613691 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_310_5 :
    Uω (aρ 5) (bρ 5) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(13707709140880624061209 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40625782444058779 / 160000000000000000 : ℝ) ≤
      (-(13707709140880624061209 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40625782444058779 / 160000000000000000 : ℝ) =
            (40625782444058779 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40625782444058779 / 40000000000000000 : ℝ) ≤
            (155234465119375938791 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1264312048050119 / 5000000000000000 : ℝ)) (q :=
      (40625782444058779 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_310_6 :
    Uω (aρ 6) (bρ 6) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(289097038461433344131 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37701075509361619 / 160000000000000000 : ℝ) ≤
      (-(289097038461433344131 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (37701075509361619 / 160000000000000000 : ℝ) =
            (37701075509361619 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37701075509361619 / 20000000000000000 : ℝ) ≤
            (126791269718566655869 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2330276104403093 / 10000000000000000 : ℝ)) (q :=
      (37701075509361619 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_310_7 :
    Uω (aρ 7) (bρ 7) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(3124293761267432852327 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33549666863660643 / 160000000000000000 : ℝ) ≤
      (-(3124293761267432852327 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33549666863660643 / 160000000000000000 : ℝ) =
            (33549666863660643 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33549666863660643 / 20000000000000000 : ℝ) ≤
            (1034589320532567147673 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2035011404450471 / 10000000000000000 : ℝ)) (q :=
      (33549666863660643 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_310_8 :
    Uω (aρ 8) (bρ 8) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(877436259691853950059 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5533737148278807 / 32000000000000000 : ℝ) ≤
      (-(877436259691853950059 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5533737148278807 / 32000000000000000 : ℝ) =
            (5533737148278807 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5533737148278807 / 4000000000000000 : ℝ) ≤
            (162284510758146049941 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (316686083101429 / 2000000000000000 : ℝ)) (q :=
      (5533737148278807 / 32000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_310_9 :
    Uω (aρ 9) (bρ 9) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(1087847238022731517901 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18164685248242899 / 160000000000000000 : ℝ) ≤
      (-(1087847238022731517901 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (18164685248242899 / 160000000000000000 : ℝ) =
            (18164685248242899 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18164685248242899 / 10000000000000000 : ℝ) ≤
            (298447122577268482099 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (736395982223253 / 10000000000000000 : ℝ)) (q :=
      (18164685248242899 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_310_10 :
    Uω (aρ 10) (bρ 10) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_310_11 :
    Uω (aρ 11) (bρ 11) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_310_12 :
    Uω (aρ 12) (bρ 12) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_310_13 :
    Uω (aρ 13) (bρ 13) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_310_14 :
    Uω (aρ 14) (bρ 14) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_310_15 :
    Uω (aρ 15) (bρ 15) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_310_16 :
    Uω (aρ 16) (bρ 16) (36886337878427 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_310 :
    Uρ (36886337878427 / 128000000000000 : ℝ) ≤
      (-(4137670170238638207857 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (36886337878427 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(791778103538758106661 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (36886337878427 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(797145832894660626739 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (36886337878427 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12929005161061176723777 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (36886337878427 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1322816685938930461697 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (36886337878427 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13707709140880624061209 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (36886337878427 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(289097038461433344131 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (36886337878427 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3124293761267432852327 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (36886337878427 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(877436259691853950059 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (36886337878427 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1087847238022731517901 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (36886337878427 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (36886337878427 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (36886337878427 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (36886337878427 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (36886337878427 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (36886337878427 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (36886337878427 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_310_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_311_1 :
    Uω (aρ 1) (bρ 1) (231025508973 / 800000000000 : ℝ) ≤
      (-(632345647487376720253 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5646528762654023 / 20000000000000000 : ℝ) ≤
      (-(632345647487376720253 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5646528762654023 / 20000000000000000 : ℝ) =
            (5646528762654023 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5646528762654023 / 5000000000000000 : ℝ) ≤
            (60801532812623279747 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2823207118576523 / 10000000000000000 : ℝ)) (q :=
      (5646528762654023 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_311_2 :
    Uω (aρ 2) (bρ 2) (231025508973 / 800000000000 : ℝ) ≤
      (-(6366304277815616426409 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2799173617215593 / 10000000000000000 : ℝ) ≤
      (-(6366304277815616426409 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2799173617215593 / 10000000000000000 : ℝ) =
            (2799173617215593 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2799173617215593 / 2500000000000000 : ℝ) ≤
            (565167525184383573591 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1399397301431843 / 5000000000000000 : ℝ)) (q :=
      (2799173617215593 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_311_3 :
    Uω (aρ 3) (bρ 3) (231025508973 / 800000000000 : ℝ) ≤
      (-(12906890183013655558881 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2750811816662373 / 10000000000000000 : ℝ) ≤
      (-(12906890183013655558881 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2750811816662373 / 10000000000000000 : ℝ) =
            (2750811816662373 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2750811816662373 / 2500000000000000 : ℝ) ≤
            (956053422986344441119 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1374733554053623 / 5000000000000000 : ℝ)) (q :=
      (2750811816662373 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_311_4 :
    Uω (aρ 4) (bρ 4) (231025508973 / 800000000000 : ℝ) ≤
      (-(3301339626344053614233 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2669921955770723 / 10000000000000000 : ℝ) ≤
      (-(3301339626344053614233 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2669921955770723 / 10000000000000000 : ℝ) =
            (2669921955770723 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2669921955770723 / 2500000000000000 : ℝ) ≤
            (164396275155946385767 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1332990783694473 / 5000000000000000 : ℝ)) (q :=
      (2669921955770723 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_311_5 :
    Uω (aρ 5) (bρ 5) (231025508973 / 800000000000 : ℝ) ≤
      (-(3420929584356858442139 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (159075640493697 / 625000000000000 : ℝ) ≤
      (-(3420929584356858442139 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (159075640493697 / 625000000000000 : ℝ) =
            (159075640493697 / 156250000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (159075640493697 / 156250000000000 : ℝ) ≤
            (44806317143141557861 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (633687017745201 / 2500000000000000 : ℝ)) (q :=
      (159075640493697 / 625000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_311_6 :
    Uω (aρ 6) (bρ 6) (231025508973 / 800000000000 : ℝ) ≤
      (-(14428822227409249675339 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (944983452332593 / 4000000000000000 : ℝ) ≤
      (-(14428822227409249675339 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (944983452332593 / 4000000000000000 : ℝ) =
            (944983452332593 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (944983452332593 / 500000000000000 : ℝ) ≤
            (6365593181590750324661 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (467297042397093 / 2000000000000000 : ℝ)) (q :=
      (944983452332593 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_311_7 :
    Uω (aρ 7) (bρ 7) (231025508973 / 800000000000 : ℝ) ≤
      (-(15591669847770762946373 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (841244762045679 / 4000000000000000 : ℝ) ≤
      (-(15591669847770762946373 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (841244762045679 / 4000000000000000 : ℝ) =
            (841244762045679 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (841244762045679 / 500000000000000 : ℝ) ≤
            (5202745561229237053627 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (408290628262179 / 2000000000000000 : ℝ)) (q :=
      (841244762045679 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_311_8 :
    Uω (aρ 8) (bρ 8) (231025508973 / 800000000000 : ℝ) ≤
      (-(8755227028881924606817 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3471847479083373 / 20000000000000000 : ℝ) ≤
      (-(8755227028881924606817 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3471847479083373 / 20000000000000000 : ℝ) =
            (3471847479083373 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3471847479083373 / 2500000000000000 : ℝ) ≤
            (1641980675618075393183 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1590618461505873 / 10000000000000000 : ℝ)) (q :=
      (3471847479083373 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_311_9 :
    Uω (aρ 9) (bρ 9) (231025508973 / 800000000000 : ℝ) ≤
      (-(1083758172203001746681 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2289230942307729 / 20000000000000000 : ℝ) ≤
      (-(1083758172203001746681 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2289230942307729 / 20000000000000000 : ℝ) =
            (2289230942307729 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2289230942307729 / 1250000000000000 : ℝ) ≤
            (302536188396998253319 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (748967553090229 / 10000000000000000 : ℝ)) (q :=
      (2289230942307729 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_311_10 :
    Uω (aρ 10) (bρ 10) (231025508973 / 800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_311_11 :
    Uω (aρ 11) (bρ 11) (231025508973 / 800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_311_12 :
    Uω (aρ 12) (bρ 12) (231025508973 / 800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_311_13 :
    Uω (aρ 13) (bρ 13) (231025508973 / 800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_311_14 :
    Uω (aρ 14) (bρ 14) (231025508973 / 800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_311_15 :
    Uω (aρ 15) (bρ 15) (231025508973 / 800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_311_16 :
    Uω (aρ 16) (bρ 16) (231025508973 / 800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_311 :
    Uρ (231025508973 / 800000000000 : ℝ) ≤
      (-(16530694387511013761449 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (231025508973 / 800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(632345647487376720253 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (231025508973 / 800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6366304277815616426409 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (231025508973 / 800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12906890183013655558881 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (231025508973 / 800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3301339626344053614233 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (231025508973 / 800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3420929584356858442139 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (231025508973 / 800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14428822227409249675339 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (231025508973 / 800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15591669847770762946373 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (231025508973 / 800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8755227028881924606817 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (231025508973 / 800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1083758172203001746681 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (231025508973 / 800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (231025508973 / 800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (231025508973 / 800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (231025508973 / 800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (231025508973 / 800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (231025508973 / 800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (231025508973 / 800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_311_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_312_1 :
    Uω (aρ 1) (bρ 1) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(12625422528061556459799 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45269411514645309 / 160000000000000000 : ℝ) ≤
      (-(12625422528061556459799 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45269411514645309 / 160000000000000000 : ℝ) =
            (45269411514645309 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45269411514645309 / 40000000000000000 : ℝ) ≤
            (1237521077938443540201 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2829281079842773 / 10000000000000000 : ℝ)) (q :=
      (45269411514645309 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_312_2 :
    Uω (aρ 2) (bρ 2) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(12710930891948740915369 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1795358818144421 / 6400000000000000 : ℝ) ≤
      (-(12710930891948740915369 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1795358818144421 / 6400000000000000 : ℝ) =
            (1795358818144421 / 1600000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1795358818144421 / 1600000000000000 : ℝ) ≤
            (1152012714051259084631 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (112194798388937 / 400000000000000 : ℝ)) (q :=
      (1795358818144421 / 6400000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_312_3 :
    Uω (aρ 3) (bρ 3) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(12884824051920100839147 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44110215936846533 / 160000000000000000 : ℝ) ≤
      (-(12884824051920100839147 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44110215936846533 / 160000000000000000 : ℝ) =
            (44110215936846533 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44110215936846533 / 40000000000000000 : ℝ) ≤
            (978119554079899160853 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1377773375738963 / 5000000000000000 : ℝ)) (q :=
      (44110215936846533 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_312_4 :
    Uω (aρ 4) (bρ 4) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(1318260220818366757497 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42816074045617973 / 160000000000000000 : ℝ) ≤
      (-(1318260220818366757497 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42816074045617973 / 160000000000000000 : ℝ) =
            (42816074045617973 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42816074045617973 / 40000000000000000 : ℝ) ≤
            (68034139781633242503 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (668018299034839 / 2500000000000000 : ℝ)) (q :=
      (42816074045617973 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_312_5 :
    Uω (aρ 5) (bρ 5) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(13659785424961961456927 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40820943558512269 / 160000000000000000 : ℝ) ≤
      (-(13659785424961961456927 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40820943558512269 / 160000000000000000 : ℝ) =
            (40820943558512269 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40820943558512269 / 40000000000000000 : ℝ) ≤
            (203158181038038543073 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2540871804586143 / 10000000000000000 : ℝ)) (q :=
      (40820943558512269 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_312_6 :
    Uω (aρ 6) (bρ 6) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(14402861608877604147629 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7579518999664049 / 32000000000000000 : ℝ) ≤
      (-(14402861608877604147629 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7579518999664049 / 32000000000000000 : ℝ) =
            (7579518999664049 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7579518999664049 / 4000000000000000 : ℝ) ≤
            (6391553800122395852371 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (117134680485107 / 500000000000000 : ℝ)) (q :=
      (7579518999664049 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_312_7 :
    Uω (aρ 7) (bρ 7) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(7780982377249255875523 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33749896107048941 / 160000000000000000 : ℝ) ≤
      (-(7780982377249255875523 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33749896107048941 / 160000000000000000 : ℝ) =
            (33749896107048941 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33749896107048941 / 20000000000000000 : ℝ) ≤
            (2616225327250744124477 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2047892629053227 / 10000000000000000 : ℝ)) (q :=
      (33749896107048941 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_312_8 :
    Uω (aρ 8) (bρ 8) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(17472355369949165105051 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27880799932356629 / 160000000000000000 : ℝ) ≤
      (-(17472355369949165105051 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (27880799932356629 / 160000000000000000 : ℝ) =
            (27880799932356629 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27880799932356629 / 20000000000000000 : ℝ) ≤
            (3322060039050834894949 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (99862328659793 / 625000000000000 : ℝ)) (q :=
      (27880799932356629 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_312_9 :
    Uω (aρ 9) (bρ 9) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(10797367480776861680277 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29538779142381 / 256000000000000 : ℝ) ≤
      (-(10797367480776861680277 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (29538779142381 / 256000000000000 : ℝ) = (29538779142381 / 16000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29538779142381 / 16000000000000 : ℝ) ≤
            (3065576125223138319723 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1218208025393 / 16000000000000 : ℝ)) (q :=
      (29538779142381 / 256000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_312_10 :
    Uω (aρ 10) (bρ 10) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_312_11 :
    Uω (aρ 11) (bρ 11) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_312_12 :
    Uω (aρ 12) (bρ 12) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_312_13 :
    Uω (aρ 13) (bρ 13) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_312_14 :
    Uω (aρ 14) (bρ 14) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_312_15 :
    Uω (aρ 15) (bρ 15) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_312_16 :
    Uω (aρ 16) (bρ 16) (37041824992933 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_312 :
    Uρ (37041824992933 / 128000000000000 : ℝ) ≤
      (-(16510867209835616507937 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (37041824992933 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(12625422528061556459799 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (37041824992933 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12710930891948740915369 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (37041824992933 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12884824051920100839147 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (37041824992933 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1318260220818366757497 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (37041824992933 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13659785424961961456927 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (37041824992933 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14402861608877604147629 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (37041824992933 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7780982377249255875523 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (37041824992933 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(17472355369949165105051 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (37041824992933 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(10797367480776861680277 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (37041824992933 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (37041824992933 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (37041824992933 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (37041824992933 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (37041824992933 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (37041824992933 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (37041824992933 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_312_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_313_1 :
    Uω (aρ 1) (bρ 1) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(1575497274129372754583 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22683296459815877 / 80000000000000000 : ℝ) ≤
      (-(1575497274129372754583 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22683296459815877 / 80000000000000000 : ℝ) =
            (22683296459815877 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22683296459815877 / 20000000000000000 : ℝ) ≤
            (157370676620627245417 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (354419380006961 / 1250000000000000 : ℝ)) (q :=
      (22683296459815877 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_313_2 :
    Uω (aρ 2) (bρ 2) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(12689300131364860125261 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22490581487508013 / 80000000000000000 : ℝ) ≤
      (-(12689300131364860125261 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22490581487508013 / 80000000000000000 : ℝ) =
            (22490581487508013 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22490581487508013 / 20000000000000000 : ℝ) ≤
            (1173643474635139874739 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1405472654744361 / 5000000000000000 : ℝ)) (q :=
      (22490581487508013 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_313_3 :
    Uω (aρ 3) (bρ 3) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(6431403276131736116647 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22103721299196533 / 80000000000000000 : ℝ) ≤
      (-(6431403276131736116647 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22103721299196533 / 80000000000000000 : ℝ) =
            (22103721299196533 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22103721299196533 / 20000000000000000 : ℝ) ≤
            (500068526868263883353 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (690406592190213 / 2500000000000000 : ℝ)) (q :=
      (22103721299196533 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_313_4 :
    Uω (aρ 4) (bρ 4) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(1644987216254391239947 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21456698073972669 / 80000000000000000 : ℝ) ≤
      (-(1644987216254391239947 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21456698073972669 / 80000000000000000 : ℝ) =
            (21456698073972669 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21456698073972669 / 20000000000000000 : ℝ) ≤
            (87880734495608760053 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1339082371759943 / 5000000000000000 : ℝ)) (q :=
      (21456698073972669 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_313_5 :
    Uω (aρ 5) (bρ 5) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(13635910122512783687653 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20459260617179309 / 80000000000000000 : ℝ) ≤
      (-(13635910122512783687653 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (20459260617179309 / 80000000000000000 : ℝ) =
            (20459260617179309 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20459260617179309 / 20000000000000000 : ℝ) ≤
            (227033483487216312347 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1273497649328273 / 5000000000000000 : ℝ)) (q :=
      (20459260617179309 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_313_6 :
    Uω (aρ 6) (bρ 6) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(898560605875719717287 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18997923134720613 / 80000000000000000 : ℝ) ≤
      (-(898560605875719717287 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (18997923134720613 / 80000000000000000 : ℝ) =
            (18997923134720613 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18997923134720613 / 10000000000000000 : ℝ) ≤
            (401090357186780282713 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (146806331448867 / 625000000000000 : ℝ)) (q :=
      (18997923134720613 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_313_7 :
    Uω (aρ 7) (bρ 7) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(155323529047166465161 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16924991954263829 / 80000000000000000 : ℝ) ≤
      (-(155323529047166465161 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16924991954263829 / 80000000000000000 : ℝ) =
            (16924991954263829 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16924991954263829 / 10000000000000000 : ℝ) ≤
            (52620625042833534839 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (513582472206919 / 2500000000000000 : ℝ)) (q :=
      (16924991954263829 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_313_8 :
    Uω (aρ 8) (bρ 8) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(17434427365685407335693 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13993373516662809 / 80000000000000000 : ℝ) ≤
      (-(17434427365685407335693 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (13993373516662809 / 80000000000000000 : ℝ) =
            (13993373516662809 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13993373516662809 / 10000000000000000 : ℝ) ≤
            (3359988043314592664307 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1604966930767421 / 10000000000000000 : ℝ)) (q :=
      (13993373516662809 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_313_9 :
    Uω (aρ 9) (bρ 9) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(10757799638185708569451 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9304207395734157 / 80000000000000000 : ℝ) ≤
      (-(10757799638185708569451 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (9304207395734157 / 80000000000000000 : ℝ) =
            (9304207395734157 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9304207395734157 / 5000000000000000 : ℝ) ≤
            (3105143967814291430549 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (386820514447629 / 5000000000000000 : ℝ)) (q :=
      (9304207395734157 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_313_10 :
    Uω (aρ 10) (bρ 10) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_313_11 :
    Uω (aρ 11) (bρ 11) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_313_12 :
    Uω (aρ 12) (bρ 12) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_313_13 :
    Uω (aρ 13) (bρ 13) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_313_14 :
    Uω (aρ 14) (bρ 14) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_313_15 :
    Uω (aρ 15) (bρ 15) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_313_16 :
    Uω (aρ 16) (bρ 16) (18559784275093 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_313 :
    Uρ (18559784275093 / 64000000000000 : ℝ) ≤
      (-(659647742307838339129 / 400000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (18559784275093 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1575497274129372754583 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (18559784275093 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12689300131364860125261 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (18559784275093 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6431403276131736116647 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (18559784275093 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1644987216254391239947 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (18559784275093 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13635910122512783687653 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (18559784275093 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(898560605875719717287 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (18559784275093 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(155323529047166465161 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (18559784275093 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(17434427365685407335693 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (18559784275093 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(10757799638185708569451 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (18559784275093 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (18559784275093 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (18559784275093 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (18559784275093 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (18559784275093 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (18559784275093 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (18559784275093 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_313_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_314_1 :
    Uω (aρ 1) (bρ 1) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(2516515949483040556447 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45463774316245559 / 160000000000000000 : ℝ) ≤
      (-(2516515949483040556447 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45463774316245559 / 160000000000000000 : ℝ) =
            (45463774316245559 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45463774316245559 / 40000000000000000 : ℝ) ≤
            (256072771716959443553 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2841428999222023 / 10000000000000000 : ℝ)) (q :=
      (45463774316245559 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_314_2 :
    Uω (aρ 2) (bρ 2) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(6333858035649365264693 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45078355440033207 / 160000000000000000 : ℝ) ≤
      (-(6333858035649365264693 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45078355440033207 / 160000000000000000 : ℝ) =
            (45078355440033207 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45078355440033207 / 40000000000000000 : ℝ) ≤
            (597613767350634735307 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2817020652205479 / 10000000000000000 : ℝ)) (q :=
      (45078355440033207 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_314_3 :
    Uω (aρ 3) (bρ 3) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(2568167493990255296731 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44304669052612903 / 160000000000000000 : ℝ) ≤
      (-(2568167493990255296731 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44304669052612903 / 160000000000000000 : ℝ) =
            (44304669052612903 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44304669052612903 / 40000000000000000 : ℝ) ≤
            (204421227209744703269 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2767705960127941 / 10000000000000000 : ℝ)) (q :=
      (44304669052612903 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_314_4 :
    Uω (aρ 4) (bρ 4) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(2627448966956830868993 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8602143520749091 / 32000000000000000 : ℝ) ≤
      (-(2627448966956830868993 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8602143520749091 / 32000000000000000 : ℝ) =
            (8602143520749091 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8602143520749091 / 8000000000000000 : ℝ) ≤
            (145139754243169131007 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (268425621008451 / 1000000000000000 : ℝ)) (q :=
      (8602143520749091 / 32000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_314_5 :
    Uω (aρ 5) (bρ 5) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(13612092151165089101821 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41016097007713719 / 160000000000000000 : ℝ) ≤
      (-(13612092151165089101821 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (41016097007713719 / 160000000000000000 : ℝ) =
            (41016097007713719 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41016097007713719 / 40000000000000000 : ℝ) ≤
            (250851454834910898179 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2553118554915543 / 10000000000000000 : ℝ)) (q :=
      (41016097007713719 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_314_6 :
    Uω (aρ 6) (bρ 6) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(14351146112426458858217 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38094091951216839 / 160000000000000000 : ℝ) ≤
      (-(14351146112426458858217 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (38094091951216839 / 160000000000000000 : ℝ) =
            (38094091951216839 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38094091951216839 / 20000000000000000 : ℝ) ≤
            (6443269296573541141783 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2355108297993433 / 10000000000000000 : ℝ)) (q :=
      (38094091951216839 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_314_7 :
    Uω (aρ 7) (bρ 7) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(15502833683064404763959 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33950054053292631 / 160000000000000000 : ℝ) ≤
      (-(15502833683064404763959 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33950054053292631 / 160000000000000000 : ℝ) =
            (33950054053292631 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33950054053292631 / 20000000000000000 : ℝ) ≤
            (5291581725935595236041 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2060764941512907 / 10000000000000000 : ℝ)) (q :=
      (33950054053292631 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_314_8 :
    Uω (aρ 8) (bρ 8) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(695866732387491057881 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28092622109523383 / 160000000000000000 : ℝ) ≤
      (-(695866732387491057881 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (28092622109523383 / 160000000000000000 : ℝ) =
            (28092622109523383 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28092622109523383 / 20000000000000000 : ℝ) ≤
            (135909883972508942119 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1612127599881751 / 10000000000000000 : ℝ)) (q :=
      (28092622109523383 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_314_9 :
    Uω (aρ 9) (bρ 9) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(21437700710955841835511 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18753937738718031 / 160000000000000000 : ℝ) ≤
      (-(21437700710955841835511 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (18753937738718031 / 160000000000000000 : ℝ) =
            (18753937738718031 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18753937738718031 / 10000000000000000 : ℝ) ≤
            (6288186501044158164489 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (392878840945541 / 5000000000000000 : ℝ)) (q :=
      (18753937738718031 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_314_10 :
    Uω (aρ 10) (bρ 10) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_314_11 :
    Uω (aρ 11) (bρ 11) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_314_12 :
    Uω (aρ 12) (bρ 12) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_314_13 :
    Uω (aρ 13) (bρ 13) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_314_14 :
    Uω (aρ 14) (bρ 14) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_314_15 :
    Uω (aρ 15) (bρ 15) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_314_16 :
    Uω (aρ 16) (bρ 16) (37197312107439 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_314 :
    Uρ (37197312107439 / 128000000000000 : ℝ) ≤
      (-(514739632172362430889 / 312500000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (37197312107439 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2516515949483040556447 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (37197312107439 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6333858035649365264693 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (37197312107439 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2568167493990255296731 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (37197312107439 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2627448966956830868993 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (37197312107439 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13612092151165089101821 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (37197312107439 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14351146112426458858217 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (37197312107439 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15502833683064404763959 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (37197312107439 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(695866732387491057881 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (37197312107439 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(21437700710955841835511 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (37197312107439 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (37197312107439 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (37197312107439 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (37197312107439 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (37197312107439 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (37197312107439 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (37197312107439 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_314_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_315_1 :
    Uω (aρ 1) (bρ 1) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(1256122699521332861959 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11390238926135077 / 40000000000000000 : ℝ) ≤
      (-(1256122699521332861959 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11390238926135077 / 40000000000000000 : ℝ) =
            (11390238926135077 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11390238926135077 / 10000000000000000 : ℝ) ≤
            (130171661078667138041 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (711875739337119 / 2500000000000000 : ℝ)) (q :=
      (11390238926135077 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_315_2 :
    Uω (aρ 2) (bρ 2) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(790386156904967377561 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11293886962256527 / 40000000000000000 : ℝ) ≤
      (-(790386156904967377561 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11293886962256527 / 40000000000000000 : ℝ) =
            (11293886962256527 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11293886962256527 / 10000000000000000 : ℝ) ≤
            (76047818470032622439 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2823095987919201 / 10000000000000000 : ℝ)) (q :=
      (11293886962256527 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_315_3 :
    Uω (aρ 3) (bρ 3) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(6409458296151520141253 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11100473825217321 / 40000000000000000 : ℝ) ≤
      (-(6409458296151520141253 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11100473825217321 / 40000000000000000 : ℝ) =
            (11100473825217321 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11100473825217321 / 10000000000000000 : ℝ) ≤
            (522013506848479858747 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1386892762874799 / 5000000000000000 : ℝ)) (q :=
      (11100473825217321 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_315_4 :
    Uω (aρ 4) (bρ 4) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(1311464328789948097699 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (431080384174099 / 1600000000000000 : ℝ) ≤
      (-(1311464328789948097699 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (431080384174099 / 1600000000000000 : ℝ) =
            (431080384174099 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (431080384174099 / 400000000000000 : ℝ) ≤
            (74830031810051902301 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (107613903855287 / 400000000000000 : ℝ)) (q :=
      (431080384174099 / 1600000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_315_5 :
    Uω (aρ 5) (bρ 5) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(13588331234040514537341 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (411136708922333 / 1600000000000000 : ℝ) ≤
      (-(13588331234040514537341 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (411136708922333 / 1600000000000000 : ℝ) =
            (411136708922333 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (411136708922333 / 400000000000000 : ℝ) ≤
            (274612371959485462659 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (25592415750701 / 100000000000000 : ℝ)) (q :=
      (411136708922333 / 1600000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_315_6 :
    Uω (aρ 6) (bρ 6) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(7162695248392099559029 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9548083021930961 / 40000000000000000 : ℝ) ≤
      (-(7162695248392099559029 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9548083021930961 / 40000000000000000 : ℝ) =
            (9548083021930961 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9548083021930961 / 5000000000000000 : ℝ) ≤
            (3234512456107900440971 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1180657299823209 / 5000000000000000 : ℝ)) (q :=
      (9548083021930961 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_315_7 :
    Uω (aρ 7) (bρ 7) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(15473406480532042506811 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8512526676559121 / 40000000000000000 : ℝ) ≤
      (-(15473406480532042506811 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8512526676559121 / 40000000000000000 : ℝ) =
            (8512526676559121 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8512526676559121 / 5000000000000000 : ℝ) ≤
            (5321008928467957493189 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1033598903860249 / 5000000000000000 : ℝ)) (q :=
      (8512526676559121 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_315_8 :
    Uω (aρ 8) (bρ 8) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(8679538247702567513831 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7049606529114841 / 40000000000000000 : ℝ) ≤
      (-(8679538247702567513831 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7049606529114841 / 40000000000000000 : ℝ) =
            (7049606529114841 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7049606529114841 / 5000000000000000 : ℝ) ≤
            (1717669456797432486169 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (809639692669179 / 5000000000000000 : ℝ)) (q :=
      (7049606529114841 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_315_9 :
    Uω (aρ 9) (bρ 9) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(21360987514744639833261 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4724589607413553 / 40000000000000000 : ℝ) ≤
      (-(21360987514744639833261 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4724589607413553 / 40000000000000000 : ℝ) =
            (4724589607413553 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4724589607413553 / 2500000000000000 : ℝ) ≤
            (6364899697255360166739 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (398868276423857 / 5000000000000000 : ℝ)) (q :=
      (4724589607413553 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_315_10 :
    Uω (aρ 10) (bρ 10) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_315_11 :
    Uω (aρ 11) (bρ 11) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_315_12 :
    Uω (aρ 12) (bρ 12) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_315_13 :
    Uω (aρ 13) (bρ 13) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_315_14 :
    Uω (aρ 14) (bρ 14) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_315_15 :
    Uω (aρ 15) (bρ 15) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_315_16 :
    Uω (aρ 16) (bρ 16) (9318763916173 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_315 :
    Uρ (9318763916173 / 32000000000000 : ℝ) ≤
      (-(4113071593537865275113 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (9318763916173 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1256122699521332861959 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (9318763916173 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(790386156904967377561 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (9318763916173 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6409458296151520141253 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (9318763916173 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1311464328789948097699 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (9318763916173 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13588331234040514537341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (9318763916173 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7162695248392099559029 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (9318763916173 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15473406480532042506811 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (9318763916173 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8679538247702567513831 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (9318763916173 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(21360987514744639833261 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (9318763916173 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (9318763916173 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (9318763916173 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (9318763916173 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (9318763916173 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (9318763916173 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (9318763916173 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_315_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
