/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U26) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_316_1 :
    Uω (aρ 1) (bρ 1) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(313497993542335413487 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45658137084569129 / 160000000000000000 : ℝ) ≤
      (-(313497993542335413487 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45658137084569129 / 160000000000000000 : ℝ) =
            (45658137084569129 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45658137084569129 / 40000000000000000 : ℝ) ≤
            (33075596607664586513 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (356697114305211 / 1250000000000000 : ℝ)) (q :=
      (45658137084569129 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_316_2 :
    Uω (aρ 2) (bρ 2) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(12624687248934936222979 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45272740202355649 / 160000000000000000 : ℝ) ≤
      (-(12624687248934936222979 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45272740202355649 / 160000000000000000 : ℝ) =
            (45272740202355649 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45272740202355649 / 40000000000000000 : ℝ) ≤
            (1238256357065063777021 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2829171316675003 / 10000000000000000 : ℝ)) (q :=
      (45272740202355649 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_316_3 :
    Uω (aρ 3) (bρ 3) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(12797043708037897056853 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44499121344513537 / 160000000000000000 : ℝ) ≤
      (-(12797043708037897056853 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44499121344513537 / 160000000000000000 : ℝ) =
            (44499121344513537 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44499121344513537 / 40000000000000000 : ℝ) ≤
            (1065899897962102943147 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2779865065794739 / 10000000000000000 : ℝ)) (q :=
      (44499121344513537 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_316_4 :
    Uω (aρ 4) (bρ 4) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(13092092856450291711527 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43205358593290521 / 160000000000000000 : ℝ) ≤
      (-(13092092856450291711527 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43205358593290521 / 160000000000000000 : ℝ) =
            (43205358593290521 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43205358593290521 / 40000000000000000 : ℝ) ≤
            (770850749549708288473 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1348219451478431 / 5000000000000000 : ℝ)) (q :=
      (43205358593290521 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_316_5 :
    Uω (aρ 5) (bρ 5) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(13564627096277214139309 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41211242901442193 / 160000000000000000 : ℝ) ≤
      (-(13564627096277214139309 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (41211242901442193 / 160000000000000000 : ℝ) =
            (41211242901442193 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41211242901442193 / 40000000000000000 : ℝ) ≤
            (298316509722785860691 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2565364360810821 / 10000000000000000 : ℝ)) (q :=
      (41211242901442193 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_316_6 :
    Uω (aρ 6) (bρ 6) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(14299702482758872198407 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38290566722571937 / 160000000000000000 : ℝ) ≤
      (-(14299702482758872198407 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (38290566722571937 / 160000000000000000 : ℝ) =
            (38290566722571937 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38290566722571937 / 20000000000000000 : ℝ) ≤
            (6494712926241127801593 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2367520213592039 / 10000000000000000 : ℝ)) (q :=
      (38290566722571937 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_316_7 :
    Uω (aρ 7) (bρ 7) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(7722035347185278864809 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34150142030150001 / 160000000000000000 : ℝ) ≤
      (-(7722035347185278864809 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (34150142030150001 / 160000000000000000 : ℝ) =
            (34150142030150001 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34150142030150001 / 20000000000000000 : ℝ) ≤
            (2675172357314721135191 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2073628507799297 / 10000000000000000 : ℝ)) (q :=
      (34150142030150001 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_316_8 :
    Uω (aρ 8) (bρ 8) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(17321650244358947368713 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28304159991661457 / 160000000000000000 : ℝ) ≤
      (-(17321650244358947368713 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (28304159991661457 / 160000000000000000 : ℝ) =
            (28304159991661457 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28304159991661457 / 20000000000000000 : ℝ) ≤
            (3472765164641052631287 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1626422404328229 / 10000000000000000 : ℝ)) (q :=
      (28304159991661457 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_316_9 :
    Uω (aρ 9) (bρ 9) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(2128541148575158751237 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19041725792516417 / 160000000000000000 : ℝ) ≤
      (-(2128541148575158751237 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19041725792516417 / 160000000000000000 : ℝ) =
            (19041725792516417 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19041725792516417 / 10000000000000000 : ℝ) ≤
            (644047572624841248763 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (809583757795099 / 10000000000000000 : ℝ)) (q :=
      (19041725792516417 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_316_10 :
    Uω (aρ 10) (bρ 10) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_316_11 :
    Uω (aρ 11) (bρ 11) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_316_12 :
    Uω (aρ 12) (bρ 12) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_316_13 :
    Uω (aρ 13) (bρ 13) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_316_14 :
    Uω (aρ 14) (bρ 14) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_316_15 :
    Uω (aρ 15) (bρ 15) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_316_16 :
    Uω (aρ 16) (bρ 16) (7470559844389 / 25600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_316 :
    Uρ (7470559844389 / 25600000000000 : ℝ) ≤
      (-(16433043457405759501447 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (7470559844389 / 25600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(313497993542335413487 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (7470559844389 / 25600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12624687248934936222979 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (7470559844389 / 25600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12797043708037897056853 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (7470559844389 / 25600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(13092092856450291711527 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (7470559844389 / 25600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13564627096277214139309 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (7470559844389 / 25600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14299702482758872198407 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (7470559844389 / 25600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7722035347185278864809 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (7470559844389 / 25600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(17321650244358947368713 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (7470559844389 / 25600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2128541148575158751237 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (7470559844389 / 25600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (7470559844389 / 25600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (7470559844389 / 25600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (7470559844389 / 25600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (7470559844389 / 25600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (7470559844389 / 25600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (7470559844389 / 25600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_316_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_317_1 :
    Uω (aρ 1) (bρ 1) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(1564832224170227175487 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22877659228192339 / 80000000000000000 : ℝ) ≤
      (-(1564832224170227175487 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22877659228192339 / 80000000000000000 : ℝ) =
            (22877659228192339 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22877659228192339 / 20000000000000000 : ℝ) ≤
            (168035726579772824513 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2859650870508241 / 10000000000000000 : ℝ)) (q :=
      (22877659228192339 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_317_2 :
    Uω (aρ 2) (bρ 2) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(12603242087980496131311 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22684966250189827 / 80000000000000000 : ℝ) ≤
      (-(12603242087980496131311 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22684966250189827 / 80000000000000000 : ℝ) =
            (22684966250189827 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22684966250189827 / 20000000000000000 : ℝ) ≤
            (1259701518019503868689 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2835246638517613 / 10000000000000000 : ℝ)) (q :=
      (22684966250189827 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_317_3 :
    Uω (aρ 3) (bρ 3) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(51100874429049288073 / 40000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22298173592442603 / 80000000000000000 : ℝ) ≤
      (-(51100874429049288073 / 40000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22298173592442603 / 80000000000000000 : ℝ) =
            (22298173592442603 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22298173592442603 / 20000000000000000 : ℝ) ≤
            (4350899994950711927 / 40000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2785944580430807 / 10000000000000000 : ℝ)) (q :=
      (22298173592442603 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_317_4 :
    Uω (aρ 4) (bρ 4) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(653479665454582040087 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21651339067849943 / 80000000000000000 : ℝ) ≤
      (-(653479665454582040087 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21651339067849943 / 80000000000000000 : ℝ) =
            (21651339067849943 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21651339067849943 / 20000000000000000 : ℝ) ≤
            (39667514845417959913 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1351265065173821 / 5000000000000000 : ℝ)) (q :=
      (21651339067849943 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_317_5 :
    Uω (aρ 5) (bρ 5) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(13540979465010177493251 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4130881304873591 / 16000000000000000 : ℝ) ≤
      (-(13540979465010177493251 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4130881304873591 / 16000000000000000 : ℝ) =
            (4130881304873591 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4130881304873591 / 4000000000000000 : ℝ) ≤
            (321964140989822506749 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (514297382762429 / 2000000000000000 : ℝ)) (q :=
      (4130881304873591 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_317_6 :
    Uω (aρ 6) (bρ 6) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(14274081709003551513581 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19194397949454987 / 80000000000000000 : ℝ) ≤
      (-(14274081709003551513581 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19194397949454987 / 80000000000000000 : ℝ) =
            (19194397949454987 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19194397949454987 / 10000000000000000 : ℝ) ≤
            (6520333699996448486419 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2373725145223903 / 10000000000000000 : ℝ)) (q :=
      (19194397949454987 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_317_7 :
    Uω (aρ 7) (bρ 7) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(3853706432000757266593 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17125080092878191 / 80000000000000000 : ℝ) ≤
      (-(3853706432000757266593 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17125080092878191 / 80000000000000000 : ℝ) =
            (17125080092878191 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17125080092878191 / 10000000000000000 : ℝ) ≤
            (1344897420249242733407 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (260007132729963 / 1250000000000000 : ℝ)) (q :=
      (17125080092878191 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_317_8 :
    Uω (aρ 8) (bρ 8) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(1728438790549203311371 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14204912327560163 / 80000000000000000 : ℝ) ≤
      (-(1728438790549203311371 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (14204912327560163 / 80000000000000000 : ℝ) =
            (14204912327560163 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14204912327560163 / 10000000000000000 : ℝ) ≤
            (351002750350796688629 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1633556771850197 / 10000000000000000 : ℝ)) (q :=
      (14204912327560163 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_317_9 :
    Uω (aρ 9) (bρ 9) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(21210927637829035889281 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9592042704887499 / 80000000000000000 : ℝ) ≤
      (-(21210927637829035889281 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (9592042704887499 / 80000000000000000 : ℝ) =
            (9592042704887499 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9592042704887499 / 5000000000000000 : ℝ) ≤
            (6514959574170964110719 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (821304994542031 / 10000000000000000 : ℝ)) (q :=
      (9592042704887499 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_317_10 :
    Uω (aρ 10) (bρ 10) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_317_11 :
    Uω (aρ 11) (bρ 11) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_317_12 :
    Uω (aρ 12) (bρ 12) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_317_13 :
    Uω (aρ 13) (bρ 13) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_317_14 :
    Uω (aρ 14) (bρ 14) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_317_15 :
    Uω (aρ 15) (bρ 15) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_317_16 :
    Uω (aρ 16) (bρ 16) (18715271389599 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_317 :
    Uρ (18715271389599 / 64000000000000 : ℝ) ≤
      (-(1641393523257367651801 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (18715271389599 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1564832224170227175487 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (18715271389599 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12603242087980496131311 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (18715271389599 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) * (-(51100874429049288073 / 40000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (18715271389599 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(653479665454582040087 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (18715271389599 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13540979465010177493251 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (18715271389599 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14274081709003551513581 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (18715271389599 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3853706432000757266593 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (18715271389599 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1728438790549203311371 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (18715271389599 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(21210927637829035889281 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (18715271389599 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (18715271389599 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (18715271389599 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (18715271389599 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (18715271389599 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (18715271389599 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (18715271389599 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_317_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_318_1 :
    Uω (aρ 1) (bρ 1) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(2499488191591324361 / 2000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45852499820039187 / 160000000000000000 : ℝ) ≤
      (-(2499488191591324361 / 2000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45852499820039187 / 160000000000000000 : ℝ) =
            (45852499820039187 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45852499820039187 / 40000000000000000 : ℝ) ≤
            (273100529608675639 / 2000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (358215603194333 / 1250000000000000 : ℝ)) (q :=
      (45852499820039187 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_318_2 :
    Uω (aρ 2) (bρ 2) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(3145460707552018440057 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45467124743452883 / 160000000000000000 : ℝ) ≤
      (-(3145460707552018440057 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45467124743452883 / 160000000000000000 : ℝ) =
            (45467124743452883 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45467124743452883 / 40000000000000000 : ℝ) ≤
            (320275193947981559943 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (177582622093211 / 625000000000000 : ℝ)) (q :=
      (45467124743452883 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_318_3 :
    Uω (aρ 3) (bρ 3) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(797090067591125847769 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44693572823312123 / 160000000000000000 : ℝ) ≤
      (-(797090067591125847769 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44693572823312123 / 160000000000000000 : ℝ) =
            (44693572823312123 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44693572823312123 / 40000000000000000 : ℝ) ≤
            (69343907783874152231 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2792024069823781 / 10000000000000000 : ℝ)) (q :=
      (44693572823312123 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_318_4 :
    Uω (aρ 4) (bρ 4) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(652357220802502956437 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43399997048911691 / 160000000000000000 : ℝ) ≤
      (-(652357220802502956437 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43399997048911691 / 160000000000000000 : ℝ) =
            (43399997048911691 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43399997048911691 / 40000000000000000 : ℝ) ≤
            (40789959497497043563 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2708621279088727 / 10000000000000000 : ℝ)) (q :=
      (43399997048911691 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_318_5 :
    Uω (aρ 5) (bρ 5) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(13517388069351791248559 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41406381347382187 / 160000000000000000 : ℝ) ≤
      (-(13517388069351791248559 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (41406381347382187 / 160000000000000000 : ℝ) =
            (41406381347382187 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41406381347382187 / 40000000000000000 : ℝ) ≤
            (345555536648208751441 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2577609235732539 / 10000000000000000 : ℝ)) (q :=
      (41406381347382187 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_318_6 :
    Uω (aρ 6) (bρ 6) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(14248527817117285144357 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38487019659432091 / 160000000000000000 : ℝ) ≤
      (-(14248527817117285144357 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (38487019659432091 / 160000000000000000 : ℝ) =
            (38487019659432091 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38487019659432091 / 20000000000000000 : ℝ) ≤
            (6545887591882714855643 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2379929399878777 / 10000000000000000 : ℝ)) (q :=
      (38487019659432091 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_318_7 :
    Uω (aρ 7) (bρ 7) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(7692835495468796043633 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6870032266348943 / 32000000000000000 : ℝ) ≤
      (-(7692835495468796043633 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6870032266348943 / 32000000000000000 : ℝ) =
            (6870032266348943 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6870032266348943 / 4000000000000000 : ℝ) ≤
            (2704372209031203956367 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (417296697935571 / 2000000000000000 : ℝ)) (q :=
      (6870032266348943 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_318_8 :
    Uω (aρ 8) (bρ 8) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(431182196363598939487 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28515421009719987 / 160000000000000000 : ℝ) ≤
      (-(431182196363598939487 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (28515421009719987 / 160000000000000000 : ℝ) =
            (28515421009719987 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28515421009719987 / 20000000000000000 : ℝ) ≤
            (88678188861401060513 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (410170650191191 / 2500000000000000 : ℝ)) (q :=
      (28515421009719987 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_318_9 :
    Uω (aρ 9) (bρ 9) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(21137493907044255191037 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19325479826693587 / 160000000000000000 : ℝ) ≤
      (-(21137493907044255191037 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19325479826693587 / 160000000000000000 : ℝ) =
            (19325479826693587 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19325479826693587 / 10000000000000000 : ℝ) ≤
            (6588393304955744808963 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (406692178343 / 4882812500000 : ℝ)) (q :=
      (19325479826693587 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_318_10 :
    Uω (aρ 10) (bρ 10) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_318_11 :
    Uω (aρ 11) (bρ 11) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_318_12 :
    Uω (aρ 12) (bρ 12) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_318_13 :
    Uω (aρ 13) (bρ 13) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_318_14 :
    Uω (aρ 14) (bρ 14) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_318_15 :
    Uω (aρ 15) (bρ 15) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_318_16 :
    Uω (aρ 16) (bρ 16) (37508286336451 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_318 :
    Uρ (37508286336451 / 128000000000000 : ℝ) ≤
      (-(16394957714446851550457 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (37508286336451 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2499488191591324361 / 2000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (37508286336451 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3145460707552018440057 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (37508286336451 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(797090067591125847769 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (37508286336451 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(652357220802502956437 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (37508286336451 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13517388069351791248559 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (37508286336451 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(14248527817117285144357 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (37508286336451 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7692835495468796043633 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (37508286336451 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(431182196363598939487 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (37508286336451 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(21137493907044255191037 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (37508286336451 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (37508286336451 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (37508286336451 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (37508286336451 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (37508286336451 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (37508286336451 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (37508286336451 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_318_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_319_1 :
    Uω (aρ 1) (bρ 1) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(2495253808887446669611 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1148742029389611 / 4000000000000000 : ℝ) ≤
      (-(2495253808887446669611 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1148742029389611 / 4000000000000000 : ℝ) =
            (1148742029389611 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1148742029389611 / 1000000000000000 : ℝ) ≤
            (277334912312553330389 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (287179877958743 / 1000000000000000 : ℝ)) (q :=
      (1148742029389611 / 4000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_319_2 :
    Uω (aρ 2) (bρ 2) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(2512097855895038717213 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1423884904122721 / 5000000000000000 : ℝ) ≤
      (-(2512097855895038717213 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1423884904122721 / 5000000000000000 : ℝ) =
            (1423884904122721 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1423884904122721 / 1250000000000000 : ℝ) ≤
            (260490865304961282787 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2847397261640259 / 10000000000000000 : ℝ)) (q :=
      (1423884904122721 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_319_3 :
    Uω (aρ 3) (bρ 3) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(12731710923469879778623 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (223953991305553 / 800000000000000 : ℝ) ≤
      (-(12731710923469879778623 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (223953991305553 / 800000000000000 : ℝ) =
            (223953991305553 / 200000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (223953991305553 / 200000000000000 : ℝ) ≤
            (1131232682530120221377 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (13990517670691 / 50000000000000 : ℝ)) (q :=
      (223953991305553 / 800000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_319_4 :
    Uω (aρ 4) (bρ 4) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(3256186487277326469717 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2718582208572577 / 10000000000000000 : ℝ) ≤
      (-(3256186487277326469717 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2718582208572577 / 10000000000000000 : ℝ) =
            (2718582208572577 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2718582208572577 / 2500000000000000 : ℝ) ≤
            (209549414222673530283 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2714712349709529 / 10000000000000000 : ℝ)) (q :=
      (2718582208572577 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_319_5 :
    Uω (aρ 5) (bρ 5) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(421682895011645082857 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5187993476315311 / 20000000000000000 : ℝ) ≤
      (-(421682895011645082857 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5187993476315311 / 20000000000000000 : ℝ) =
            (5187993476315311 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5187993476315311 / 5000000000000000 : ℝ) ≤
            (11534092675854917143 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1291865664107343 / 5000000000000000 : ℝ)) (q :=
      (5187993476315311 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_319_6 :
    Uω (aρ 6) (bρ 6) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(2844608090322516779093 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4823154755797971 / 20000000000000000 : ℝ) ≤
      (-(2844608090322516779093 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4823154755797971 / 20000000000000000 : ℝ) =
            (4823154755797971 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4823154755797971 / 2500000000000000 : ℝ) ≤
            (1314274991477483220907 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1193066491418673 / 5000000000000000 : ℝ)) (q :=
      (4823154755797971 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_319_7 :
    Uω (aρ 7) (bρ 7) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(15356605898681968251623 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1076567050775089 / 5000000000000000 : ℝ) ≤
      (-(15356605898681968251623 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1076567050775089 / 5000000000000000 : ℝ) =
            (1076567050775089 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1076567050775089 / 625000000000000 : ℝ) ≤
            (5437809510318031748377 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2092907810899731 / 10000000000000000 : ℝ)) (q :=
      (1076567050775089 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_319_8 :
    Uω (aρ 8) (bρ 8) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(17210348493441849799951 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3577618742706903 / 20000000000000000 : ℝ) ≤
      (-(17210348493441849799951 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3577618742706903 / 20000000000000000 : ℝ) =
            (3577618742706903 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3577618742706903 / 2500000000000000 : ℝ) ≤
            (3584066915558150200049 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (823900000923139 / 5000000000000000 : ℝ)) (q :=
      (3577618742706903 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_319_9 :
    Uω (aρ 9) (bρ 9) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(5266267722922526326391 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9504857824393 / 78125000000000 : ℝ) ≤
      (-(5266267722922526326391 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show (9504857824393 / 78125000000000 : ℝ) = (9504857824393 / 4882812500000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9504857824393 / 4882812500000 : ℝ) ≤
            (1665204080077473673609 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (844390490543983 / 10000000000000000 : ℝ)) (q :=
      (9504857824393 / 78125000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_319_10 :
    Uω (aρ 10) (bρ 10) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_319_11 :
    Uω (aρ 11) (bρ 11) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_319_12 :
    Uω (aρ 12) (bρ 12) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_319_13 :
    Uω (aρ 13) (bρ 13) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_319_14 :
    Uω (aρ 14) (bρ 14) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_319_15 :
    Uω (aρ 15) (bρ 15) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_319_16 :
    Uω (aρ 16) (bρ 16) (4698253736713 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_319 :
    Uρ (4698253736713 / 16000000000000 : ℝ) ≤
      (-(2047013394536089855583 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4698253736713 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2495253808887446669611 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4698253736713 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2512097855895038717213 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4698253736713 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12731710923469879778623 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4698253736713 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3256186487277326469717 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4698253736713 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(421682895011645082857 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4698253736713 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2844608090322516779093 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4698253736713 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15356605898681968251623 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4698253736713 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(17210348493441849799951 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4698253736713 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5266267722922526326391 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4698253736713 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4698253736713 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4698253736713 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4698253736713 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4698253736713 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4698253736713 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4698253736713 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_319_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_320_1 :
    Uω (aρ 1) (bρ 1) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(3113785465743511281037 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46046862523071781 / 160000000000000000 : ℝ) ≤
      (-(3113785465743511281037 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46046862523071781 / 160000000000000000 : ℝ) =
            (46046862523071781 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46046862523071781 / 40000000000000000 : ℝ) ≤
            (351950435756488718963 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2877872732612957 / 10000000000000000 : ℝ)) (q :=
      (46046862523071781 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_320_2 :
    Uω (aρ 2) (bρ 2) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(12539181240894190232013 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9132301813230193 / 32000000000000000 : ℝ) ≤
      (-(12539181240894190232013 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9132301813230193 / 32000000000000000 : ℝ) =
            (9132301813230193 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9132301813230193 / 8000000000000000 : ℝ) ≤
            (1323762365105809767987 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (570694512601571 / 2000000000000000 : ℝ)) (q :=
      (9132301813230193 / 32000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_320_3 :
    Uω (aρ 3) (bρ 3) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(198594186367096513121 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1795520939983421 / 6400000000000000 : ℝ) ≤
      (-(198594186367096513121 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1795520939983421 / 6400000000000000 : ℝ) =
            (1795520939983421 / 1600000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1795520939983421 / 1600000000000000 : ℝ) ≤
            (18014307476653486879 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (112167318941487 / 400000000000000 : ℝ)) (q :=
      (1795520939983421 / 6400000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_320_4 :
    Uω (aρ 4) (bρ 4) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(13002397681596293197851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43594633004645821 / 160000000000000000 : ℝ) ≤
      (-(13002397681596293197851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43594633004645821 / 160000000000000000 : ℝ) =
            (43594633004645821 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43594633004645821 / 40000000000000000 : ℝ) ≤
            (860545924403706802149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (340100417841839 / 1250000000000000 : ℝ)) (q :=
      (43594633004645821 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_320_5 :
    Uω (aρ 5) (bρ 5) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(2694074582216508070629 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41601512451173557 / 160000000000000000 : ℝ) ≤
      (-(2694074582216508070629 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (41601512451173557 / 160000000000000000 : ℝ) =
            (41601512451173557 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41601512451173557 / 40000000000000000 : ℝ) ≤
            (78514138983491929371 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2589853192885679 / 10000000000000000 : ℝ)) (q :=
      (41601512451173557 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_320_6 :
    Uω (aρ 6) (bρ 6) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(7098809629941692031279 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38683451101567717 / 160000000000000000 : ℝ) ≤
      (-(7098809629941692031279 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (38683451101567717 / 160000000000000000 : ℝ) =
            (38683451101567717 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38683451101567717 / 20000000000000000 : ℝ) ≤
            (3298398074558307968721 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2392335899324949 / 10000000000000000 : ℝ)) (q :=
      (38683451101567717 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_320_7 :
    Uω (aρ 7) (bρ 7) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(1532762987265952141441 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6910022643929929 / 32000000000000000 : ℝ) ≤
      (-(1532762987265952141441 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6910022643929929 / 32000000000000000 : ℝ) =
            (6910022643929929 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6910022643929929 / 4000000000000000 : ℝ) ≤
            (546678553634047858559 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (209933004484519 / 1000000000000000 : ℝ)) (q :=
      (6910022643929929 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_320_8 :
    Uω (aρ 8) (bρ 8) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(8586784124854736362831 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5745282464167273 / 32000000000000000 : ℝ) ≤
      (-(8586784124854736362831 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5745282464167273 / 32000000000000000 : ℝ) =
            (5745282464167273 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5745282464167273 / 4000000000000000 : ℝ) ≤
            (1810423579645263637169 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (165490908383353 / 1000000000000000 : ℝ)) (q :=
      (5745282464167273 / 32000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_320_9 :
    Uω (aρ 9) (bρ 9) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(1312101351333463023481 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19605529662034021 / 160000000000000000 : ℝ) ≤
      (-(1312101351333463023481 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (19605529662034021 / 160000000000000000 : ℝ) =
            (19605529662034021 / 10000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19605529662034021 / 10000000000000000 : ℝ) ≤
            (420766599416536976519 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (855764379843237 / 10000000000000000 : ℝ)) (q :=
      (19605529662034021 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_320_10 :
    Uω (aρ 10) (bρ 10) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_320_11 :
    Uω (aρ 11) (bρ 11) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_320_12 :
    Uω (aρ 12) (bρ 12) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_320_13 :
    Uω (aρ 13) (bρ 13) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_320_14 :
    Uω (aρ 14) (bρ 14) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_320_15 :
    Uω (aρ 15) (bρ 15) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_320_16 :
    Uω (aρ 16) (bρ 16) (37663773450957 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_320 :
    Uρ (37663773450957 / 128000000000000 : ℝ) ≤
      (-(16357380029375922820787 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (37663773450957 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3113785465743511281037 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (37663773450957 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12539181240894190232013 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (37663773450957 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(198594186367096513121 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (37663773450957 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(13002397681596293197851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (37663773450957 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2694074582216508070629 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (37663773450957 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7098809629941692031279 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (37663773450957 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1532762987265952141441 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (37663773450957 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8586784124854736362831 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (37663773450957 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1312101351333463023481 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (37663773450957 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (37663773450957 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (37663773450957 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (37663773450957 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (37663773450957 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (37663773450957 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (37663773450957 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_320_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_321_1 :
    Uω (aρ 1) (bρ 1) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(12434059224938226750533 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23072021931276057 / 80000000000000000 : ℝ) ≤
      (-(12434059224938226750533 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (23072021931276057 / 80000000000000000 : ℝ) =
            (23072021931276057 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23072021931276057 / 20000000000000000 : ℝ) ≤
            (1428884381061773249467 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (360493335579701 / 1250000000000000 : ℝ)) (q :=
      (23072021931276057 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_321_2 :
    Uω (aρ 2) (bρ 2) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(12517918520821526742451 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22879350573235169 / 80000000000000000 : ℝ) ≤
      (-(12517918520821526742451 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22879350573235169 / 80000000000000000 : ℝ) =
            (22879350573235169 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22879350573235169 / 20000000000000000 : ℝ) ≤
            (1345025085178473257549 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1429773928818693 / 5000000000000000 : ℝ)) (q :=
      (22879350573235169 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_321_3 :
    Uω (aρ 3) (bρ 3) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(1268839188906676708531 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22492624270015249 / 80000000000000000 : ℝ) ≤
      (-(1268839188906676708531 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22492624270015249 / 80000000000000000 : ℝ) =
            (22492624270015249 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22492624270015249 / 20000000000000000 : ℝ) ≤
            (117455171693323291469 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1405131194091203 / 5000000000000000 : ℝ)) (q :=
      (22492624270015249 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_321_4 :
    Uω (aρ 4) (bρ 4) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(3245024847091790789197 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21845975027762613 / 80000000000000000 : ℝ) ≤
      (-(3245024847091790789197 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21845975027762613 / 80000000000000000 : ℝ) =
            (21845975027762613 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21845975027762613 / 20000000000000000 : ℝ) ≤
            (220711054408209210803 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2726894258684247 / 10000000000000000 : ℝ)) (q :=
      (21845975027762613 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_321_5 :
    Uω (aρ 5) (bρ 5) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(3361737154102947906173 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20849537641114421 / 80000000000000000 : ℝ) ≤
      (-(3361737154102947906173 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (20849537641114421 / 80000000000000000 : ℝ) =
            (20849537641114421 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20849537641114421 / 20000000000000000 : ℝ) ≤
            (103998747397052093827 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2595974831357199 / 10000000000000000 : ℝ)) (q :=
      (20849537641114421 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_321_6 :
    Uω (aρ 6) (bρ 6) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(2834452778434685974403 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19390829433174889 / 80000000000000000 : ℝ) ≤
      (-(2834452778434685974403 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19390829433174889 / 80000000000000000 : ℝ) =
            (19390829433174889 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19390829433174889 / 10000000000000000 : ℝ) ≤
            (1324430303365314025597 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (599634538628079 / 2500000000000000 : ℝ)) (q :=
      (19390829433174889 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_321_7 :
    Uω (aρ 7) (bρ 7) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(3059748468025370392999 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3465006426906649 / 16000000000000000 : ℝ) ≤
      (-(3059748468025370392999 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3465006426906649 / 16000000000000000 : ℝ) =
            (3465006426906649 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3465006426906649 / 2000000000000000 : ℝ) ≤
            (1099134613774629607001 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (421150042122381 / 2000000000000000 : ℝ)) (q :=
      (3465006426906649 / 16000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_321_8 :
    Uω (aρ 8) (bρ 8) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(4284236393973365117899 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14415904500640873 / 80000000000000000 : ℝ) ≤
      (-(4284236393973365117899 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (14415904500640873 / 80000000000000000 : ℝ) =
            (14415904500640873 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14415904500640873 / 10000000000000000 : ℝ) ≤
            (914367458276634882101 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (415502488369703 / 2500000000000000 : ℝ)) (q :=
      (14415904500640873 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_321_9 :
    Uω (aρ 9) (bρ 9) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(326923614860068943593 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9872128646489561 / 80000000000000000 : ℝ) ≤
      (-(326923614860068943593 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (9872128646489561 / 80000000000000000 : ℝ) =
            (9872128646489561 / 5000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9872128646489561 / 5000000000000000 : ℝ) ≤
            (106293372827431056407 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (108378952287623 / 1250000000000000 : ℝ)) (q :=
      (9872128646489561 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_321_10 :
    Uω (aρ 10) (bρ 10) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_321_11 :
    Uω (aρ 11) (bρ 11) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_321_12 :
    Uω (aρ 12) (bρ 12) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_321_13 :
    Uω (aρ 13) (bρ 13) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_321_14 :
    Uω (aρ 14) (bρ 14) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_321_15 :
    Uω (aρ 15) (bρ 15) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_321_16 :
    Uω (aρ 16) (bρ 16) (3774151700821 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_321 :
    Uρ (3774151700821 / 12800000000000 : ℝ) ≤
      (-(1021173312797747915237 / 625000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3774151700821 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(12434059224938226750533 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3774151700821 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12517918520821526742451 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3774151700821 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1268839188906676708531 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3774151700821 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3245024847091790789197 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3774151700821 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3361737154102947906173 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3774151700821 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2834452778434685974403 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3774151700821 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3059748468025370392999 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3774151700821 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4284236393973365117899 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3774151700821 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(326923614860068943593 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3774151700821 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3774151700821 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3774151700821 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3774151700821 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3774151700821 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3774151700821 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3774151700821 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_321_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_322_1 :
    Uω (aρ 1) (bρ 1) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(496520837715664407951 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46241225194075943 / 160000000000000000 : ℝ) ≤
      (-(496520837715664407951 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46241225194075943 / 160000000000000000 : ℝ) =
            (46241225194075943 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46241225194075943 / 40000000000000000 : ℝ) ≤
            (57996906524335592049 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (180626289729231 / 625000000000000 : ℝ)) (q :=
      (46241225194075943 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_322_2 :
    Uω (aρ 2) (bρ 2) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(124967009268472262333 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45855893173228023 / 160000000000000000 : ℝ) ≤
      (-(124967009268472262333 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45855893173228023 / 160000000000000000 : ℝ) =
            (45855893173228023 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45855893173228023 / 40000000000000000 : ℝ) ≤
            (13662426791527737667 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1432811572785853 / 5000000000000000 : ℝ)) (q :=
      (45855893173228023 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_322_3 :
    Uω (aρ 3) (bρ 3) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(253336052101030294349 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45082473383727919 / 160000000000000000 : ℝ) ≤
      (-(253336052101030294349 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45082473383727919 / 160000000000000000 : ℝ) =
            (45082473383727919 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45082473383727919 / 40000000000000000 : ℝ) ≤
            (23922820018969705651 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2816341778234193 / 10000000000000000 : ℝ)) (q :=
      (45082473383727919 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_322_4 :
    Uω (aρ 4) (bρ 4) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(6478925422896764806271 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43789266493922071 / 160000000000000000 : ℝ) ≤
      (-(6478925422896764806271 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43789266493922071 / 160000000000000000 : ℝ) =
            (43789266493922071 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43789266493922071 / 40000000000000000 : ℝ) ≤
            (452546380103235193729 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1366492549036731 / 5000000000000000 : ℝ)) (q :=
      (43789266493922071 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_322_5 :
    Uω (aρ 5) (bρ 5) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(13423579493192682497527 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41796636316459999 / 160000000000000000 : ℝ) ≤
      (-(13423579493192682497527 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (41796636316459999 / 160000000000000000 : ℝ) =
            (41796636316459999 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41796636316459999 / 40000000000000000 : ℝ) ≤
            (439364112807317502473 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2602096245225703 / 10000000000000000 : ℝ)) (q :=
      (41796636316459999 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_322_6 :
    Uω (aρ 6) (bρ 6) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(2829394800309022849977 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38879861381664647 / 160000000000000000 : ℝ) ≤
      (-(2829394800309022849977 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (38879861381664647 / 160000000000000000 : ℝ) =
            (38879861381664647 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38879861381664647 / 20000000000000000 : ℝ) ≤
            (1329488281490977150023 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (601184938379071 / 2500000000000000 : ℝ)) (q :=
      (38879861381664647 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_322_7 :
    Uω (aρ 7) (bρ 7) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(15269942734092825618979 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6949999784785659 / 32000000000000000 : ℝ) ≤
      (-(15269942734092825618979 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6949999784785659 / 32000000000000000 : ℝ) =
            (6949999784785659 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6949999784785659 / 4000000000000000 : ℝ) ≤
            (5524472674907174381021 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (52804208176481 / 250000000000000 : ℝ)) (q :=
      (6949999784785659 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_322_8 :
    Uω (aρ 8) (bρ 8) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(1710047894900604801367 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28937140821498503 / 160000000000000000 : ℝ) ≤
      (-(1710047894900604801367 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (28937140821498503 / 160000000000000000 : ℝ) =
            (28937140821498503 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28937140821498503 / 20000000000000000 : ℝ) ≤
            (369393645999395198633 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (417275678898879 / 2500000000000000 : ℝ)) (q :=
      (28937140821498503 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_322_9 :
    Uω (aρ 9) (bρ 9) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(20853507377490201335747 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3976432911427427 / 32000000000000000 : ℝ) ≤
      (-(20853507377490201335747 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (3976432911427427 / 32000000000000000 : ℝ) =
            (3976432911427427 / 2000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3976432911427427 / 2000000000000000 : ℝ) ≤
            (6872379834509798664253 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (175639262182069 / 2000000000000000 : ℝ)) (q :=
      (3976432911427427 / 32000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_322_10 :
    Uω (aρ 10) (bρ 10) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_322_11 :
    Uω (aρ 11) (bρ 11) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_322_12 :
    Uω (aρ 12) (bρ 12) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_322_13 :
    Uω (aρ 13) (bρ 13) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_322_14 :
    Uω (aρ 14) (bρ 14) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_322_15 :
    Uω (aρ 15) (bρ 15) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_322_16 :
    Uω (aρ 16) (bρ 16) (37819260565463 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_322 :
    Uρ (37819260565463 / 128000000000000 : ℝ) ≤
      (-(16320282936987819977121 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (37819260565463 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(496520837715664407951 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (37819260565463 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(124967009268472262333 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (37819260565463 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(253336052101030294349 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (37819260565463 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6478925422896764806271 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (37819260565463 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13423579493192682497527 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (37819260565463 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2829394800309022849977 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (37819260565463 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15269942734092825618979 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (37819260565463 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1710047894900604801367 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (37819260565463 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(20853507377490201335747 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (37819260565463 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (37819260565463 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (37819260565463 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (37819260565463 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (37819260565463 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (37819260565463 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (37819260565463 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_322_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_323_1 :
    Uω (aρ 1) (bρ 1) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(3098006707644175633397 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11584601629423329 / 40000000000000000 : ℝ) ≤
      (-(3098006707644175633397 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11584601629423329 / 40000000000000000 : ℝ) =
            (11584601629423329 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11584601629423329 / 10000000000000000 : ℝ) ≤
            (367729193855824366603 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2896094585709477 / 10000000000000000 : ℝ)) (q :=
      (11584601629423329 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_323_2 :
    Uω (aρ 2) (bρ 2) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(12475528267784406772859 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11488271286690993 / 40000000000000000 : ℝ) ≤
      (-(12475528267784406772859 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11488271286690993 / 40000000000000000 : ℝ) =
            (11488271286690993 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11488271286690993 / 10000000000000000 : ℝ) ≤
            (1387415338215593227141 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2871698426853309 / 10000000000000000 : ℝ)) (q :=
      (11488271286690993 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_323_3 :
    Uω (aρ 3) (bρ 3) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(2529051974725758156739 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11294924507987287 / 40000000000000000 : ℝ) ≤
      (-(2529051974725758156739 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11294924507987287 / 40000000000000000 : ℝ) =
            (11294924507987287 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11294924507987287 / 10000000000000000 : ℝ) ≤
            (243536746474241843261 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (44100330372679 / 156250000000000 : ℝ)) (q :=
      (11294924507987287 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_323_4 :
    Uω (aρ 4) (bρ 4) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(6467825915874434987103 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10971645580980563 / 40000000000000000 : ℝ) ≤
      (-(6467825915874434987103 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10971645580980563 / 40000000000000000 : ℝ) =
            (10971645580980563 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10971645580980563 / 10000000000000000 : ℝ) ≤
            (463645887125565012897 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1369537930706547 / 5000000000000000 : ℝ)) (q :=
      (10971645580980563 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_323_5 :
    Uω (aρ 5) (bρ 5) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(13400265280141196180749 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10473548891629579 / 40000000000000000 : ℝ) ≤
      (-(13400265280141196180749 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10473548891629579 / 40000000000000000 : ℝ) =
            (10473548891629579 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10473548891629579 / 10000000000000000 : ℝ) ≤
            (462678325858803819251 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1304108718036301 / 5000000000000000 : ℝ)) (q :=
      (10473548891629579 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_323_6 :
    Uω (aρ 6) (bρ 6) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(1412174924384875215969 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9744514672005377 / 40000000000000000 : ℝ) ≤
      (-(1412174924384875215969 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9744514672005377 / 40000000000000000 : ℝ) =
            (9744514672005377 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9744514672005377 / 5000000000000000 : ℝ) ≤
            (667266616515124784031 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2410940701400501 / 10000000000000000 : ℝ)) (q :=
      (9744514672005377 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_323_7 :
    Uω (aρ 7) (bρ 7) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(15241230493239060186719 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8712479333308459 / 40000000000000000 : ℝ) ≤
      (-(15241230493239060186719 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8712479333308459 / 40000000000000000 : ℝ) =
            (8712479333308459 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8712479333308459 / 5000000000000000 : ℝ) ≤
            (5553184915760939813281 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1059292206406021 / 5000000000000000 : ℝ)) (q :=
      (8712479333308459 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_323_8 :
    Uω (aρ 8) (bρ 8) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(8532083434991892629273 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7260602151212977 / 40000000000000000 : ℝ) ≤
      (-(8532083434991892629273 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7260602151212977 / 40000000000000000 : ℝ) =
            (7260602151212977 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7260602151212977 / 5000000000000000 : ℝ) ≤
            (1865124269508107370727 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1676187473104301 / 10000000000000000 : ℝ)) (q :=
      (7260602151212977 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_323_9 :
    Uω (aρ 9) (bρ 9) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(20784778876778594280753 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5004820588425443 / 40000000000000000 : ℝ) ≤
      (-(20784778876778594280753 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5004820588425443 / 40000000000000000 : ℝ) =
            (5004820588425443 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5004820588425443 / 5000000000000000 : ℝ) ≤
            (9636532221405719247 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (444631160035267 / 5000000000000000 : ℝ)) (q :=
      (5004820588425443 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_323_10 :
    Uω (aρ 10) (bρ 10) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_323_11 :
    Uω (aρ 11) (bρ 11) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_323_12 :
    Uω (aρ 12) (bρ 12) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_323_13 :
    Uω (aρ 13) (bρ 13) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_323_14 :
    Uω (aρ 14) (bρ 14) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_323_15 :
    Uω (aρ 15) (bρ 15) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_323_16 :
    Uω (aρ 16) (bρ 16) (9474251030679 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_323 :
    Uρ (9474251030679 / 32000000000000 : ℝ) ≤
      (-(815095342484062068619 / 500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (9474251030679 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3098006707644175633397 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (9474251030679 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12475528267784406772859 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (9474251030679 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2529051974725758156739 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (9474251030679 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6467825915874434987103 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (9474251030679 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(13400265280141196180749 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (9474251030679 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1412174924384875215969 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (9474251030679 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15241230493239060186719 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (9474251030679 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8532083434991892629273 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (9474251030679 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(20784778876778594280753 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (9474251030679 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (9474251030679 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (9474251030679 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (9474251030679 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (9474251030679 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (9474251030679 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (9474251030679 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_323_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_324_1 :
    Uω (aρ 1) (bρ 1) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(1546384587863347391307 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46435587833453881 / 160000000000000000 : ℝ) ≤
      (-(1546384587863347391307 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46435587833453881 / 160000000000000000 : ℝ) =
            (46435587833453881 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46435587833453881 / 40000000000000000 : ℝ) ≤
            (186483362886652608693 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2902168534769157 / 10000000000000000 : ℝ)) (q :=
      (46435587833453881 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_324_2 :
    Uω (aρ 2) (bρ 2) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(12454400353658942523317 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46050277067415249 / 160000000000000000 : ℝ) ≤
      (-(12454400353658942523317 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46050277067415249 / 160000000000000000 : ℝ) =
            (46050277067415249 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46050277067415249 / 40000000000000000 : ℝ) ≤
            (1408543252341057476683 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (359721712690541 / 1250000000000000 : ℝ)) (q :=
      (46050277067415249 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_324_3 :
    Uω (aρ 3) (bρ 3) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(6311881747142055395947 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (362215379887637 / 1280000000000000 : ℝ) ≤
      (-(6311881747142055395947 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (362215379887637 / 1280000000000000 : ℝ) =
            (362215379887637 / 320000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (362215379887637 / 320000000000000 : ℝ) ≤
            (619590055857944604053 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (11314001940767 / 40000000000000 : ℝ)) (q :=
      (362215379887637 / 1280000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_324_4 :
    Uω (aρ 4) (bρ 4) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(6456751062797533349511 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43983897549575361 / 160000000000000000 : ℝ) ≤
      (-(6456751062797533349511 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43983897549575361 / 160000000000000000 : ℝ) =
            (43983897549575361 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43983897549575361 / 40000000000000000 : ℝ) ≤
            (474720740202466650489 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1372583274604671 / 5000000000000000 : ℝ)) (q :=
      (43983897549575361 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_324_5 :
    Uω (aρ 5) (bρ 5) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(1337700571783894728703 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41991753044936137 / 160000000000000000 : ℝ) ≤
      (-(1337700571783894728703 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (41991753044936137 / 160000000000000000 : ℝ) =
            (41991753044936137 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41991753044936137 / 40000000000000000 : ℝ) ≤
            (48593788816105271297 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2614338405464439 / 10000000000000000 : ℝ)) (q :=
      (41991753044936137 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_324_6 :
    Uω (aρ 6) (bρ 6) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(704829463884613062753 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39076250825509641 / 160000000000000000 : ℝ) ≤
      (-(704829463884613062753 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (39076250825509641 / 160000000000000000 : ℝ) =
            (39076250825509641 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39076250825509641 / 20000000000000000 : ℝ) ≤
            (334891306565386937247 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2417141003176127 / 10000000000000000 : ℝ)) (q :=
      (39076250825509641 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_324_7 :
    Uω (aρ 7) (bρ 7) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(15212605061841808395923 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34949819644135537 / 160000000000000000 : ℝ) ≤
      (-(15212605061841808395923 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (34949819644135537 / 160000000000000000 : ℝ) =
            (34949819644135537 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34949819644135537 / 20000000000000000 : ℝ) ≤
            (5581810347158191604077 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (531249621566091 / 2500000000000000 : ℝ)) (q :=
      (34949819644135537 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_324_8 :
    Uω (aρ 8) (bρ 8) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(17028007863161623062419 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29147613159923817 / 160000000000000000 : ℝ) ≤
      (-(17028007863161623062419 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (29147613159923817 / 160000000000000000 : ℝ) =
            (29147613159923817 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29147613159923817 / 20000000000000000 : ℝ) ≤
            (3766407545838376937581 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1683264327077899 / 10000000000000000 : ℝ)) (q :=
      (29147613159923817 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_324_9 :
    Uω (aρ 9) (bρ 9) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(4143379349202316265587 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20155639796037609 / 160000000000000000 : ℝ) ≤
      (-(4143379349202316265587 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (20155639796037609 / 160000000000000000 : ℝ) =
            (20155639796037609 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20155639796037609 / 20000000000000000 : ℝ) ≤
            (15503732597683734413 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (900233284952123 / 10000000000000000 : ℝ)) (q :=
      (20155639796037609 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_324_10 :
    Uω (aρ 10) (bρ 10) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_324_11 :
    Uω (aρ 11) (bρ 11) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_324_12 :
    Uω (aρ 12) (bρ 12) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_324_13 :
    Uω (aρ 13) (bρ 13) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_324_14 :
    Uω (aρ 14) (bρ 14) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_324_15 :
    Uω (aρ 15) (bρ 15) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_324_16 :
    Uω (aρ 16) (bρ 16) (37974747679969 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_324 :
    Uρ (37974747679969 / 128000000000000 : ℝ) ≤
      (-(8141820960763928849147 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (37974747679969 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1546384587863347391307 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (37974747679969 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12454400353658942523317 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (37974747679969 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6311881747142055395947 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (37974747679969 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6456751062797533349511 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (37974747679969 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1337700571783894728703 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (37974747679969 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(704829463884613062753 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (37974747679969 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15212605061841808395923 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (37974747679969 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(17028007863161623062419 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (37974747679969 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4143379349202316265587 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (37974747679969 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (37974747679969 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (37974747679969 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (37974747679969 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (37974747679969 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (37974747679969 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (37974747679969 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_324_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_325_1 :
    Uω (aρ 1) (bρ 1) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(12350170375956099393281 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23266384570703427 / 80000000000000000 : ℝ) ≤
      (-(12350170375956099393281 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (23266384570703427 / 80000000000000000 : ℝ) =
            (23266384570703427 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23266384570703427 / 20000000000000000 : ℝ) ≤
            (1512773230043900606719 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (363530310356611 / 1250000000000000 : ℝ)) (q :=
      (23266384570703427 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_325_2 :
    Uω (aρ 2) (bρ 2) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(248666339913984400827 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23073734467758043 / 80000000000000000 : ℝ) ≤
      (-(248666339913984400827 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (23073734467758043 / 80000000000000000 : ℝ) =
            (23073734467758043 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23073734467758043 / 20000000000000000 : ℝ) ≤
            (28592532206015599173 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1441924484813271 / 5000000000000000 : ℝ)) (q :=
      (23073734467758043 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_325_3 :
    Uω (aρ 3) (bρ 3) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(2520462653559380998639 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22687073373496971 / 80000000000000000 : ℝ) ≤
      (-(2520462653559380998639 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22687073373496971 / 80000000000000000 : ℝ) =
            (22687073373496971 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22687073373496971 / 20000000000000000 : ℝ) ≤
            (252126067640619001361 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1417289901205637 / 5000000000000000 : ℝ)) (q :=
      (22687073373496971 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_325_4 :
    Uω (aρ 4) (bρ 4) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(12891401508169105599223 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22040606087447539 / 80000000000000000 : ℝ) ≤
      (-(12891401508169105599223 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22040606087447539 / 80000000000000000 : ℝ) =
            (22040606087447539 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22040606087447539 / 20000000000000000 : ℝ) ≤
            (971542097830894400777 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (687814290490979 / 2500000000000000 : ℝ)) (q :=
      (22040606087447539 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_325_5 :
    Uω (aρ 5) (bρ 5) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(3338450137178833629859 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21044654382064131 / 80000000000000000 : ℝ) ≤
      (-(3338450137178833629859 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21044654382064131 / 80000000000000000 : ℝ) =
            (21044654382064131 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21044654382064131 / 20000000000000000 : ℝ) ≤
            (127285764321166370141 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (327557394369133 / 1250000000000000 : ℝ)) (q :=
      (21044654382064131 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_325_6 :
    Uω (aρ 6) (bρ 6) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(1758936720551409517731 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19587218916901939 / 80000000000000000 : ℝ) ≤
      (-(1758936720551409517731 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19587218916901939 / 80000000000000000 : ℝ) =
            (19587218916901939 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19587218916901939 / 10000000000000000 : ℝ) ≤
            (840365205573590482269 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (605835165950629 / 2500000000000000 : ℝ)) (q :=
      (19587218916901939 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_325_7 :
    Uω (aρ 7) (bρ 7) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(15184065889695235582767 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17524853000984307 / 80000000000000000 : ℝ) ≤
      (-(15184065889695235582767 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17524853000984307 / 80000000000000000 : ℝ) =
            (17524853000984307 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17524853000984307 / 10000000000000000 : ℝ) ≤
            (5610349519304764417233 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (532852641395777 / 2500000000000000 : ℝ)) (q :=
      (17524853000984307 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_325_8 :
    Uω (aρ 8) (bρ 8) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(8496000237880936070873 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14626377640430259 / 80000000000000000 : ℝ) ≤
      (-(8496000237880936070873 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (14626377640430259 / 80000000000000000 : ℝ) =
            (14626377640430259 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14626377640430259 / 10000000000000000 : ℝ) ≤
            (1901207466619063929127 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (422583344196149 / 2500000000000000 : ℝ)) (q :=
      (14626377640430259 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_325_9 :
    Uω (aρ 9) (bρ 9) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(10324916742774442850357 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10145632175558567 / 80000000000000000 : ℝ) ≤
      (-(10324916742774442850357 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10145632175558567 / 80000000000000000 : ℝ) =
            (10145632175558567 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10145632175558567 / 10000000000000000 : ℝ) ≤
            (72290961725557149643 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (911112638926673 / 10000000000000000 : ℝ)) (q :=
      (10145632175558567 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_325_10 :
    Uω (aρ 10) (bρ 10) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_325_11 :
    Uω (aρ 11) (bρ 11) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_325_12 :
    Uω (aρ 12) (bρ 12) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_325_13 :
    Uω (aρ 13) (bρ 13) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_325_14 :
    Uω (aρ 14) (bρ 14) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_325_15 :
    Uω (aρ 15) (bρ 15) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_325_16 :
    Uω (aρ 16) (bρ 16) (19026245618611 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_325 :
    Uρ (19026245618611 / 64000000000000 : ℝ) ≤
      (-(16265485475807527019511 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (19026245618611 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(12350170375956099393281 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (19026245618611 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(248666339913984400827 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (19026245618611 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2520462653559380998639 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (19026245618611 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(12891401508169105599223 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (19026245618611 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3338450137178833629859 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (19026245618611 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1758936720551409517731 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (19026245618611 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15184065889695235582767 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (19026245618611 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8496000237880936070873 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (19026245618611 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(10324916742774442850357 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (19026245618611 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (19026245618611 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (19026245618611 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (19026245618611 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (19026245618611 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (19026245618611 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (19026245618611 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_325_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_326_1 :
    Uω (aρ 1) (bρ 1) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(308232691673755184269 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46629950441601067 / 160000000000000000 : ℝ) ≤
      (-(308232691673755184269 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46629950441601067 / 160000000000000000 : ℝ) =
            (46629950441601067 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46629950441601067 / 40000000000000000 : ℝ) ≤
            (38340898476244815731 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1457158214983387 / 5000000000000000 : ℝ)) (q :=
      (46629950441601067 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_326_2 :
    Uω (aρ 2) (bρ 2) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(775767375395375690883 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46244660751397899 / 160000000000000000 : ℝ) ≤
      (-(775767375395375690883 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46244660751397899 / 160000000000000000 : ℝ) =
            (46244660751397899 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46244660751397899 / 40000000000000000 : ℝ) ≤
            (90666599979624309117 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1444962115600689 / 5000000000000000 : ℝ)) (q :=
      (46244660751397899 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_326_3 :
    Uω (aρ 3) (bρ 3) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(2516181799245877235259 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45471370816306019 / 160000000000000000 : ℝ) ≤
      (-(2516181799245877235259 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45471370816306019 / 160000000000000000 : ℝ) =
            (45471370816306019 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45471370816306019 / 40000000000000000 : ℝ) ≤
            (256406921954122764741 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2840659095664893 / 10000000000000000 : ℝ)) (q :=
      (45471370816306019 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_326_4 :
    Uω (aρ 4) (bρ 4) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(12869349761769917993087 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44178526203859579 / 160000000000000000 : ℝ) ≤
      (-(12869349761769917993087 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (44178526203859579 / 160000000000000000 : ℝ) =
            (44178526203859579 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44178526203859579 / 40000000000000000 : ℝ) ≤
            (993593844230082006913 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (344668462521761 / 1250000000000000 : ℝ)) (q :=
      (44178526203859579 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_326_5 :
    Uω (aρ 5) (bρ 5) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(533225980681196273301 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42186862736393331 / 160000000000000000 : ℝ) ≤
      (-(533225980681196273301 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42186862736393331 / 160000000000000000 : ℝ) =
            (42186862736393331 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42186862736393331 / 40000000000000000 : ℝ) ≤
            (21291763558803726699 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2626579686075807 / 10000000000000000 : ℝ)) (q :=
      (42186862736393331 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_326_6 :
    Uω (aρ 6) (bρ 6) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(3511615592009915733251 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39272619752170011 / 160000000000000000 : ℝ) ≤
      (-(3511615592009915733251 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (39272619752170011 / 160000000000000000 : ℝ) =
            (39272619752170011 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39272619752170011 / 20000000000000000 : ℝ) ≤
            (1686988260240084266749 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (607384922046973 / 2500000000000000 : ℝ)) (q :=
      (39272619752170011 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_326_7 :
    Uω (aρ 7) (bρ 7) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(473612888501125712317 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35149576550279731 / 160000000000000000 : ℝ) ≤
      (-(473612888501125712317 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (35149576550279731 / 160000000000000000 : ℝ) =
            (35149576550279731 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35149576550279731 / 20000000000000000 : ℝ) ≤
            (176212593030124287683 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2137820668711607 / 10000000000000000 : ℝ)) (q :=
      (35149576550279731 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_326_8 :
    Uω (aρ 8) (bρ 8) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(16956143277397500307727 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29357835747710419 / 160000000000000000 : ℝ) ≤
      (-(16956143277397500307727 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (29357835747710419 / 160000000000000000 : ℝ) =
            (29357835747710419 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29357835747710419 / 20000000000000000 : ℝ) ≤
            (3838272131602499692273 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1697394719730443 / 10000000000000000 : ℝ)) (q :=
      (29357835747710419 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_326_9 :
    Uω (aρ 9) (bρ 9) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(20583563068231126965171 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (817047278612811 / 6400000000000000 : ℝ) ≤
      (-(20583563068231126965171 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (817047278612811 / 6400000000000000 : ℝ) =
            (817047278612811 / 800000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (817047278612811 / 800000000000000 : ℝ) ≤
            (210852340768873034829 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (36876145011667 / 400000000000000 : ℝ)) (q :=
      (817047278612811 / 6400000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_326_10 :
    Uω (aρ 10) (bρ 10) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_326_11 :
    Uω (aρ 11) (bρ 11) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_326_12 :
    Uω (aρ 12) (bρ 12) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_326_13 :
    Uω (aρ 13) (bρ 13) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_326_14 :
    Uω (aρ 14) (bρ 14) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_326_15 :
    Uω (aρ 15) (bρ 15) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_326_16 :
    Uω (aρ 16) (bρ 16) (1525209391779 / 5120000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_326 :
    Uρ (1525209391779 / 5120000000000 : ℝ) ≤
      (-(162474349687928098737 / 100000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1525209391779 / 5120000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(308232691673755184269 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1525209391779 / 5120000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(775767375395375690883 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1525209391779 / 5120000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2516181799245877235259 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1525209391779 / 5120000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(12869349761769917993087 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1525209391779 / 5120000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(533225980681196273301 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1525209391779 / 5120000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3511615592009915733251 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1525209391779 / 5120000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(473612888501125712317 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1525209391779 / 5120000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(16956143277397500307727 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1525209391779 / 5120000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(20583563068231126965171 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1525209391779 / 5120000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1525209391779 / 5120000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1525209391779 / 5120000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1525209391779 / 5120000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1525209391779 / 5120000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1525209391779 / 5120000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1525209391779 / 5120000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_326_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_327_1 :
    Uω (aρ 1) (bρ 1) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(492339535770254087997 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (730111433345077 / 2500000000000000 : ℝ) ≤
      (-(492339535770254087997 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (730111433345077 / 2500000000000000 : ℝ) =
            (730111433345077 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (730111433345077 / 625000000000000 : ℝ) ≤
            (62178208469745912003 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1460195188058433 / 5000000000000000 : ℝ)) (q :=
      (730111433345077 / 2500000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_327_2 :
    Uω (aρ 2) (bρ 2) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(12391283199142446414239 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2896365782211833 / 10000000000000000 : ℝ) ≤
      (-(12391283199142446414239 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2896365782211833 / 10000000000000000 : ℝ) =
            (2896365782211833 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2896365782211833 / 2500000000000000 : ℝ) ≤
            (1471660406857553585761 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (723999871572479 / 2500000000000000 : ℝ)) (q :=
      (2896365782211833 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_327_3 :
    Uω (aρ 3) (bρ 3) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(12559550482915562925899 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1139214867377979 / 4000000000000000 : ℝ) ≤
      (-(12559550482915562925899 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1139214867377979 / 4000000000000000 : ℝ) =
            (1139214867377979 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1139214867377979 / 1000000000000000 : ℝ) ≤
            (1303393123084437074101 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (569347673021229 / 2000000000000000 : ℝ)) (q :=
      (1139214867377979 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_327_4 :
    Uω (aρ 4) (bρ 4) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(2569469334029075128739 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5534479955051489 / 20000000000000000 : ℝ) ≤
      (-(2569469334029075128739 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5534479955051489 / 20000000000000000 : ℝ) =
            (5534479955051489 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5534479955051489 / 5000000000000000 : ℝ) ≤
            (203119387170924871261 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2763438164332739 / 10000000000000000 : ℝ)) (q :=
      (5534479955051489 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_327_5 :
    Uω (aρ 5) (bρ 5) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(532302094754197904583 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1057110374347879 / 4000000000000000 : ℝ) ≤
      (-(532302094754197904583 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1057110374347879 / 4000000000000000 : ℝ) =
            (1057110374347879 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1057110374347879 / 1000000000000000 : ℝ) ≤
            (22215649485802095417 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (526540000071129 / 2000000000000000 : ℝ)) (q :=
      (1057110374347879 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_327_6 :
    Uω (aρ 6) (bρ 6) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(3505373688820111534097 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (30758434858961 / 125000000000000 : ℝ) ≤
      (-(3505373688820111534097 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (30758434858961 / 125000000000000 : ℝ) = (30758434858961 / 15625000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (30758434858961 / 15625000000000 : ℝ) ≤
            (1693230163429888465903 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (243573808119001 / 1000000000000000 : ℝ)) (q :=
      (30758434858961 / 125000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_327_7 :
    Uω (aρ 7) (bρ 7) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(15127244149469302294097 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2203089464428441 / 10000000000000000 : ℝ) ≤
      (-(15127244149469302294097 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2203089464428441 / 10000000000000000 : ℝ) =
            (2203089464428441 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2203089464428441 / 1250000000000000 : ℝ) ≤
            (5667171259530697705903 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (536057203343283 / 2500000000000000 : ℝ)) (q :=
      (2203089464428441 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_327_8 :
    Uω (aρ 8) (bρ 8) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(52876358936216522127 / 31250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (920714228960997 / 5000000000000000 : ℝ) ≤
      (-(52876358936216522127 / 31250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (920714228960997 / 5000000000000000 : ℝ) =
            (920714228960997 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (920714228960997 / 625000000000000 : ℝ) ≤
            (12106189216908477873 / 31250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (852224225850119 / 5000000000000000 : ℝ)) (q :=
      (920714228960997 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_327_9 :
    Uω (aρ 9) (bρ 9) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(4103612166609828334827 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (642513036818419 / 5000000000000000 : ℝ) ≤
      (-(4103612166609828334827 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (642513036818419 / 5000000000000000 : ℝ) =
            (642513036818419 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (642513036818419 / 625000000000000 : ℝ) ≤
            (55270915190171665173 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (466304655744963 / 5000000000000000 : ℝ)) (q :=
      (642513036818419 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_327_10 :
    Uω (aρ 10) (bρ 10) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_327_11 :
    Uω (aρ 11) (bρ 11) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_327_12 :
    Uω (aρ 12) (bρ 12) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_327_13 :
    Uω (aρ 13) (bρ 13) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_327_14 :
    Uω (aρ 14) (bρ 14) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_327_15 :
    Uω (aρ 15) (bρ 15) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_327_16 :
    Uω (aρ 16) (bρ 16) (2387998646983 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_327 :
    Uρ (2387998646983 / 8000000000000 : ℝ) ≤
      (-(8114743990152761941807 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2387998646983 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(492339535770254087997 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2387998646983 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(12391283199142446414239 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2387998646983 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(12559550482915562925899 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2387998646983 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2569469334029075128739 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2387998646983 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(532302094754197904583 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2387998646983 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3505373688820111534097 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2387998646983 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(15127244149469302294097 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2387998646983 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) * (-(52876358936216522127 / 31250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2387998646983 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4103612166609828334827 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2387998646983 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2387998646983 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2387998646983 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2387998646983 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2387998646983 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2387998646983 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2387998646983 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_327_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
