/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U28) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_340_1 :
    Uω (aρ 1) (bρ 1) (200369118629 / 640000000000 : ℝ) ≤
      (-(369418863686504577121 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3066217534982953 / 10000000000000000 : ℝ) ≤
      (-(369418863686504577121 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3066217534982953 / 10000000000000000 : ℝ) =
            (3066217534982953 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3066217534982953 / 2500000000000000 : ℝ) ≤
            (63798124000995422879 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3066164809472781 / 10000000000000000 : ℝ)) (q :=
      (3066217534982953 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_340_2 :
    Uω (aρ 2) (bρ 2) (200369118629 / 640000000000 : ℝ) ≤
      (-(5950098832509869832131 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6084305011555203 / 20000000000000000 : ℝ) ≤
      (-(5950098832509869832131 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6084305011555203 / 20000000000000000 : ℝ) =
            (6084305011555203 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6084305011555203 / 5000000000000000 : ℝ) ≤
            (981372970490130167869 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1520901881786039 / 5000000000000000 : ℝ)) (q :=
      (6084305011555203 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_340_3 :
    Uω (aρ 3) (bρ 3) (200369118629 / 640000000000 : ℝ) ≤
      (-(1507522950055079918221 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5987739206918011 / 20000000000000000 : ℝ) ≤
      (-(1507522950055079918221 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5987739206918011 / 20000000000000000 : ℝ) =
            (5987739206918011 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5987739206918011 / 5000000000000000 : ℝ) ≤
            (225345000694920081779 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1496317032642443 / 5000000000000000 : ℝ)) (q :=
      (5987739206918011 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_340_4 :
    Uω (aρ 4) (bρ 4) (200369118629 / 640000000000 : ℝ) ≤
      (-(616666543212505308213 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2913199629113311 / 10000000000000000 : ℝ) ≤
      (-(616666543212505308213 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2913199629113311 / 10000000000000000 : ℝ) =
            (2913199629113311 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2913199629113311 / 2500000000000000 : ℝ) ≤
            (76480637087494691787 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2909588297658497 / 10000000000000000 : ℝ)) (q :=
      (2913199629113311 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_340_5 :
    Uω (aρ 5) (bρ 5) (200369118629 / 640000000000 : ℝ) ≤
      (-(3192188962342959562939 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (697268406870141 / 2500000000000000 : ℝ) ≤
      (-(3192188962342959562939 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (697268406870141 / 2500000000000000 : ℝ) =
            (697268406870141 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (697268406870141 / 625000000000000 : ℝ) ≤
            (273546939157040437061 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2779526213728003 / 10000000000000000 : ℝ)) (q :=
      (697268406870141 / 2500000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_340_6 :
    Uω (aρ 6) (bρ 6) (200369118629 / 640000000000 : ℝ) ≤
      (-(13440584727778944987359 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1303925642344057 / 5000000000000000 : ℝ) ≤
      (-(13440584727778944987359 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1303925642344057 / 5000000000000000 : ℝ) =
            (1303925642344057 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1303925642344057 / 1250000000000000 : ℝ) ≤
            (422358878221055012641 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2584321903283103 / 10000000000000000 : ℝ)) (q :=
      (1303925642344057 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_340_7 :
    Uω (aρ 7) (bρ 7) (200369118629 / 640000000000 : ℝ) ≤
      (-(7235321489269726734981 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4705198564048747 / 20000000000000000 : ℝ) ≤
      (-(7235321489269726734981 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4705198564048747 / 20000000000000000 : ℝ) =
            (4705198564048747 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4705198564048747 / 2500000000000000 : ℝ) ≤
            (3161886215230273265019 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1148739639357811 / 5000000000000000 : ℝ)) (q :=
      (4705198564048747 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_340_8 :
    Uω (aρ 8) (bρ 8) (200369118629 / 640000000000 : ℝ) ≤
      (-(8052373851717295670201 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1997927357326081 / 10000000000000000 : ℝ) ≤
      (-(8052373851717295670201 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1997927357326081 / 10000000000000000 : ℝ) =
            (1997927357326081 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1997927357326081 / 1250000000000000 : ℝ) ≤
            (2344833852782704329799 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1871677080659037 / 10000000000000000 : ℝ)) (q :=
      (1997927357326081 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_340_9 :
    Uω (aρ 9) (bρ 9) (200369118629 / 640000000000 : ℝ) ≤
      (-(19129132475187687634013 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (738248097158353 / 5000000000000000 : ℝ) ≤
      (-(19129132475187687634013 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (738248097158353 / 5000000000000000 : ℝ) =
            (738248097158353 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (738248097158353 / 625000000000000 : ℝ) ≤
            (1665282933812312365987 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1169780383000287 / 10000000000000000 : ℝ)) (q :=
      (738248097158353 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_340_10 :
    Uω (aρ 10) (bρ 10) (200369118629 / 640000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_340_11 :
    Uω (aρ 11) (bρ 11) (200369118629 / 640000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_340_12 :
    Uω (aρ 12) (bρ 12) (200369118629 / 640000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_340_13 :
    Uω (aρ 13) (bρ 13) (200369118629 / 640000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_340_14 :
    Uω (aρ 14) (bρ 14) (200369118629 / 640000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_340_15 :
    Uω (aρ 15) (bρ 15) (200369118629 / 640000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_340_16 :
    Uω (aρ 16) (bρ 16) (200369118629 / 640000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_340 :
    Uρ (200369118629 / 640000000000 : ℝ) ≤
      (-(3956263075367200025727 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (200369118629 / 640000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(369418863686504577121 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (200369118629 / 640000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5950098832509869832131 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (200369118629 / 640000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1507522950055079918221 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (200369118629 / 640000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(616666543212505308213 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (200369118629 / 640000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3192188962342959562939 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (200369118629 / 640000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(13440584727778944987359 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (200369118629 / 640000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7235321489269726734981 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (200369118629 / 640000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8052373851717295670201 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (200369118629 / 640000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(19129132475187687634013 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (200369118629 / 640000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (200369118629 / 640000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (200369118629 / 640000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (200369118629 / 640000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (200369118629 / 640000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (200369118629 / 640000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (200369118629 / 640000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_340_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_341_1 :
    Uω (aρ 1) (bρ 1) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(11742480570451772639849 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12362051244450521 / 40000000000000000 : ℝ) ≤
      (-(11742480570451772639849 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12362051244450521 / 40000000000000000 : ℝ) =
            (12362051244450521 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12362051244450521 / 10000000000000000 : ℝ) ≤
            (2120463035548227360151 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3090460500090573 / 10000000000000000 : ℝ)) (q :=
      (12362051244450521 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_341_2 :
    Uω (aρ 2) (bρ 2) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(11820645091192290518187 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12265800522988413 / 40000000000000000 : ℝ) ≤
      (-(11820645091192290518187 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12265800522988413 / 40000000000000000 : ℝ) =
            (12265800522988413 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12265800522988413 / 10000000000000000 : ℝ) ≤
            (2042298514807709481813 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3066104151869519 / 10000000000000000 : ℝ)) (q :=
      (12265800522988413 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_341_3 :
    Uω (aρ 3) (bρ 3) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(11979329423253933029181 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12072697658661663 / 40000000000000000 : ℝ) ≤
      (-(11979329423253933029181 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12072697658661663 / 40000000000000000 : ℝ) =
            (12072697658661663 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12072697658661663 / 10000000000000000 : ℝ) ≤
            (1883614182746066970819 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (188559301628509 / 625000000000000 : ℝ)) (q :=
      (12072697658661663 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_341_4 :
    Uω (aρ 4) (bρ 4) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(12250179083177582271047 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11750097580467091 / 40000000000000000 : ℝ) ≤
      (-(12250179083177582271047 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11750097580467091 / 40000000000000000 : ℝ) =
            (11750097580467091 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11750097580467091 / 10000000000000000 : ℝ) ≤
            (1612764522822417728953 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1466971484011929 / 5000000000000000 : ℝ)) (q :=
      (11750097580467091 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_341_5 :
    Uω (aρ 5) (bρ 5) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(2536346345276691305741 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (450152194268343 / 1600000000000000 : ℝ) ≤
      (-(2536346345276691305741 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (450152194268343 / 1600000000000000 : ℝ) =
            (450152194268343 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (450152194268343 / 400000000000000 : ℝ) ≤
            (236242375923308694259 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7009966313699 / 25000000000000 : ℝ)) (q :=
      (450152194268343 / 1600000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_341_6 :
    Uω (aρ 6) (bρ 6) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(13347023103751467493021 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10529461057571289 / 40000000000000000 : ℝ) ≤
      (-(13347023103751467493021 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10529461057571289 / 40000000000000000 : ℝ) =
            (10529461057571289 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10529461057571289 / 10000000000000000 : ℝ) ≤
            (515920502248532506979 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2609055001050957 / 10000000000000000 : ℝ)) (q :=
      (10529461057571289 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_341_7 :
    Uω (aρ 7) (bρ 7) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(1795684838138299536907 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9509883087309847 / 40000000000000000 : ℝ) ≤
      (-(1795684838138299536907 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9509883087309847 / 40000000000000000 : ℝ) =
            (9509883087309847 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9509883087309847 / 5000000000000000 : ℝ) ≤
            (803617087986700463093 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (580731849170059 / 2500000000000000 : ℝ)) (q :=
      (9509883087309847 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_341_8 :
    Uω (aρ 8) (bρ 8) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(1996986356463040772307 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8095354415229067 / 40000000000000000 : ℝ) ≤
      (-(1996986356463040772307 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8095354415229067 / 40000000000000000 : ℝ) =
            (8095354415229067 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8095354415229067 / 5000000000000000 : ℝ) ≤
            (602315569661959227693 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (949602355989923 / 5000000000000000 : ℝ)) (q :=
      (8095354415229067 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_341_9 :
    Uω (aρ 9) (bρ 9) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(18924646561087487775289 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6027997085228231 / 40000000000000000 : ℝ) ≤
      (-(18924646561087487775289 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6027997085228231 / 40000000000000000 : ℝ) =
            (6027997085228231 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6027997085228231 / 5000000000000000 : ℝ) ≤
            (1869768847912512224711 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (301622918834857 / 2500000000000000 : ℝ)) (q :=
      (6027997085228231 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_341_10 :
    Uω (aρ 10) (bρ 10) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_341_11 :
    Uω (aρ 11) (bρ 11) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_341_12 :
    Uω (aρ 12) (bρ 12) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_341_13 :
    Uω (aρ 13) (bρ 13) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_341_14 :
    Uω (aρ 14) (bρ 14) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_341_15 :
    Uω (aρ 15) (bρ 15) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_341_16 :
    Uω (aρ 16) (bρ 16) (10096199488703 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_341 :
    Uρ (10096199488703 / 32000000000000 : ℝ) ≤
      (-(15761808112806890583937 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10096199488703 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(11742480570451772639849 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10096199488703 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11820645091192290518187 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10096199488703 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(11979329423253933029181 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10096199488703 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(12250179083177582271047 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10096199488703 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2536346345276691305741 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10096199488703 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(13347023103751467493021 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10096199488703 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1795684838138299536907 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10096199488703 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1996986356463040772307 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10096199488703 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(18924646561087487775289 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10096199488703 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10096199488703 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10096199488703 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10096199488703 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10096199488703 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10096199488703 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10096199488703 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_341_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_342_1 :
    Uω (aρ 1) (bρ 1) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(11664175534405795398607 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6229616161552491 / 20000000000000000 : ℝ) ≤
      (-(11664175534405795398607 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6229616161552491 / 20000000000000000 : ℝ) =
            (6229616161552491 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6229616161552491 / 5000000000000000 : ℝ) ≤
            (2198768071594204601393 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3114756177776241 / 10000000000000000 : ℝ)) (q :=
      (6229616161552491 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_342_2 :
    Uω (aρ 2) (bρ 2) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(5870860263786756796371 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (309074771226449 / 1000000000000000 : ℝ) ≤
      (-(5870860263786756796371 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (309074771226449 / 1000000000000000 : ℝ) =
            (309074771226449 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (309074771226449 / 250000000000000 : ℝ) ≤
            (1060611539213243203629 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (309040445326273 / 1000000000000000 : ℝ)) (q :=
      (309074771226449 / 1000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_342_3 :
    Uω (aρ 3) (bρ 3) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(2974781067166648350813 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1216991626737721 / 4000000000000000 : ℝ) ≤
      (-(2974781067166648350813 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1216991626737721 / 4000000000000000 : ℝ) =
            (1216991626737721 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1216991626737721 / 1000000000000000 : ℝ) ≤
            (490954834333351649187 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (608252653754471 / 2000000000000000 : ℝ)) (q :=
      (1216991626737721 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_342_4 :
    Uω (aρ 4) (bρ 4) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(6083857343180408154369 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (740462167334903 / 2500000000000000 : ℝ) ≤
      (-(6083857343180408154369 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (740462167334903 / 2500000000000000 : ℝ) =
            (740462167334903 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (740462167334903 / 625000000000000 : ℝ) ≤
            (847614459819591845631 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1479148327413987 / 5000000000000000 : ℝ)) (q :=
      (740462167334903 / 2500000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_342_5 :
    Uω (aρ 5) (bρ 5) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(12595463419058547117867 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2837827374905103 / 10000000000000000 : ℝ) ≤
      (-(12595463419058547117867 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2837827374905103 / 10000000000000000 : ℝ) =
            (2837827374905103 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2837827374905103 / 2500000000000000 : ℝ) ≤
            (1267480186941452882133 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (707110996323489 / 2500000000000000 : ℝ)) (q :=
      (2837827374905103 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_342_6 :
    Uω (aρ 6) (bρ 6) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(6627172050807757955697 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (664218791302243 / 2500000000000000 : ℝ) ≤
      (-(6627172050807757955697 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (664218791302243 / 2500000000000000 : ℝ) =
            (664218791302243 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (664218791302243 / 625000000000000 : ℝ) ≤
            (304299752192242044303 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1316889970520847 / 5000000000000000 : ℝ)) (q :=
      (664218791302243 / 2500000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_342_7 :
    Uω (aρ 7) (bρ 7) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(14261459727060855781449 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1201165023752779 / 5000000000000000 : ℝ) ≤
      (-(14261459727060855781449 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1201165023752779 / 5000000000000000 : ℝ) =
            (1201165023752779 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1201165023752779 / 625000000000000 : ℝ) ≤
            (6532955681939144218551 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1174175543197433 / 5000000000000000 : ℝ)) (q :=
      (1201165023752779 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_342_8 :
    Uω (aρ 8) (bρ 8) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(990555338418671925963 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2049706374098079 / 10000000000000000 : ℝ) ≤
      (-(990555338418671925963 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2049706374098079 / 10000000000000000 : ℝ) =
            (2049706374098079 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2049706374098079 / 1250000000000000 : ℝ) ≤
            (309095624643828074037 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (481661347729977 / 2500000000000000 : ℝ)) (q :=
      (2049706374098079 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_342_9 :
    Uω (aρ 9) (bρ 9) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(4681560142880333083387 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (192149703196409 / 1250000000000000 : ℝ) ≤
      (-(4681560142880333083387 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (192149703196409 / 1250000000000000 : ℝ) =
            (192149703196409 / 156250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (192149703196409 / 156250000000000 : ℝ) ≤
            (517043709369666916613 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (621296761113147 / 5000000000000000 : ℝ)) (q :=
      (192149703196409 / 1250000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_342_10 :
    Uω (aρ 10) (bρ 10) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_342_11 :
    Uω (aρ 11) (bρ 11) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_342_12 :
    Uω (aρ 12) (bρ 12) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_342_13 :
    Uω (aρ 13) (bρ 13) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_342_14 :
    Uω (aρ 14) (bρ 14) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_342_15 :
    Uω (aρ 15) (bρ 15) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_342_16 :
    Uω (aρ 16) (bρ 16) (2543485761489 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_342 :
    Uρ (2543485761489 / 8000000000000 : ℝ) ≤
      (-(15699576321583142466967 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2543485761489 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(11664175534405795398607 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2543485761489 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5870860263786756796371 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2543485761489 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2974781067166648350813 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2543485761489 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6083857343180408154369 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2543485761489 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(12595463419058547117867 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2543485761489 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6627172050807757955697 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2543485761489 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(14261459727060855781449 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2543485761489 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(990555338418671925963 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2543485761489 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4681560142880333083387 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2543485761489 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2543485761489 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2543485761489 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2543485761489 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2543485761489 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2543485761489 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2543485761489 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_342_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_343_1 :
    Uω (aρ 1) (bρ 1) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(5793239462649911037 / 5000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12556413376495749 / 40000000000000000 : ℝ) ≤
      (-(5793239462649911037 / 5000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12556413376495749 / 40000000000000000 : ℝ) =
            (12556413376495749 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12556413376495749 / 10000000000000000 : ℝ) ≤
            (1138232340350088963 / 5000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1569525921415031 / 5000000000000000 : ℝ)) (q :=
      (12556413376495749 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_343_2 :
    Uω (aρ 2) (bρ 2) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(2332682826846300534697 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12460181005387103 / 40000000000000000 : ℝ) ≤
      (-(2332682826846300534697 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12460181005387103 / 40000000000000000 : ℝ) =
            (12460181005387103 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12460181005387103 / 10000000000000000 : ℝ) ≤
            (439905894353699465303 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3114704669785739 / 10000000000000000 : ℝ)) (q :=
      (12460181005387103 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_343_3 :
    Uω (aρ 3) (bρ 3) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(2954889447974945029483 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12267134255118471 / 40000000000000000 : ℝ) ≤
      (-(2954889447974945029483 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12267134255118471 / 40000000000000000 : ℝ) =
            (12267134255118471 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12267134255118471 / 10000000000000000 : ℝ) ≤
            (510846453525054970517 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3065577401001423 / 10000000000000000 : ℝ)) (q :=
      (12267134255118471 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_343_4 :
    Uω (aρ 4) (bρ 4) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(6042963187737180019357 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2388937971062537 / 8000000000000000 : ℝ) ≤
      (-(6042963187737180019357 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2388937971062537 / 8000000000000000 : ℝ) =
            (2388937971062537 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2388937971062537 / 2000000000000000 : ℝ) ≤
            (888508615262819980643 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (298264938216353 / 1000000000000000 : ℝ)) (q :=
      (2388937971062537 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_343_5 :
    Uω (aρ 5) (bρ 5) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(12509937826887110023689 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (457952343414123 / 1600000000000000 : ℝ) ≤
      (-(12509937826887110023689 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (457952343414123 / 1600000000000000 : ℝ) =
            (457952343414123 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (457952343414123 / 400000000000000 : ℝ) ≤
            (1353005779112889976311 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (114115946660749 / 400000000000000 : ℝ)) (q :=
      (457952343414123 / 1600000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_343_6 :
    Uω (aρ 6) (bρ 6) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(13162530945191651836923 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10725524403767141 / 40000000000000000 : ℝ) ≤
      (-(13162530945191651836923 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10725524403767141 / 40000000000000000 : ℝ) =
            (10725524403767141 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10725524403767141 / 10000000000000000 : ℝ) ≤
            (700412660808348163077 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1329248475432879 / 5000000000000000 : ℝ)) (q :=
      (10725524403767141 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_343_7 :
    Uω (aρ 7) (bρ 7) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(14158560319631239190253 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9708710006044581 / 40000000000000000 : ℝ) ≤
      (-(14158560319631239190253 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9708710006044581 / 40000000000000000 : ℝ) =
            (9708710006044581 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9708710006044581 / 5000000000000000 : ℝ) ≤
            (6635855089368760809747 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1186875566382239 / 5000000000000000 : ℝ)) (q :=
      (9708710006044581 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_343_8 :
    Uω (aρ 8) (bρ 8) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(15723673450207903387083 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1660425999879923 / 8000000000000000 : ℝ) ≤
      (-(15723673450207903387083 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1660425999879923 / 8000000000000000 : ℝ) =
            (1660425999879923 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1660425999879923 / 1000000000000000 : ℝ) ≤
            (5070741958792096612917 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (390800556156399 / 2000000000000000 : ℝ)) (q :=
      (1660425999879923 / 8000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_343_9 :
    Uω (aρ 9) (bρ 9) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(741338966521064763589 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6268468315680387 / 40000000000000000 : ℝ) ≤
      (-(741338966521064763589 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6268468315680387 / 40000000000000000 : ℝ) =
            (6268468315680387 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6268468315680387 / 5000000000000000 : ℝ) ≤
            (90437649838935236411 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1278137567282381 / 10000000000000000 : ℝ)) (q :=
      (6268468315680387 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_343_10 :
    Uω (aρ 10) (bρ 10) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_343_11 :
    Uω (aρ 11) (bρ 11) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_343_12 :
    Uω (aρ 12) (bρ 12) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_343_13 :
    Uω (aρ 13) (bρ 13) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_343_14 :
    Uω (aρ 14) (bρ 14) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_343_15 :
    Uω (aρ 15) (bρ 15) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_343_16 :
    Uω (aρ 16) (bρ 16) (10251686603209 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_343 :
    Uρ (10251686603209 / 32000000000000 : ℝ) ≤
      (-(7819153509420200613333 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10251686603209 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5793239462649911037 / 5000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10251686603209 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2332682826846300534697 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10251686603209 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2954889447974945029483 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10251686603209 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6042963187737180019357 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10251686603209 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(12509937826887110023689 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10251686603209 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(13162530945191651836923 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10251686603209 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(14158560319631239190253 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10251686603209 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(15723673450207903387083 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10251686603209 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(741338966521064763589 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10251686603209 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10251686603209 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10251686603209 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10251686603209 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10251686603209 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10251686603209 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10251686603209 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_343_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_344_1 :
    Uω (aρ 1) (bρ 1) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(2301876272154925326387 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3163398601301231 / 10000000000000000 : ℝ) ≤
      (-(2301876272154925326387 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3163398601301231 / 10000000000000000 : ℝ) =
            (3163398601301231 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3163398601301231 / 2500000000000000 : ℝ) ≤
            (470712449045074673613 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3163347495543087 / 10000000000000000 : ℝ)) (q :=
      (3163398601301231 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_344_2 :
    Uω (aρ 2) (bρ 2) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(11585716300751941489211 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6278685497958957 / 20000000000000000 : ℝ) ≤
      (-(11585716300751941489211 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6278685497958957 / 20000000000000000 : ℝ) =
            (6278685497958957 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6278685497958957 / 5000000000000000 : ℝ) ≤
            (2277227305248058510789 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1569502401704791 / 5000000000000000 : ℝ)) (q :=
      (6278685497958957 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_344_3 :
    Uω (aρ 3) (bρ 3) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(11740619893739643235129 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6182175818272327 / 20000000000000000 : ℝ) ≤
      (-(11740619893739643235129 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6182175818272327 / 20000000000000000 : ℝ) =
            (6182175818272327 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6182175818272327 / 5000000000000000 : ℝ) ≤
            (2122323712260356764871 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (386236403759119 / 1250000000000000 : ℝ)) (q :=
      (6182175818272327 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_344_4 :
    Uω (aρ 4) (bρ 4) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(240096062582495861523 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3010495790238087 / 10000000000000000 : ℝ) ≤
      (-(240096062582495861523 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3010495790238087 / 10000000000000000 : ℝ) =
            (3010495790238087 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3010495790238087 / 2500000000000000 : ℝ) ≤
            (37162809537504138477 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3007001173341799 / 10000000000000000 : ℝ)) (q :=
      (3010495790238087 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_344_5 :
    Uω (aρ 5) (bρ 5) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(6212571094579826978127 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5773151127799207 / 20000000000000000 : ℝ) ≤
      (-(6212571094579826978127 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5773151127799207 / 20000000000000000 : ℝ) =
            (5773151127799207 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5773151127799207 / 5000000000000000 : ℝ) ≤
            (718900708420173021873 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (359668829999979 / 1250000000000000 : ℝ)) (q :=
      (5773151127799207 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_344_6 :
    Uω (aρ 6) (bρ 6) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(13071567339577674235373 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (676470795291817 / 2500000000000000 : ℝ) ≤
      (-(13071567339577674235373 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (676470795291817 / 2500000000000000 : ℝ) =
            (676470795291817 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (676470795291817 / 625000000000000 : ℝ) ≤
            (791376266422325764627 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2683206249675161 / 10000000000000000 : ℝ)) (q :=
      (676470795291817 / 2500000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_344_7 :
    Uω (aρ 7) (bρ 7) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(14056755646450440234437 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2452013509319447 / 10000000000000000 : ℝ) ≤
      (-(14056755646450440234437 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2452013509319447 / 10000000000000000 : ℝ) =
            (2452013509319447 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2452013509319447 / 1250000000000000 : ℝ) ≤
            (6737659762549559765563 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2399128286739519 / 10000000000000000 : ℝ)) (q :=
      (2452013509319447 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_344_8 :
    Uω (aρ 8) (bρ 8) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(195002498657717841121 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4202637412278987 / 20000000000000000 : ℝ) ≤
      (-(195002498657717841121 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4202637412278987 / 20000000000000000 : ℝ) =
            (4202637412278987 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4202637412278987 / 2500000000000000 : ℝ) ≤
            (64927693954782158879 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (495320082929903 / 2500000000000000 : ℝ)) (q :=
      (4202637412278987 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_344_9 :
    Uω (aρ 9) (bρ 9) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(3669191631964464684769 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (798390139546971 / 5000000000000000 : ℝ) ≤
      (-(3669191631964464684769 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (798390139546971 / 5000000000000000 : ℝ) =
            (798390139546971 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (798390139546971 / 625000000000000 : ℝ) ≤
            (489691449835535315231 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1313169105988509 / 10000000000000000 : ℝ)) (q :=
      (798390139546971 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_344_10 :
    Uω (aρ 10) (bρ 10) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_344_11 :
    Uω (aρ 11) (bρ 11) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_344_12 :
    Uω (aρ 12) (bρ 12) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_344_13 :
    Uω (aρ 13) (bρ 13) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_344_14 :
    Uω (aρ 14) (bρ 14) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_344_15 :
    Uω (aρ 15) (bρ 15) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_344_16 :
    Uω (aρ 16) (bρ 16) (5164715080231 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_344 :
    Uρ (5164715080231 / 16000000000000 : ℝ) ≤
      (-(3115591048149674882067 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5164715080231 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2301876272154925326387 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5164715080231 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11585716300751941489211 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5164715080231 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(11740619893739643235129 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5164715080231 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(240096062582495861523 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5164715080231 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6212571094579826978127 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5164715080231 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(13071567339577674235373 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5164715080231 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(14056755646450440234437 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5164715080231 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(195002498657717841121 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5164715080231 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3669191631964464684769 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5164715080231 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5164715080231 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5164715080231 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5164715080231 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5164715080231 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5164715080231 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5164715080231 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_344_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_345_1 :
    Uω (aρ 1) (bρ 1) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(11356946906342816493083 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3211989097704713 / 10000000000000000 : ℝ) ≤
      (-(11356946906342816493083 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3211989097704713 / 10000000000000000 : ℝ) =
            (3211989097704713 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3211989097704713 / 2500000000000000 : ℝ) ≤
            (2505996699657183506917 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1605969382533463 / 5000000000000000 : ℝ)) (q :=
      (3211989097704713 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_345_2 :
    Uω (aρ 2) (bρ 2) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(11432108977075101674191 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6375875247375869 / 20000000000000000 : ℝ) ≤
      (-(11432108977075101674191 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6375875247375869 / 20000000000000000 : ℝ) =
            (6375875247375869 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6375875247375869 / 5000000000000000 : ℝ) ≤
            (2430834628924898325809 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3187604829543369 / 10000000000000000 : ℝ)) (q :=
      (6375875247375869 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_345_3 :
    Uω (aρ 3) (bρ 3) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(5792295309103324570207 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3139696159204113 / 10000000000000000 : ℝ) ≤
      (-(5792295309103324570207 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3139696159204113 / 10000000000000000 : ℝ) =
            (3139696159204113 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3139696159204113 / 2500000000000000 : ℝ) ≤
            (1139176493896675429793 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1569259003462863 / 5000000000000000 : ℝ)) (q :=
      (3139696159204113 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_345_4 :
    Uω (aρ 4) (bρ 4) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(11844509075501430543993 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6118282167169283 / 20000000000000000 : ℝ) ≤
      (-(11844509075501430543993 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6118282167169283 / 20000000000000000 : ℝ) =
            (6118282167169283 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6118282167169283 / 5000000000000000 : ℝ) ≤
            (2018434530498569456007 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3055702036751783 / 10000000000000000 : ℝ)) (q :=
      (6118282167169283 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_345_5 :
    Uω (aρ 5) (bρ 5) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(2451538272676043922751 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5870636946319773 / 20000000000000000 : ℝ) ≤
      (-(2451538272676043922751 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5870636946319773 / 20000000000000000 : ℝ) =
            (5870636946319773 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5870636946319773 / 5000000000000000 : ℝ) ≤
            (321050448523956077249 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2926246735237273 / 10000000000000000 : ℝ)) (q :=
      (5870636946319773 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_345_6 :
    Uω (aρ 6) (bρ 6) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(50359866786970237563 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (2754876193420369 / 10000000000000000 : ℝ) ≤
      (-(50359866786970237563 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2754876193420369 / 10000000000000000 : ℝ) =
            (2754876193420369 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2754876193420369 / 2500000000000000 : ℝ) ≤
            (3792256673967262437 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1366301275449119 / 5000000000000000 : ℝ)) (q :=
      (2754876193420369 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_345_7 :
    Uω (aρ 7) (bρ 7) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(3464083838632482367617 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2501652608850121 / 10000000000000000 : ℝ) ≤
      (-(3464083838632482367617 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2501652608850121 / 10000000000000000 : ℝ) =
            (2501652608850121 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2501652608850121 / 2500000000000000 : ℝ) ≤
            (1652062867517632383 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1224908381258871 / 5000000000000000 : ℝ)) (q :=
      (2501652608850121 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_345_8 :
    Uω (aρ 8) (bρ 8) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(7679130478477478291329 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1076388887398653 / 5000000000000000 : ℝ) ≤
      (-(7679130478477478291329 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1076388887398653 / 5000000000000000 : ℝ) =
            (1076388887398653 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1076388887398653 / 625000000000000 : ℝ) ≤
            (2718077226022521708671 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (127225546609507 / 625000000000000 : ℝ)) (q :=
      (1076388887398653 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_345_9 :
    Uω (aρ 9) (bρ 9) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(449633250021974099083 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25865868672333 / 156250000000000 : ℝ) ≤
      (-(449633250021974099083 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (25865868672333 / 156250000000000 : ℝ) = (25865868672333 / 19531250000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25865868672333 / 19531250000000 : ℝ) ≤
            (70227135203025900917 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (345462503644031 / 2500000000000000 : ℝ)) (q :=
      (25865868672333 / 156250000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_345_10 :
    Uω (aρ 10) (bρ 10) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_345_11 :
    Uω (aρ 11) (bρ 11) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_345_12 :
    Uω (aρ 12) (bρ 12) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_345_13 :
    Uω (aρ 13) (bρ 13) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_345_14 :
    Uω (aρ 14) (bρ 14) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_345_15 :
    Uω (aρ 15) (bρ 15) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_345_16 :
    Uω (aρ 16) (bρ 16) (1310614659371 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_345 :
    Uρ (1310614659371 / 4000000000000 : ℝ) ≤
      (-(15459844878657915384769 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1310614659371 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(11356946906342816493083 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1310614659371 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11432108977075101674191 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1310614659371 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5792295309103324570207 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1310614659371 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11844509075501430543993 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1310614659371 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2451538272676043922751 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1310614659371 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(50359866786970237563 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1310614659371 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3464083838632482367617 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1310614659371 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(7679130478477478291329 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1310614659371 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(449633250021974099083 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1310614659371 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1310614659371 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1310614659371 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1310614659371 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1310614659371 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1310614659371 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1310614659371 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_345_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_346_1 :
    Uω (aρ 1) (bρ 1) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(1400850162952081230453 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (326057957106513 / 1000000000000000 : ℝ) ≤
      (-(1400850162952081230453 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (326057957106513 / 1000000000000000 : ℝ) =
            (326057957106513 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (326057957106513 / 250000000000000 : ℝ) ≤
            (332017787797918769547 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (652105997700927 / 2000000000000000 : ℝ)) (q :=
      (326057957106513 / 1000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_346_2 :
    Uω (aρ 2) (bρ 2) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(11280826001053343395199 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (647306468737741 / 2000000000000000 : ℝ) ≤
      (-(11280826001053343395199 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (647306468737741 / 2000000000000000 : ℝ) =
            (647306468737741 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (647306468737741 / 500000000000000 : ℝ) ≤
            (2582117604946656604801 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (647240909252357 / 2000000000000000 : ℝ)) (q :=
      (647306468737741 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_346_3 :
    Uω (aρ 3) (bρ 3) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(228619205476329618989 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25506430753241 / 80000000000000 : ℝ) ≤
      (-(228619205476329618989 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25506430753241 / 80000000000000 : ℝ) = (25506430753241 / 20000000000000 : ℝ) / 2 ^ 2 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25506430753241 / 20000000000000 : ℝ) ≤
            (48639666643670381011 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (25497149228357 / 80000000000000 : ℝ)) (q :=
      (25506430753241 / 80000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_346_4 :
    Uω (aρ 4) (bρ 4) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(11686749560023923541033 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (621556927077899 / 2000000000000000 : ℝ) ≤
      (-(11686749560023923541033 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (621556927077899 / 2000000000000000 : ℝ) =
            (621556927077899 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (621556927077899 / 500000000000000 : ℝ) ≤
            (2176194045976076458967 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (620879883415673 / 2000000000000000 : ℝ)) (q :=
      (621556927077899 / 2000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_346_5 :
    Uω (aρ 5) (bρ 5) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(12093015219054816054701 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5968112726004279 / 20000000000000000 : ℝ) ≤
      (-(12093015219054816054701 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5968112726004279 / 20000000000000000 : ℝ) =
            (5968112726004279 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5968112726004279 / 5000000000000000 : ℝ) ≤
            (1769928386945183945299 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1487566395819327 / 5000000000000000 : ℝ)) (q :=
      (5968112726004279 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_346_6 :
    Uω (aρ 6) (bρ 6) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(6357949180291555523893 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5607710002359903 / 20000000000000000 : ℝ) ≤
      (-(6357949180291555523893 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5607710002359903 / 20000000000000000 : ℝ) =
            (5607710002359903 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5607710002359903 / 5000000000000000 : ℝ) ≤
            (573522622708444476107 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1390985221567139 / 5000000000000000 : ℝ)) (q :=
      (5607710002359903 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_346_7 :
    Uω (aρ 7) (bρ 7) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(6830008200364275306877 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2551250044033 / 10000000000000 : ℝ) ≤
      (-(6830008200364275306877 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show (2551250044033 / 10000000000000 : ℝ) = (2551250044033 / 2500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2551250044033 / 2500000000000 : ℝ) ≤
            (101463602635724693123 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (20003375276803 / 80000000000000 : ℝ)) (q :=
      (2551250044033 / 10000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_346_8 :
    Uω (aρ 8) (bρ 8) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(7561339280388101403409 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4408191068221703 / 20000000000000000 : ℝ) ≤
      (-(7561339280388101403409 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4408191068221703 / 20000000000000000 : ℝ) =
            (4408191068221703 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4408191068221703 / 2500000000000000 : ℝ) ≤
            (2835868424111898596591 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1044827270548039 / 5000000000000000 : ℝ)) (q :=
      (4408191068221703 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_346_9 :
    Uω (aρ 9) (bρ 9) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(2756562137920207449 / 1562500000000000000 : ℝ)) := by
  have hlg :
    Real.log (428309575689891 / 2500000000000000 : ℝ) ≤
      (-(2756562137920207449 / 1562500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (428309575689891 / 2500000000000000 : ℝ) =
            (428309575689891 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (428309575689891 / 312500000000000 : ℝ) ≤
            (492565269736042551 / 1562500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1448905706753503 / 10000000000000000 : ℝ)) (q :=
      (428309575689891 / 2500000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_346_10 :
    Uω (aρ 10) (bρ 10) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_346_11 :
    Uω (aρ 11) (bρ 11) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_346_12 :
    Uω (aρ 12) (bρ 12) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_346_13 :
    Uω (aρ 13) (bρ 13) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_346_14 :
    Uω (aρ 14) (bρ 14) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_346_15 :
    Uω (aρ 15) (bρ 15) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_346_16 :
    Uω (aρ 16) (bρ 16) (5320202194737 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_346 :
    Uρ (5320202194737 / 16000000000000 : ℝ) ≤
      (-(15344959851341678360121 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5320202194737 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1400850162952081230453 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5320202194737 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(11280826001053343395199 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5320202194737 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(228619205476329618989 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5320202194737 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11686749560023923541033 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5320202194737 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(12093015219054816054701 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5320202194737 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6357949180291555523893 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5320202194737 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6830008200364275306877 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5320202194737 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(7561339280388101403409 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5320202194737 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2756562137920207449 / 1562500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5320202194737 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5320202194737 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5320202194737 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5320202194737 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5320202194737 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5320202194737 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5320202194737 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_346_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_347_1 :
    Uω (aρ 1) (bρ 1) (539794575199 / 1600000000000 : ℝ) ≤
      (-(5529438415241096726837 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1323668008959031 / 4000000000000000 : ℝ) ≤
      (-(5529438415241096726837 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1323668008959031 / 4000000000000000 : ℝ) =
            (1323668008959031 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1323668008959031 / 1000000000000000 : ℝ) ≤
            (1402033387758903273163 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (661824233577281 / 2000000000000000 : ℝ)) (q :=
      (1323668008959031 / 4000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_347_2 :
    Uω (aρ 2) (bρ 2) (539794575199 / 1600000000000 : ℝ) ≤
      (-(2782949515805895480333 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3285126915848639 / 10000000000000000 : ℝ) ≤
      (-(2782949515805895480333 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3285126915848639 / 10000000000000000 : ℝ) =
            (3285126915848639 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3285126915848639 / 2500000000000000 : ℝ) ≤
            (682786385694104519667 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (102650123978079 / 312500000000000 : ℝ)) (q :=
      (3285126915848639 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_347_3 :
    Uω (aρ 3) (bρ 3) (539794575199 / 1600000000000 : ℝ) ≤
      (-(2819914039390198190657 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1294764395786463 / 4000000000000000 : ℝ) ≤
      (-(2819914039390198190657 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1294764395786463 / 4000000000000000 : ℝ) =
            (1294764395786463 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1294764395786463 / 1000000000000000 : ℝ) ≤
            (645821862109801809343 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (647153644176713 / 2000000000000000 : ℝ)) (q :=
      (1294764395786463 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_347_4 :
    Uω (aρ 4) (bρ 4) (539794575199 / 1600000000000 : ℝ) ≤
      (-(1153144550858087381687 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6312853052686849 / 20000000000000000 : ℝ) ≤
      (-(1153144550858087381687 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6312853052686849 / 20000000000000000 : ℝ) =
            (6312853052686849 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6312853052686849 / 5000000000000000 : ℝ) ≤
            (233149809741912618313 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3153093475703099 / 10000000000000000 : ℝ)) (q :=
      (6312853052686849 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_347_5 :
    Uω (aρ 5) (bρ 5) (539794575199 / 1600000000000 : ℝ) ≤
      (-(1193102277038038876959 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (303278947685773 / 1000000000000000 : ℝ) ≤
      (-(1193102277038038876959 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (303278947685773 / 1000000000000000 : ℝ) =
            (303278947685773 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (303278947685773 / 250000000000000 : ℝ) ≤
            (193192083561961123041 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (302400929606671 / 1000000000000000 : ℝ)) (q :=
      (303278947685773 / 1000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_347_6 :
    Uω (aρ 6) (bρ 6) (539794575199 / 1600000000000 : ℝ) ≤
      (-(6271384959581393181183 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (228225627797769 / 800000000000000 : ℝ) ≤
      (-(6271384959581393181183 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (228225627797769 / 800000000000000 : ℝ) =
            (228225627797769 / 200000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (228225627797769 / 200000000000000 : ℝ) ≤
            (660086843418606818817 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (113252456497419 / 400000000000000 : ℝ)) (q :=
      (228225627797769 / 800000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_347_7 :
    Uω (aρ 7) (bρ 7) (539794575199 / 1600000000000 : ℝ) ≤
      (-(2693525626556395372243 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1300404147227207 / 5000000000000000 : ℝ) ≤
      (-(2693525626556395372243 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1300404147227207 / 5000000000000000 : ℝ) =
            (1300404147227207 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1300404147227207 / 1250000000000000 : ℝ) ≤
            (79063094643604627757 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1275474343580039 / 5000000000000000 : ℝ)) (q :=
      (1300404147227207 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_347_8 :
    Uω (aρ 8) (bρ 8) (539794575199 / 1600000000000 : ℝ) ≤
      (-(14893097731127274734401 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4510565346553517 / 20000000000000000 : ℝ) ≤
      (-(14893097731127274734401 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4510565346553517 / 20000000000000000 : ℝ) =
            (4510565346553517 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4510565346553517 / 2500000000000000 : ℝ) ≤
            (5901317677872725265599 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2143439096144767 / 10000000000000000 : ℝ)) (q :=
      (4510565346553517 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_347_9 :
    Uω (aρ 9) (bρ 9) (539794575199 / 1600000000000 : ℝ) ≤
      (-(17314042422240819869213 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3540712685782171 / 20000000000000000 : ℝ) ≤
      (-(17314042422240819869213 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3540712685782171 / 20000000000000000 : ℝ) =
            (3540712685782171 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3540712685782171 / 2500000000000000 : ℝ) ≤
            (3480372986759180130787 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1514552063733421 / 10000000000000000 : ℝ)) (q :=
      (3540712685782171 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_347_10 :
    Uω (aρ 10) (bρ 10) (539794575199 / 1600000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_347_11 :
    Uω (aρ 11) (bρ 11) (539794575199 / 1600000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_347_12 :
    Uω (aρ 12) (bρ 12) (539794575199 / 1600000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_347_13 :
    Uω (aρ 13) (bρ 13) (539794575199 / 1600000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_347_14 :
    Uω (aρ 14) (bρ 14) (539794575199 / 1600000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_347_15 :
    Uω (aρ 15) (bρ 15) (539794575199 / 1600000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_347_16 :
    Uω (aρ 16) (bρ 16) (539794575199 / 1600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_347 :
    Uρ (539794575199 / 1600000000000 : ℝ) ≤
      (-(7616529524551265616913 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (539794575199 / 1600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5529438415241096726837 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (539794575199 / 1600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2782949515805895480333 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (539794575199 / 1600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2819914039390198190657 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (539794575199 / 1600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1153144550858087381687 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (539794575199 / 1600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1193102277038038876959 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (539794575199 / 1600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6271384959581393181183 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (539794575199 / 1600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2693525626556395372243 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (539794575199 / 1600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14893097731127274734401 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (539794575199 / 1600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(17314042422240819869213 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (539794575199 / 1600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (539794575199 / 1600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (539794575199 / 1600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (539794575199 / 1600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (539794575199 / 1600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (539794575199 / 1600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (539794575199 / 1600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_347_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_348_1 :
    Uω (aρ 1) (bρ 1) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(2728277181692807866107 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6715520905316779 / 20000000000000000 : ℝ) ≤
      (-(2728277181692807866107 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6715520905316779 / 20000000000000000 : ℝ) =
            (6715520905316779 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6715520905316779 / 5000000000000000 : ℝ) ≤
            (737458719807192133893 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (419714038140613 / 1250000000000000 : ℝ)) (q :=
      (6715520905316779 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_348_2 :
    Uω (aρ 2) (bρ 2) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(10984958909324133836937 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6667442693268163 / 20000000000000000 : ℝ) ≤
      (-(10984958909324133836937 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6667442693268163 / 20000000000000000 : ℝ) =
            (6667442693268163 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6667442693268163 / 5000000000000000 : ℝ) ≤
            (2877984696675866163063 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (208337694099143 / 625000000000000 : ℝ)) (q :=
      (6667442693268163 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_348_3 :
    Uω (aρ 3) (bρ 3) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(1113060882446734250669 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6571035238209801 / 20000000000000000 : ℝ) ≤
      (-(1113060882446734250669 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6571035238209801 / 20000000000000000 : ℝ) =
            (6571035238209801 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6571035238209801 / 5000000000000000 : ℝ) ≤
            (273233478153265749331 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1642195878438963 / 5000000000000000 : ℝ)) (q :=
      (6571035238209801 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_348_4 :
    Uω (aρ 4) (bρ 4) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(5689260749156044347883 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (200316677013947 / 625000000000000 : ℝ) ≤
      (-(5689260749156044347883 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (200316677013947 / 625000000000000 : ℝ) =
            (200316677013947 / 156250000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (200316677013947 / 156250000000000 : ℝ) ≤
            (1242211053843955652117 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3201784364179429 / 10000000000000000 : ℝ)) (q :=
      (200316677013947 / 625000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_348_5 :
    Uω (aρ 5) (bρ 5) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(470865098371135128527 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (385189755328009 / 1250000000000000 : ℝ) ≤
      (-(470865098371135128527 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (385189755328009 / 1250000000000000 : ℝ) =
            (385189755328009 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (385189755328009 / 312500000000000 : ℝ) ≤
            (83652645868864871473 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3072876704316269 / 10000000000000000 : ℝ)) (q :=
      (385189755328009 / 1250000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_348_6 :
    Uω (aρ 6) (bρ 6) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(12372631891703963693447 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (290177292402339 / 1000000000000000 : ℝ) ≤
      (-(12372631891703963693447 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (290177292402339 / 1000000000000000 : ℝ) =
            (290177292402339 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (290177292402339 / 250000000000000 : ℝ) ≤
            (1490311714296036306553 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (576125368450981 / 2000000000000000 : ℝ)) (q :=
      (290177292402339 / 1000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_348_7 :
    Uω (aρ 7) (bρ 7) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(6639505332453721451779 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1325164821681037 / 5000000000000000 : ℝ) ≤
      (-(6639505332453721451779 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1325164821681037 / 5000000000000000 : ℝ) =
            (1325164821681037 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1325164821681037 / 1250000000000000 : ℝ) ≤
            (291966470546278548221 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2601401661692273 / 10000000000000000 : ℝ)) (q :=
      (1325164821681037 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_348_8 :
    Uω (aρ 8) (bρ 8) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(14669194304964489016403 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1153174392758377 / 5000000000000000 : ℝ) ≤
      (-(14669194304964489016403 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1153174392758377 / 5000000000000000 : ℝ) =
            (1153174392758377 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1153174392758377 / 625000000000000 : ℝ) ≤
            (6125221104035510983597 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2196981597341633 / 10000000000000000 : ℝ)) (q :=
      (1153174392758377 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_348_9 :
    Uω (aρ 9) (bρ 9) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(2124984692148639207169 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (730743044471017 / 4000000000000000 : ℝ) ≤
      (-(2124984692148639207169 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (730743044471017 / 4000000000000000 : ℝ) =
            (730743044471017 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (730743044471017 / 500000000000000 : ℝ) ≤
            (474317233976360792831 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (157896487702321 / 1000000000000000 : ℝ)) (q :=
      (730743044471017 / 4000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_348_10 :
    Uω (aρ 10) (bρ 10) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_348_11 :
    Uω (aρ 11) (bρ 11) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_348_12 :
    Uω (aρ 12) (bρ 12) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_348_13 :
    Uω (aρ 13) (bρ 13) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_348_14 :
    Uω (aρ 14) (bρ 14) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_348_15 :
    Uω (aρ 15) (bρ 15) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_348_16 :
    Uω (aρ 16) (bρ 16) (5475689309243 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_348 :
    Uρ (5475689309243 / 16000000000000 : ℝ) ≤
      (-(15123935587556814908631 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5475689309243 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2728277181692807866107 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5475689309243 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10984958909324133836937 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5475689309243 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1113060882446734250669 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5475689309243 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5689260749156044347883 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5475689309243 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(470865098371135128527 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5475689309243 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(12372631891703963693447 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5475689309243 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6639505332453721451779 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5475689309243 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(14669194304964489016403 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5475689309243 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2124984692148639207169 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5475689309243 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5475689309243 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5475689309243 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5475689309243 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5475689309243 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5475689309243 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5475689309243 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_348_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_349_1 :
    Uω (aρ 1) (bρ 1) (86772388539 / 250000000000 : ℝ) ≤
      (-(2692358756001912750639 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6812701725498661 / 20000000000000000 : ℝ) ≤
      (-(2692358756001912750639 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6812701725498661 / 20000000000000000 : ℝ) =
            (6812701725498661 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6812701725498661 / 5000000000000000 : ℝ) ≤
            (773377145498087249361 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3406303402023661 / 10000000000000000 : ℝ)) (q :=
      (6812701725498661 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_349_2 :
    Uω (aρ 2) (bρ 2) (86772388539 / 250000000000 : ℝ) ≤
      (-(2710061290822971316719 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6764631284279317 / 20000000000000000 : ℝ) ≤
      (-(2710061290822971316719 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6764631284279317 / 20000000000000000 : ℝ) =
            (6764631284279317 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6764631284279317 / 5000000000000000 : ℝ) ≤
            (755674610677028683281 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3382001973314317 / 10000000000000000 : ℝ)) (q :=
      (6764631284279317 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_349_3 :
    Uω (aρ 3) (bρ 3) (86772388539 / 250000000000 : ℝ) ≤
      (-(2745937973915816665167 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1333649502255977 / 4000000000000000 : ℝ) ≤
      (-(2745937973915816665167 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1333649502255977 / 4000000000000000 : ℝ) =
            (1333649502255977 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1333649502255977 / 1000000000000000 : ℝ) ≤
            (719797927584183334833 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (666602861332977 / 2000000000000000 : ℝ)) (q :=
      (1333649502255977 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_349_4 :
    Uω (aρ 4) (bρ 4) (86772388539 / 250000000000 : ℝ) ≤
      (-(1403488191972210064163 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3253705624260179 / 10000000000000000 : ℝ) ≤
      (-(1403488191972210064163 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3253705624260179 / 10000000000000000 : ℝ) =
            (3253705624260179 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3253705624260179 / 2500000000000000 : ℝ) ≤
            (329379758777789935837 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1625236112485179 / 5000000000000000 : ℝ)) (q :=
      (3253705624260179 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_349_5 :
    Uω (aρ 5) (bρ 5) (86772388539 / 250000000000 : ℝ) ≤
      (-(181480419862451201021 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (626048454777501 / 2000000000000000 : ℝ) ≤
      (-(181480419862451201021 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (626048454777501 / 2000000000000000 : ℝ) =
            (626048454777501 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (626048454777501 / 500000000000000 : ℝ) ≤
            (35128073981298798979 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (312173544356001 / 1000000000000000 : ℝ)) (q :=
      (626048454777501 / 2000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_349_6 :
    Uω (aρ 6) (bρ 6) (86772388539 / 250000000000 : ℝ) ≤
      (-(488215251642030165167 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (590142675128467 / 2000000000000000 : ℝ) ≤
      (-(488215251642030165167 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (590142675128467 / 2000000000000000 : ℝ) =
            (590142675128467 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (590142675128467 / 500000000000000 : ℝ) ≤
            (66302492597969834833 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (292991802220967 / 1000000000000000 : ℝ)) (q :=
      (590142675128467 / 2000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_349_7 :
    Uω (aρ 7) (bρ 7) (86772388539 / 250000000000 : ℝ) ≤
      (-(3273503492390745150533 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1079926478810777 / 4000000000000000 : ℝ) ≤
      (-(3273503492390745150533 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1079926478810777 / 4000000000000000 : ℝ) =
            (1079926478810777 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1079926478810777 / 1000000000000000 : ℝ) ≤
            (192232409109254849467 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (530357009147777 / 2000000000000000 : ℝ)) (q :=
      (1079926478810777 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_349_8 :
    Uω (aρ 8) (bρ 8) (86772388539 / 250000000000 : ℝ) ≤
      (-(3612667828037066073951 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (294662813728397 / 1250000000000000 : ℝ) ≤
      (-(3612667828037066073951 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (294662813728397 / 1250000000000000 : ℝ) =
            (294662813728397 / 156250000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (294662813728397 / 156250000000000 : ℝ) ≤
            (1585936024212933926049 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (281287415334919 / 1250000000000000 : ℝ)) (q :=
      (294662813728397 / 1250000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_349_9 :
    Uω (aρ 9) (bρ 9) (86772388539 / 250000000000 : ℝ) ≤
      (-(16698172633618705145123 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3765629365421181 / 20000000000000000 : ℝ) ≤
      (-(16698172633618705145123 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3765629365421181 / 20000000000000000 : ℝ) =
            (3765629365421181 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3765629365421181 / 2500000000000000 : ℝ) ≤
            (4096242775381294854877 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1642289296806181 / 10000000000000000 : ℝ)) (q :=
      (3765629365421181 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_349_10 :
    Uω (aρ 10) (bρ 10) (86772388539 / 250000000000 : ℝ) ≤
      (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_10]) (by norm_num [bρ_10])]; exact Lmid_10

lemma U_349_11 :
    Uω (aρ 11) (bρ 11) (86772388539 / 250000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_349_12 :
    Uω (aρ 12) (bρ 12) (86772388539 / 250000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_349_13 :
    Uω (aρ 13) (bρ 13) (86772388539 / 250000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_349_14 :
    Uω (aρ 14) (bρ 14) (86772388539 / 250000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_349_15 :
    Uω (aρ 15) (bρ 15) (86772388539 / 250000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_349_16 :
    Uω (aρ 16) (bρ 16) (86772388539 / 250000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_349 :
    Uρ (86772388539 / 250000000000 : ℝ) ≤
      (-(3754352408588390882517 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (86772388539 / 250000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2692358756001912750639 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (86772388539 / 250000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2710061290822971316719 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (86772388539 / 250000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2745937973915816665167 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (86772388539 / 250000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1403488191972210064163 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (86772388539 / 250000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(181480419862451201021 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (86772388539 / 250000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(488215251642030165167 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (86772388539 / 250000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3273503492390745150533 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (86772388539 / 250000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3612667828037066073951 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (86772388539 / 250000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(16698172633618705145123 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (86772388539 / 250000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(12224255358108186379559 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (86772388539 / 250000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (86772388539 / 250000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (86772388539 / 250000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (86772388539 / 250000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (86772388539 / 250000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (86772388539 / 250000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_349_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_350_1 :
    Uω (aρ 1) (bρ 1) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(10692924948722708581073 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13730051335768191 / 40000000000000000 : ℝ) ≤
      (-(10692924948722708581073 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13730051335768191 / 40000000000000000 : ℝ) =
            (13730051335768191 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13730051335768191 / 10000000000000000 : ℝ) ≤
            (3170018657277291418927 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1716232867476579 / 5000000000000000 : ℝ)) (q :=
      (13730051335768191 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_350_2 :
    Uω (aρ 2) (bρ 2) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(5381593741458052326591 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13633918637464121 / 40000000000000000 : ℝ) ≤
      (-(5381593741458052326591 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13633918637464121 / 40000000000000000 : ℝ) =
            (13633918637464121 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13633918637464121 / 10000000000000000 : ℝ) ≤
            (1549878061541947673409 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3408168398311123 / 10000000000000000 : ℝ)) (q :=
      (13633918637464121 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_350_3 :
    Uω (aρ 3) (bρ 3) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(10905566206672627143071 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13441176022308067 / 40000000000000000 : ℝ) ≤
      (-(10905566206672627143071 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13441176022308067 / 40000000000000000 : ℝ) =
            (13441176022308067 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13441176022308067 / 10000000000000000 : ℝ) ≤
            (2957377399327372856929 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (419899149635387 / 1250000000000000 : ℝ)) (q :=
      (13441176022308067 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_350_4 :
    Uω (aρ 4) (bρ 4) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(11147742773399472978853 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2623914439939867 / 8000000000000000 : ℝ) ≤
      (-(11147742773399472978853 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2623914439939867 / 8000000000000000 : ℝ) =
            (2623914439939867 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2623914439939867 / 2000000000000000 : ℝ) ≤
            (2715200832600527021147 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (327668546684373 / 1000000000000000 : ℝ)) (q :=
      (2623914439939867 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_350_5 :
    Uω (aρ 5) (bρ 5) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(5765646633728764278609 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12625898322004909 / 40000000000000000 : ℝ) ≤
      (-(5765646633728764278609 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12625898322004909 / 40000000000000000 : ℝ) =
            (12625898322004909 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12625898322004909 / 10000000000000000 : ℝ) ≤
            (1165825169271235721391 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3148038447331517 / 10000000000000000 : ℝ)) (q :=
      (12625898322004909 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_350_6 :
    Uω (aρ 6) (bρ 6) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(12116491871022092607709 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11908236058652281 / 40000000000000000 : ℝ) ≤
      (-(12116491871022092607709 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11908236058652281 / 40000000000000000 : ℝ) =
            (11908236058652281 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11908236058652281 / 10000000000000000 : ℝ) ≤
            (1746451734977907392291 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2956447690795203 / 10000000000000000 : ℝ)) (q :=
      (11908236058652281 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_350_7 :
    Uω (aρ 7) (bρ 7) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(12995858129784667405647 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10905787816146419 / 40000000000000000 : ℝ) ≤
      (-(12995858129784667405647 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10905787816146419 / 40000000000000000 : ℝ) =
            (10905787816146419 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10905787816146419 / 10000000000000000 : ℝ) ≤
            (867085476215332594353 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (41857577348473 / 156250000000000 : ℝ)) (q :=
      (10905787816146419 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_350_8 :
    Uω (aρ 8) (bρ 8) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(7167573149467358629037 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (76310181146337 / 320000000000000 : ℝ) ≤
      (-(7167573149467358629037 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (76310181146337 / 320000000000000 : ℝ) = (76310181146337 / 40000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (76310181146337 / 40000000000000 : ℝ) ≤
            (3229634555032641370963 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (18231352121721 / 80000000000000 : ℝ)) (q :=
      (76310181146337 / 320000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_350_9 :
    Uω (aρ 9) (bρ 9) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(8270243481336133218047 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7650957145470101 / 40000000000000000 : ℝ) ≤
      (-(8270243481336133218047 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7650957145470101 / 40000000000000000 : ℝ) =
            (7650957145470101 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7650957145470101 / 5000000000000000 : ℝ) ≤
            (2126964223163866781953 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1675976894664113 / 10000000000000000 : ℝ)) (q :=
      (7650957145470101 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_350_10 :
    Uω (aρ 10) (bρ 10) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(2271398553081343851221 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4126711735908559 / 40000000000000000 : ℝ) ≤
      (-(2271398553081343851221 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4126711735908559 / 40000000000000000 : ℝ) =
            (4126711735908559 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4126711735908559 / 2500000000000000 : ℝ) ≤
            (501190168118656148779 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (151206611689171 / 5000000000000000 : ℝ)) (q :=
      (4126711735908559 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_350_11 :
    Uω (aρ 11) (bρ 11) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_350_12 :
    Uω (aρ 12) (bρ 12) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_350_13 :
    Uω (aρ 13) (bρ 13) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_350_14 :
    Uω (aρ 14) (bρ 14) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_350_15 :
    Uω (aρ 15) (bρ 15) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_350_16 :
    Uω (aρ 16) (bρ 16) (11190582883251 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_350 :
    Uρ (11190582883251 / 32000000000000 : ℝ) ≤
      (-(14812819820006037121807 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11190582883251 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(10692924948722708581073 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11190582883251 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5381593741458052326591 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11190582883251 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10905566206672627143071 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11190582883251 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(11147742773399472978853 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11190582883251 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5765646633728764278609 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11190582883251 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(12116491871022092607709 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11190582883251 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12995858129784667405647 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11190582883251 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(7167573149467358629037 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11190582883251 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(8270243481336133218047 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11190582883251 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2271398553081343851221 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11190582883251 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11190582883251 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11190582883251 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11190582883251 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11190582883251 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11190582883251 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_350_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_351_1 :
    Uω (aρ 1) (bρ 1) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(2123399165295955899713 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6917349599324441 / 20000000000000000 : ℝ) ≤
      (-(2123399165295955899713 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6917349599324441 / 20000000000000000 : ℝ) =
            (6917349599324441 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6917349599324441 / 5000000000000000 : ℝ) ≤
            (649189555904044100287 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1729314028468783 / 5000000000000000 : ℝ)) (q :=
      (6917349599324441 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_351_2 :
    Uω (aρ 2) (bρ 2) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(2671679790056744699741 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1373857455962341 / 4000000000000000 : ℝ) ≤
      (-(2671679790056744699741 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1373857455962341 / 4000000000000000 : ℝ) =
            (1373857455962341 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1373857455962341 / 1000000000000000 : ℝ) ≤
            (794056111443255300259 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (343433474993483 / 1000000000000000 : ℝ)) (q :=
      (1373857455962341 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_351_3 :
    Uω (aρ 3) (bρ 3) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(10827987472984737147193 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3386464121925491 / 10000000000000000 : ℝ) ≤
      (-(10827987472984737147193 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3386464121925491 / 10000000000000000 : ℝ) =
            (3386464121925491 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3386464121925491 / 2500000000000000 : ℝ) ≤
            (3034956133015262852807 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3385371820324107 / 10000000000000000 : ℝ)) (q :=
      (3386464121925491 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_351_4 :
    Uω (aρ 4) (bρ 4) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(5534109374562723863797 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (826520016553917 / 2500000000000000 : ℝ) ≤
      (-(5534109374562723863797 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (826520016553917 / 2500000000000000 : ℝ) =
            (826520016553917 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (826520016553917 / 625000000000000 : ℝ) ≤
            (1397362428437276136203 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3302897889969461 / 10000000000000000 : ℝ)) (q :=
      (826520016553917 / 2500000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_351_5 :
    Uω (aρ 5) (bρ 5) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(2862133506329783265521 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3182705718651991 / 10000000000000000 : ℝ) ≤
      (-(2862133506329783265521 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3182705718651991 / 10000000000000000 : ℝ) =
            (3182705718651991 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3182705718651991 / 2500000000000000 : ℝ) ≤
            (603602395170216734479 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3174339114177107 / 10000000000000000 : ℝ)) (q :=
      (3182705718651991 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_351_6 :
    Uω (aρ 6) (bρ 6) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(6014198225391302158967 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (300340140298413 / 1000000000000000 : ℝ) ≤
      (-(6014198225391302158967 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (300340140298413 / 1000000000000000 : ℝ) =
            (300340140298413 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (300340140298413 / 250000000000000 : ℝ) ≤
            (917273577608697841033 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (596594171596277 / 2000000000000000 : ℝ)) (q :=
      (300340140298413 / 1000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_351_7 :
    Uω (aρ 7) (bρ 7) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(50385507542380392039 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (5506136953700713 / 20000000000000000 : ℝ) ≤
      (-(50385507542380392039 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5506136953700713 / 20000000000000000 : ℝ) =
            (5506136953700713 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5506136953700713 / 5000000000000000 : ℝ) ≤
            (3766615918557107961 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1352983193236919 / 5000000000000000 : ℝ)) (q :=
      (5506136953700713 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_351_8 :
    Uω (aρ 8) (bρ 8) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(2844212325531341812721 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4824109267652769 / 20000000000000000 : ℝ) ≤
      (-(2844212325531341812721 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4824109267652769 / 20000000000000000 : ℝ) =
            (4824109267652769 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4824109267652769 / 2500000000000000 : ℝ) ≤
            (1314670756268658187279 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1153740175882947 / 5000000000000000 : ℝ)) (q :=
      (4824109267652769 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_351_9 :
    Uω (aρ 9) (bρ 9) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(4096481844382657276603 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3885064301949891 / 20000000000000000 : ℝ) ≤
      (-(4096481844382657276603 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3885064301949891 / 20000000000000000 : ℝ) =
            (3885064301949891 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3885064301949891 / 2500000000000000 : ℝ) ≤
            (1102122007867342723397 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (213675126802877 / 1250000000000000 : ℝ)) (q :=
      (3885064301949891 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_351_10 :
    Uω (aρ 10) (bρ 10) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(219985771669146987571 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (221637849617413 / 2000000000000000 : ℝ) ≤
      (-(219985771669146987571 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (221637849617413 / 2000000000000000 : ℝ) =
            (221637849617413 / 125000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (221637849617413 / 125000000000000 : ℝ) ≤
            (57273100450853012429 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (85854848428451 / 2000000000000000 : ℝ)) (q :=
      (221637849617413 / 2000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_351_11 :
    Uω (aρ 11) (bρ 11) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_351_12 :
    Uω (aρ 12) (bρ 12) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_351_13 :
    Uω (aρ 13) (bρ 13) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_351_14 :
    Uω (aρ 14) (bρ 14) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_351_15 :
    Uω (aρ 15) (bρ 15) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_351_16 :
    Uω (aρ 16) (bρ 16) (1127430003351 / 3200000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_351 :
    Uρ (1127430003351 / 3200000000000 : ℝ) ≤
      (-(14696020735188019821327 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1127430003351 / 3200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2123399165295955899713 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1127430003351 / 3200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2671679790056744699741 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1127430003351 / 3200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10827987472984737147193 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1127430003351 / 3200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5534109374562723863797 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1127430003351 / 3200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2862133506329783265521 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1127430003351 / 3200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6014198225391302158967 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1127430003351 / 3200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(50385507542380392039 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1127430003351 / 3200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2844212325531341812721 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1127430003351 / 3200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4096481844382657276603 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1127430003351 / 3200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(219985771669146987571 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1127430003351 / 3200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1127430003351 / 3200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1127430003351 / 3200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1127430003351 / 3200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1127430003351 / 3200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1127430003351 / 3200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_351_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
