/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U29) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_352_1 :
    Uω (aρ 1) (bρ 1) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(10541638900952844384301 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13939347040132423 / 40000000000000000 : ℝ) ≤
      (-(10541638900952844384301 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13939347040132423 / 40000000000000000 : ℝ) =
            (13939347040132423 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13939347040132423 / 10000000000000000 : ℝ) ≤
            (3321304705047155615699 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3484790368223399 / 10000000000000000 : ℝ)) (q :=
      (13939347040132423 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_352_2 :
    Uω (aρ 2) (bρ 2) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(1061083124688201051313 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13843230338365333 / 40000000000000000 : ℝ) ≤
      (-(1061083124688201051313 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13843230338365333 / 40000000000000000 : ℝ) =
            (13843230338365333 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13843230338365333 / 10000000000000000 : ℝ) ≤
            (325211235911798948687 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1730250514924927 / 5000000000000000 : ℝ)) (q :=
      (13843230338365333 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_352_3 :
    Uω (aρ 3) (bρ 3) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(2150201267515562619751 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2730107286208521 / 8000000000000000 : ℝ) ≤
      (-(2150201267515562619751 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2730107286208521 / 8000000000000000 : ℝ) =
            (2730107286208521 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2730107286208521 / 2000000000000000 : ℝ) ≤
            (622387453684437380249 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (341155018253849 / 1000000000000000 : ℝ)) (q :=
      (2730107286208521 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_352_4 :
    Uω (aρ 4) (bρ 4) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(5494661672584152532607 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13329066731210191 / 40000000000000000 : ℝ) ≤
      (-(5494661672584152532607 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13329066731210191 / 40000000000000000 : ℝ) =
            (13329066731210191 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13329066731210191 / 10000000000000000 : ℝ) ≤
            (1436810130415847467393 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3329109513687283 / 10000000000000000 : ℝ)) (q :=
      (13329066731210191 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_352_5 :
    Uω (aρ 5) (bρ 5) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(5683228812996067015517 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12835742868578809 / 40000000000000000 : ℝ) ≤
      (-(5683228812996067015517 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12835742868578809 / 40000000000000000 : ℝ) =
            (12835742868578809 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12835742868578809 / 10000000000000000 : ℝ) ≤
            (1248242990003932984483 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (100019921928331 / 312500000000000 : ℝ)) (q :=
      (12835742868578809 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_352_6 :
    Uω (aρ 6) (bρ 6) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(5970540392073785020387 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12118962506210219 / 40000000000000000 : ℝ) ≤
      (-(5970540392073785020387 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12118962506210219 / 40000000000000000 : ℝ) =
            (12118962506210219 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12118962506210219 / 10000000000000000 : ℝ) ≤
            (960931410926214979613 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3009487695662297 / 10000000000000000 : ℝ)) (q :=
      (12118962506210219 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_352_7 :
    Uω (aρ 7) (bρ 7) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(6401244525886062483541 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11118724159886299 / 40000000000000000 : ℝ) ≤
      (-(6401244525886062483541 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11118724159886299 / 40000000000000000 : ℝ) =
            (11118724159886299 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11118724159886299 / 10000000000000000 : ℝ) ≤
            (530227277113937516459 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2733029903260337 / 10000000000000000 : ℝ)) (q :=
      (11118724159886299 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_352_8 :
    Uω (aρ 8) (bρ 8) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(2821675808831815775213 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9757551996349087 / 40000000000000000 : ℝ) ≤
      (-(2821675808831815775213 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9757551996349087 / 40000000000000000 : ℝ) =
            (9757551996349087 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9757551996349087 / 5000000000000000 : ℝ) ≤
            (1337207272968184224787 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2335985472831731 / 10000000000000000 : ℝ)) (q :=
      (9757551996349087 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_352_9 :
    Uω (aρ 9) (bρ 9) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(4058587466679611612501 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7888803428680491 / 40000000000000000 : ℝ) ≤
      (-(4058587466679611612501 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7888803428680491 / 40000000000000000 : ℝ) =
            (7888803428680491 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7888803428680491 / 5000000000000000 : ℝ) ≤
            (1140016385570388387499 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1742576817357433 / 10000000000000000 : ℝ)) (q :=
      (7888803428680491 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_352_10 :
    Uω (aρ 10) (bρ 10) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(10725842193563147263599 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4681932791743299 / 40000000000000000 : ℝ) ≤
      (-(10725842193563147263599 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (4681932791743299 / 40000000000000000 : ℝ) =
            (4681932791743299 / 2500000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4681932791743299 / 2500000000000000 : ℝ) ≤
            (3137101412436852736401 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (527700532383837 / 10000000000000000 : ℝ)) (q :=
      (4681932791743299 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_352_11 :
    Uω (aρ 11) (bρ 11) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_352_12 :
    Uω (aρ 12) (bρ 12) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_352_13 :
    Uω (aρ 13) (bρ 13) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_352_14 :
    Uω (aρ 14) (bρ 14) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_352_15 :
    Uω (aρ 15) (bρ 15) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_352_16 :
    Uω (aρ 16) (bρ 16) (11358017183769 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_352 :
    Uρ (11358017183769 / 32000000000000 : ℝ) ≤
      (-(14594288429791755881307 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11358017183769 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(10541638900952844384301 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11358017183769 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1061083124688201051313 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11358017183769 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2150201267515562619751 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11358017183769 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5494661672584152532607 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11358017183769 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5683228812996067015517 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11358017183769 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5970540392073785020387 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11358017183769 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6401244525886062483541 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11358017183769 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2821675808831815775213 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11358017183769 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4058587466679611612501 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11358017183769 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10725842193563147263599 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11358017183769 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11358017183769 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11358017183769 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11358017183769 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11358017183769 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11358017183769 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_352_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_353_1 :
    Uω (aρ 1) (bρ 1) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(10504172329495590335047 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27983341906000601 / 80000000000000000 : ℝ) ≤
      (-(10504172329495590335047 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27983341906000601 / 80000000000000000 : ℝ) =
            (27983341906000601 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27983341906000601 / 20000000000000000 : ℝ) ≤
            (3358771276504409664953 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3497871519929369 / 10000000000000000 : ℝ)) (q :=
      (27983341906000601 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_353_2 :
    Uω (aρ 2) (bρ 2) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(10573102202839460368983 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27791116349935233 / 80000000000000000 : ℝ) ≤
      (-(10573102202839460368983 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27791116349935233 / 80000000000000000 : ℝ) =
            (27791116349935233 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27791116349935233 / 20000000000000000 : ℝ) ≤
            (3289841403160539631017 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3473584143423027 / 10000000000000000 : ℝ)) (q :=
      (27791116349935233 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_353_3 :
    Uω (aρ 3) (bρ 3) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(5356368502045391193103 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27405752421368369 / 80000000000000000 : ℝ) ≤
      (-(5356368502045391193103 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27405752421368369 / 80000000000000000 : ℝ) =
            (27405752421368369 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27405752421368369 / 20000000000000000 : ℝ) ≤
            (1575103300954608806897 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3424639267631311 / 10000000000000000 : ℝ)) (q :=
      (27405752421368369 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_353_4 :
    Uω (aρ 4) (bρ 4) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(684381767471699544513 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5352575750633297 / 16000000000000000 : ℝ) ≤
      (-(684381767471699544513 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5352575750633297 / 16000000000000000 : ℝ) =
            (5352575750633297 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5352575750633297 / 4000000000000000 : ℝ) ≤
            (182052207903300455487 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (41777687895573 / 125000000000000 : ℝ)) (q :=
      (5352575750633297 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_353_5 :
    Uω (aρ 5) (bρ 5) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(11325671971142371422989 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25776402382098673 / 80000000000000000 : ℝ) ≤
      (-(11325671971142371422989 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25776402382098673 / 80000000000000000 : ℝ) =
            (25776402382098673 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25776402382098673 / 20000000000000000 : ℝ) ≤
            (2537271634857628577011 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3213785858213887 / 10000000000000000 : ℝ)) (q :=
      (25776402382098673 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_353_6 :
    Uω (aρ 6) (bρ 6) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(11897711012095434041723 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24343272620661961 / 80000000000000000 : ℝ) ≤
      (-(11897711012095434041723 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24343272620661961 / 80000000000000000 : ℝ) =
            (24343272620661961 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24343272620661961 / 20000000000000000 : ℝ) ≤
            (1965232593904565958277 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3022743792994709 / 10000000000000000 : ℝ)) (q :=
      (24343272620661961 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_353_7 :
    Uω (aρ 7) (bρ 7) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(6377372591149652653381 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22343872355375393 / 80000000000000000 : ℝ) ≤
      (-(6377372591149652653381 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22343872355375393 / 80000000000000000 : ℝ) =
            (22343872355375393 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22343872355375393 / 20000000000000000 : ℝ) ≤
            (554099211850347346619 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2746555107433067 / 10000000000000000 : ℝ)) (q :=
      (22343872355375393 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_353_8 :
    Uω (aρ 8) (bρ 8) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(878284501219037432057 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19624355687976101 / 80000000000000000 : ℝ) ≤
      (-(878284501219037432057 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19624355687976101 / 80000000000000000 : ℝ) =
            (19624355687976101 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19624355687976101 / 10000000000000000 : ℝ) ≤
            (421366461843462567943 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (587554397980811 / 2500000000000000 : ℝ)) (q :=
      (19624355687976101 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_353_9 :
    Uω (aρ 9) (bρ 9) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(8079818672537926407997 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15895926785369481 / 80000000000000000 : ℝ) ≤
      (-(8079818672537926407997 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (15895926785369481 / 80000000000000000 : ℝ) =
            (15895926785369481 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15895926785369481 / 10000000000000000 : ℝ) ≤
            (2317389031962073592003 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1759075994631589 / 10000000000000000 : ℝ)) (q :=
      (15895926785369481 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_353_10 :
    Uω (aρ 10) (bρ 10) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(10606782922981723231029 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1917902491631817 / 16000000000000000 : ℝ) ≤
      (-(10606782922981723231029 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (1917902491631817 / 16000000000000000 : ℝ) =
            (1917902491631817 / 1000000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1917902491631817 / 1000000000000000 : ℝ) ≤
            (3256160683018276768971 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (57103144632399 / 1000000000000000 : ℝ)) (q :=
      (1917902491631817 / 16000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_353_11 :
    Uω (aρ 11) (bρ 11) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_353_12 :
    Uω (aρ 12) (bρ 12) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_353_13 :
    Uω (aρ 13) (bρ 13) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_353_14 :
    Uω (aρ 14) (bρ 14) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_353_15 :
    Uω (aρ 15) (bρ 15) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_353_16 :
    Uω (aρ 16) (bρ 16) (22799751517797 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_353 :
    Uρ (22799751517797 / 64000000000000 : ℝ) ≤
      (-(14546684338120957832659 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (22799751517797 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(10504172329495590335047 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (22799751517797 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10573102202839460368983 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (22799751517797 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5356368502045391193103 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (22799751517797 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(684381767471699544513 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (22799751517797 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(11325671971142371422989 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (22799751517797 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11897711012095434041723 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (22799751517797 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6377372591149652653381 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (22799751517797 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(878284501219037432057 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (22799751517797 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(8079818672537926407997 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (22799751517797 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10606782922981723231029 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (22799751517797 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (22799751517797 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (22799751517797 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (22799751517797 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (22799751517797 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (22799751517797 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_353_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_354_1 :
    Uω (aρ 1) (bρ 1) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(5233422806154407011667 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7021997430348573 / 20000000000000000 : ℝ) ≤
      (-(5233422806154407011667 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7021997430348573 / 20000000000000000 : ℝ) =
            (7021997430348573 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7021997430348573 / 5000000000000000 : ℝ) ≤
            (1698048996845592988333 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3510952669049823 / 10000000000000000 : ℝ)) (q :=
      (7021997430348573 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_354_2 :
    Uω (aρ 2) (bρ 2) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(2107102999367314674609 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1743485747114849 / 5000000000000000 : ℝ) ≤
      (-(2107102999367314674609 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1743485747114849 / 5000000000000000 : ℝ) =
            (1743485747114849 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1743485747114849 / 1250000000000000 : ℝ) ≤
            (665485721832685325391 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1743333619835323 / 5000000000000000 : ℝ)) (q :=
      (1743485747114849 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_354_3 :
    Uω (aρ 3) (bρ 3) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(2668653414571848144461 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1719401983032041 / 5000000000000000 : ℝ) ≤
      (-(2668653414571848144461 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1719401983032041 / 5000000000000000 : ℝ) =
            (1719401983032041 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1719401983032041 / 1250000000000000 : ℝ) ≤
            (797082486928151855539 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1718864144844707 / 5000000000000000 : ℝ)) (q :=
      (1719401983032041 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_354_4 :
    Uω (aρ 4) (bρ 4) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(218220933654013876573 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (671690581810577 / 2000000000000000 : ℝ) ≤
      (-(218220933654013876573 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (671690581810577 / 2000000000000000 : ℝ) =
            (671690581810577 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (671690581810577 / 500000000000000 : ℝ) ≤
            (59037938465986123427 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (167766017836601 / 500000000000000 : ℝ)) (q :=
      (671690581810577 / 2000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_354_5 :
    Uω (aρ 5) (bρ 5) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(5642526418193389259393 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3235164603842813 / 10000000000000000 : ℝ) ≤
      (-(5642526418193389259393 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3235164603842813 / 10000000000000000 : ℝ) =
            (3235164603842813 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3235164603842813 / 2500000000000000 : ℝ) ≤
            (1288945384806610740607 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (806733416411719 / 2500000000000000 : ℝ)) (q :=
      (3235164603842813 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_354_6 :
    Uω (aρ 6) (bρ 6) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(2963632752427058012139 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1528038384146267 / 5000000000000000 : ℝ) ≤
      (-(2963632752427058012139 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1528038384146267 / 5000000000000000 : ℝ) =
            (1528038384146267 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1528038384146267 / 1250000000000000 : ℝ) ≤
            (502103149072941987861 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1517999184843159 / 5000000000000000 : ℝ)) (q :=
      (1528038384146267 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_354_7 :
    Uω (aρ 7) (bρ 7) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(12707235810376217255869 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5612569813918199 / 20000000000000000 : ℝ) ≤
      (-(12707235810376217255869 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5612569813918199 / 20000000000000000 : ℝ) =
            (5612569813918199 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5612569813918199 / 5000000000000000 : ℝ) ≤
            (1155707795623782744131 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2760076027779449 / 10000000000000000 : ℝ)) (q :=
      (5612569813918199 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_354_8 :
    Uω (aρ 8) (bρ 8) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(13997061889017450904763 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (123334713659413 / 500000000000000 : ℝ) ≤
      (-(13997061889017450904763 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (123334713659413 / 500000000000000 : ℝ) = (123334713659413 / 62500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (123334713659413 / 62500000000000 : ℝ) ≤
            (6797353519982549095237 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (236443641157777 / 1000000000000000 : ℝ)) (q :=
      (123334713659413 / 500000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_354_9 :
    Uω (aρ 9) (bρ 9) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(4021405282280517378607 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3127738069893 / 15625000000000 : ℝ) ≤
      (-(4021405282280517378607 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show (3127738069893 / 15625000000000 : ℝ) = (3127738069893 / 1953125000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3127738069893 / 1953125000000 : ℝ) ≤
            (1177198569969482621393 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (177551822302429 / 1000000000000000 : ℝ)) (q :=
      (3127738069893 / 15625000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_354_10 :
    Uω (aρ 10) (bρ 10) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(2099233755464236526453 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2451005913054431 / 20000000000000000 : ℝ) ≤
      (-(2099233755464236526453 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 4
        (show
          (2451005913054431 / 20000000000000000 : ℝ) =
            (2451005913054431 / 1250000000000000 : ℝ) / 2 ^ 4
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2451005913054431 / 1250000000000000 : ℝ) ≤
            (673354965735763473547 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (611578440110681 / 10000000000000000 : ℝ)) (q :=
      (2451005913054431 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_354_11 :
    Uω (aρ 11) (bρ 11) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_354_12 :
    Uω (aρ 12) (bρ 12) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_354_13 :
    Uω (aρ 13) (bρ 13) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_354_14 :
    Uω (aρ 14) (bρ 14) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_354_15 :
    Uω (aρ 15) (bρ 15) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_354_16 :
    Uω (aρ 16) (bρ 16) (2860433583507 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_354 :
    Uρ (2860433583507 / 8000000000000 : ℝ) ≤
      (-(7250341187646458758631 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2860433583507 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5233422806154407011667 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2860433583507 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2107102999367314674609 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2860433583507 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2668653414571848144461 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2860433583507 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(218220933654013876573 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2860433583507 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5642526418193389259393 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2860433583507 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2963632752427058012139 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2860433583507 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12707235810376217255869 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2860433583507 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13997061889017450904763 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2860433583507 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4021405282280517378607 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2860433583507 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2099233755464236526453 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2860433583507 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2860433583507 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2860433583507 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2860433583507 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2860433583507 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2860433583507 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_354_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_355_1 :
    Uω (aρ 1) (bρ 1) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(10429657709158020939677 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28192637526561087 / 80000000000000000 : ℝ) ≤
      (-(10429657709158020939677 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28192637526561087 / 80000000000000000 : ℝ) =
            (28192637526561087 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28192637526561087 / 20000000000000000 : ℝ) ≤
            (3433285896841979060323 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3524033815613553 / 10000000000000000 : ℝ)) (q :=
      (28192637526561087 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_355_2 :
    Uω (aρ 2) (bρ 2) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(10498068566233714828257 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28000427489214943 / 80000000000000000 : ℝ) ≤
      (-(10498068566233714828257 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28000427489214943 / 80000000000000000 : ℝ) =
            (28000427489214943 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28000427489214943 / 20000000000000000 : ℝ) ≤
            (3364875039766285171743 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3499750318787017 / 10000000000000000 : ℝ)) (q :=
      (28000427489214943 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_355_3 :
    Uω (aρ 3) (bρ 3) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(10636635189896886432221 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1104604431455487 / 3200000000000000 : ℝ) ≤
      (-(10636635189896886432221 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1104604431455487 / 3200000000000000 : ℝ) =
            (1104604431455487 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1104604431455487 / 800000000000000 : ℝ) ≤
            (3226308416103113567779 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (138032689977203 / 400000000000000 : ℝ)) (q :=
      (1104604431455487 / 3200000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_355_4 :
    Uω (aρ 4) (bρ 4) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(10872137355885766455087 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26972367029194927 / 80000000000000000 : ℝ) ≤
      (-(10872137355885766455087 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (26972367029194927 / 80000000000000000 : ℝ) =
            (26972367029194927 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26972367029194927 / 20000000000000000 : ℝ) ≤
            (2990806250114233544913 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3368425491197013 / 10000000000000000 : ℝ)) (q :=
      (26972367029194927 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_355_5 :
    Uω (aρ 5) (bρ 5) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(11244598860684962943507 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25986229109825939 / 80000000000000000 : ℝ) ≤
      (-(11244598860684962943507 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25986229109825939 / 80000000000000000 : ℝ) =
            (25986229109825939 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25986229109825939 / 20000000000000000 : ℝ) ≤
            (2618344745315037056493 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1620040465344883 / 5000000000000000 : ℝ)) (q :=
      (25986229109825939 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_355_6 :
    Uω (aρ 6) (bρ 6) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(11811539102151936781149 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24553949668774967 / 80000000000000000 : ℝ) ≤
      (-(11811539102151936781149 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24553949668774967 / 80000000000000000 : ℝ) =
            (24553949668774967 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24553949668774967 / 20000000000000000 : ℝ) ≤
            (2051404503848063218851 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3049251445567023 / 10000000000000000 : ℝ)) (q :=
      (24553949668774967 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_355_7 :
    Uω (aρ 7) (bρ 7) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(12659958571089790164417 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22556669271262279 / 80000000000000000 : ℝ) ≤
      (-(12659958571089790164417 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22556669271262279 / 80000000000000000 : ℝ) =
            (22556669271262279 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22556669271262279 / 20000000000000000 : ℝ) ≤
            (1202985034910209835583 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2773592726948851 / 10000000000000000 : ℝ)) (q :=
      (22556669271262279 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_355_8 :
    Uω (aρ 8) (bρ 8) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(435684509515087757189 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19842700439289387 / 80000000000000000 : ℝ) ≤
      (-(435684509515087757189 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19842700439289387 / 80000000000000000 : ℝ) =
            (19842700439289387 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19842700439289387 / 10000000000000000 : ℝ) ≤
            (214140972016162242811 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (594660542573907 / 2500000000000000 : ℝ)) (q :=
      (19842700439289387 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_355_9 :
    Uω (aρ 9) (bρ 9) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(16012286050680742624031 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16131889525455431 / 80000000000000000 : ℝ) ≤
      (-(16012286050680742624031 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16131889525455431 / 80000000000000000 : ℝ) =
            (16131889525455431 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16131889525455431 / 10000000000000000 : ℝ) ≤
            (4782129358319257375969 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1791905070197139 / 10000000000000000 : ℝ)) (q :=
      (16131889525455431 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_355_10 :
    Uω (aρ 10) (bρ 10) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(20784935530951146153959 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10009484372873479 / 80000000000000000 : ℝ) ≤
      (-(20784935530951146153959 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10009484372873479 / 80000000000000000 : ℝ) =
            (10009484372873479 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10009484372873479 / 10000000000000000 : ℝ) ≤
            (9479878048853846041 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (649862815546651 / 10000000000000000 : ℝ)) (q :=
      (10009484372873479 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_355_11 :
    Uω (aρ 11) (bρ 11) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_355_12 :
    Uω (aρ 12) (bρ 12) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_355_13 :
    Uω (aρ 13) (bρ 13) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_355_14 :
    Uω (aρ 14) (bρ 14) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_355_15 :
    Uω (aρ 15) (bρ 15) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_355_16 :
    Uω (aρ 16) (bρ 16) (4593437163663 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_355 :
    Uρ (4593437163663 / 12800000000000 : ℝ) ≤
      (-(722800917271618526219 / 500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4593437163663 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(10429657709158020939677 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4593437163663 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10498068566233714828257 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4593437163663 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10636635189896886432221 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4593437163663 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10872137355885766455087 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4593437163663 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(11244598860684962943507 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4593437163663 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11811539102151936781149 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4593437163663 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12659958571089790164417 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4593437163663 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(435684509515087757189 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4593437163663 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(16012286050680742624031 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4593437163663 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(20784935530951146153959 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4593437163663 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4593437163663 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4593437163663 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4593437163663 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4593437163663 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4593437163663 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_355_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_356_1 :
    Uω (aρ 1) (bρ 1) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(1299075948921488108637 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14148642660807227 / 40000000000000000 : ℝ) ≤
      (-(1299075948921488108637 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14148642660807227 / 40000000000000000 : ℝ) =
            (14148642660807227 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14148642660807227 / 10000000000000000 : ℝ) ≤
            (433792001828511891363 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1768557479824463 / 5000000000000000 : ℝ)) (q :=
      (14148642660807227 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_356_2 :
    Uω (aρ 2) (bρ 2) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(1046076186029057426927 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14052541478416471 / 40000000000000000 : ℝ) ≤
      (-(1046076186029057426927 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14052541478416471 / 40000000000000000 : ℝ) =
            (14052541478416471 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14052541478416471 / 10000000000000000 : ℝ) ≤
            (340218174570942573073 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (878208345240887 / 2500000000000000 : ℝ)) (q :=
      (14052541478416471 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_356_3 :
    Uω (aρ 3) (bρ 3) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(662425031329633293843 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (554395791956353 / 1600000000000000 : ℝ) ≤
      (-(662425031329633293843 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (554395791956353 / 1600000000000000 : ℝ) =
            (554395791956353 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (554395791956353 / 400000000000000 : ℝ) ≤
            (204008944045366706157 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (138556245902389 / 400000000000000 : ℝ)) (q :=
      (554395791956353 / 1600000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_356_4 :
    Uω (aρ 4) (bρ 4) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(5416689557187702177793 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13538555016173533 / 40000000000000000 : ℝ) ≤
      (-(5416689557187702177793 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13538555016173533 / 40000000000000000 : ℝ) =
            (13538555016173533 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13538555016173533 / 10000000000000000 : ℝ) ≤
            (1514782245812297822207 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3381530437257079 / 10000000000000000 : ℝ)) (q :=
      (13538555016173533 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_356_5 :
    Uω (aρ 5) (bρ 5) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(2240861739939409583837 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13045569622826253 / 40000000000000000 : ℝ) ≤
      (-(2240861739939409583837 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13045569622826253 / 40000000000000000 : ℝ) =
            (13045569622826253 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13045569622826253 / 10000000000000000 : ℝ) ≤
            (531726981260590416163 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3253227659918439 / 10000000000000000 : ℝ)) (q :=
      (13045569622826253 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_356_6 :
    Uω (aρ 6) (bρ 6) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(5884366818469516185671 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12329639632951857 / 40000000000000000 : ℝ) ≤
      (-(5884366818469516185671 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12329639632951857 / 40000000000000000 : ℝ) =
            (12329639632951857 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12329639632951857 / 10000000000000000 : ℝ) ≤
            (1047104984530483814329 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3062503040121241 / 10000000000000000 : ℝ)) (q :=
      (12329639632951857 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_356_7 :
    Uω (aρ 7) (bρ 7) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(6306455568069282526061 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11331521323901253 / 40000000000000000 : ℝ) ≤
      (-(6306455568069282526061 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11331521323901253 / 40000000000000000 : ℝ) =
            (11331521323901253 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11331521323901253 / 10000000000000000 : ℝ) ≤
            (625016234930717473939 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2787105266355939 / 10000000000000000 : ℝ)) (q :=
      (11331521323901253 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_356_8 :
    Uω (aρ 8) (bρ 8) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(13887075006321262224287 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9975897689903237 / 40000000000000000 : ℝ) ≤
      (-(13887075006321262224287 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9975897689903237 / 40000000000000000 : ℝ) =
            (9975897689903237 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9975897689903237 / 5000000000000000 : ℝ) ≤
            (6907340402678737775713 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2392835100696931 / 10000000000000000 : ℝ)) (q :=
      (9975897689903237 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_356_9 :
    Uω (aρ 9) (bρ 9) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(15939617482324508012211 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8124772315387749 / 40000000000000000 : ℝ) ≤
      (-(15939617482324508012211 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8124772315387749 / 40000000000000000 : ℝ) =
            (8124772315387749 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8124772315387749 / 5000000000000000 : ℝ) ≤
            (4854797926675491987789 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1808238041799187 / 10000000000000000 : ℝ)) (q :=
      (8124772315387749 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_356_10 :
    Uω (aρ 10) (bρ 10) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(102945636677137892163 / 50000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1020740972669511 / 8000000000000000 : ℝ) ≤
      (-(102945636677137892163 / 50000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1020740972669511 / 8000000000000000 : ℝ) =
            (1020740972669511 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1020740972669511 / 1000000000000000 : ℝ) ≤
            (1026440367862107837 / 50000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (68626334927409 / 1000000000000000 : ℝ)) (q :=
      (1020740972669511 / 8000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_356_11 :
    Uω (aρ 11) (bρ 11) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_356_12 :
    Uω (aρ 12) (bρ 12) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_356_13 :
    Uω (aρ 13) (bρ 13) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_356_14 :
    Uω (aρ 14) (bρ 14) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_356_15 :
    Uω (aρ 15) (bρ 15) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_356_16 :
    Uω (aρ 16) (bρ 16) (11525451484287 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_356 :
    Uρ (11525451484287 / 32000000000000 : ℝ) ≤
      (-(3603124797497613790197 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11525451484287 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1299075948921488108637 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11525451484287 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1046076186029057426927 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11525451484287 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(662425031329633293843 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11525451484287 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5416689557187702177793 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11525451484287 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2240861739939409583837 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11525451484287 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5884366818469516185671 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11525451484287 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6306455568069282526061 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11525451484287 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13887075006321262224287 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11525451484287 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(15939617482324508012211 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11525451484287 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(102945636677137892163 / 50000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11525451484287 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11525451484287 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11525451484287 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11525451484287 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11525451484287 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11525451484287 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_356_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_357_1 :
    Uω (aρ 1) (bρ 1) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(5177847120835798780771 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5680386621333237 / 16000000000000000 : ℝ) ≤
      (-(5177847120835798780771 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5680386621333237 / 16000000000000000 : ℝ) =
            (5680386621333237 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5680386621333237 / 4000000000000000 : ℝ) ≤
            (1753624682164201219229 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (355019610118389 / 1000000000000000 : ℝ)) (q :=
      (5680386621333237 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_357_2 :
    Uω (aρ 2) (bρ 2) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(10423593839989125093553 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28209738357445857 / 80000000000000000 : ℝ) ≤
      (-(10423593839989125093553 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28209738357445857 / 80000000000000000 : ℝ) =
            (28209738357445857 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28209738357445857 / 20000000000000000 : ℝ) ≤
            (3439349766010874906447 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (440739553298601 / 1250000000000000 : ℝ)) (q :=
      (28209738357445857 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_357_3 :
    Uω (aρ 3) (bρ 3) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(2640277126802199692219 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5564893633117449 / 16000000000000000 : ℝ) ≤
      (-(2640277126802199692219 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5564893633117449 / 16000000000000000 : ℝ) =
            (5564893633117449 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5564893633117449 / 4000000000000000 : ℝ) ≤
            (825458774697800307781 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (695398996954831 / 2000000000000000 : ℝ)) (q :=
      (5564893633117449 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_357_4 :
    Uω (aρ 4) (bρ 4) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(1349346348405073664153 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27181852290607513 / 80000000000000000 : ℝ) ≤
      (-(1349346348405073664153 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27181852290607513 / 80000000000000000 : ℝ) =
            (27181852290607513 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27181852290607513 / 20000000000000000 : ℝ) ≤
            (383521602344926335847 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1697317598547111 / 5000000000000000 : ℝ)) (q :=
      (27181852290607513 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_357_5 :
    Uω (aρ 5) (bρ 5) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(11164181025510258405207 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26196047264101189 / 80000000000000000 : ℝ) ≤
      (-(11164181025510258405207 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (26196047264101189 / 80000000000000000 : ℝ) =
            (26196047264101189 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26196047264101189 / 20000000000000000 : ℝ) ≤
            (2698762580489741594793 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3266373859802641 / 10000000000000000 : ℝ)) (q :=
      (26196047264101189 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_357_6 :
    Uω (aρ 6) (bρ 6) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(5863056491764085571929 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24764603014312389 / 80000000000000000 : ℝ) ≤
      (-(5863056491764085571929 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24764603014312389 / 80000000000000000 : ℝ) =
            (24764603014312389 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24764603014312389 / 20000000000000000 : ℝ) ≤
            (1068415311235914428071 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3075753172495441 / 10000000000000000 : ℝ)) (q :=
      (24764603014312389 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_357_7 :
    Uω (aρ 7) (bρ 7) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(12566091213062274615969 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22769399626136197 / 80000000000000000 : ℝ) ≤
      (-(12566091213062274615969 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22769399626136197 / 80000000000000000 : ℝ) =
            (22769399626136197 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22769399626136197 / 20000000000000000 : ℝ) ≤
            (1296852392937725384031 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2800613706211393 / 10000000000000000 : ℝ)) (q :=
      (22769399626136197 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_357_8 :
    Uω (aρ 8) (bρ 8) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(13832569823690590154751 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20060839914761097 / 80000000000000000 : ℝ) ≤
      (-(13832569823690590154751 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (20060839914761097 / 80000000000000000 : ℝ) =
            (20060839914761097 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20060839914761097 / 20000000000000000 : ℝ) ≤
            (30373782309409845249 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1203507714853809 / 5000000000000000 : ℝ)) (q :=
      (20060839914761097 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_357_9 :
    Uω (aρ 9) (bρ 9) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(7933800655272450017953 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3273398004260377 / 16000000000000000 : ℝ) ≤
      (-(7933800655272450017953 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3273398004260377 / 16000000000000000 : ℝ) =
            (3273398004260377 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3273398004260377 / 2000000000000000 : ℝ) ≤
            (2463407049227549982047 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (364903716940563 / 2000000000000000 : ℝ)) (q :=
      (3273398004260377 / 16000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_357_10 :
    Uω (aρ 10) (bρ 10) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(10201613235986337760123 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2079788226324381 / 16000000000000000 : ℝ) ≤
      (-(10201613235986337760123 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2079788226324381 / 16000000000000000 : ℝ) =
            (2079788226324381 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2079788226324381 / 2000000000000000 : ℝ) ≤
            (195594468513662239877 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (36053269788891 / 500000000000000 : ℝ)) (q :=
      (2079788226324381 / 16000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_357_11 :
    Uω (aρ 11) (bρ 11) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_357_12 :
    Uω (aρ 12) (bρ 12) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_357_13 :
    Uω (aρ 13) (bρ 13) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_357_14 :
    Uω (aρ 14) (bρ 14) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_357_15 :
    Uω (aρ 15) (bρ 15) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_357_16 :
    Uω (aρ 16) (bρ 16) (23134620118833 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_357 :
    Uρ (23134620118833 / 64000000000000 : ℝ) ≤
      (-(14369978574398285360333 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23134620118833 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5177847120835798780771 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23134620118833 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10423593839989125093553 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23134620118833 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2640277126802199692219 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23134620118833 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1349346348405073664153 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23134620118833 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(11164181025510258405207 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23134620118833 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5863056491764085571929 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23134620118833 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12566091213062274615969 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23134620118833 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13832569823690590154751 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23134620118833 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7933800655272450017953 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23134620118833 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10201613235986337760123 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23134620118833 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23134620118833 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23134620118833 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23134620118833 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23134620118833 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23134620118833 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_357_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_358_1 :
    Uω (aρ 1) (bρ 1) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(5159458327001527128447 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (222707663139269 / 625000000000000 : ℝ) ≤
      (-(5159458327001527128447 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (222707663139269 / 625000000000000 : ℝ) =
            (222707663139269 / 156250000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (222707663139269 / 156250000000000 : ℝ) ≤
            (1772013475998472871553 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3563277240245983 / 10000000000000000 : ℝ)) (q :=
      (222707663139269 / 625000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_358_2 :
    Uω (aρ 2) (bρ 2) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(5193281738929938716601 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7078598422949201 / 20000000000000000 : ℝ) ≤
      (-(5193281738929938716601 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7078598422949201 / 20000000000000000 : ℝ) =
            (7078598422949201 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7078598422949201 / 5000000000000000 : ℝ) ≤
            (1738190064070061283399 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (55296866488259 / 156250000000000 : ℝ)) (q :=
      (7078598422949201 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_358_3 :
    Uω (aρ 3) (bρ 3) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(10523558134738120583187 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6982286623109339 / 20000000000000000 : ℝ) ≤
      (-(10523558134738120583187 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6982286623109339 / 20000000000000000 : ℝ) =
            (6982286623109339 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6982286623109339 / 5000000000000000 : ℝ) ≤
            (3339385471261879416813 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1745041880879357 / 5000000000000000 : ℝ)) (q :=
      (6982286623109339 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_358_4 :
    Uω (aρ 4) (bρ 4) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(10756311217136471123861 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1705412113285619 / 5000000000000000 : ℝ) ≤
      (-(10756311217136471123861 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1705412113285619 / 5000000000000000 : ℝ) =
            (1705412113285619 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1705412113285619 / 1250000000000000 : ℝ) ≤
            (3106632388863528876139 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3407739772856851 / 10000000000000000 : ℝ)) (q :=
      (1705412113285619 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_358_5 :
    Uω (aρ 5) (bρ 5) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(1390526815796387017917 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6575238297658749 / 20000000000000000 : ℝ) ≤
      (-(1390526815796387017917 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6575238297658749 / 20000000000000000 : ℝ) =
            (6575238297658749 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6575238297658749 / 5000000000000000 : ℝ) ≤
            (342341134953612982083 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (819879884177031 / 2500000000000000 : ℝ)) (q :=
      (6575238297658749 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_358_6 :
    Uω (aρ 6) (bρ 6) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(467347021317313664613 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6217480247316111 / 20000000000000000 : ℝ) ≤
      (-(467347021317313664613 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6217480247316111 / 20000000000000000 : ℝ) =
            (6217480247316111 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6217480247316111 / 5000000000000000 : ℝ) ≤
            (87170722922686335387 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1544500930752743 / 5000000000000000 : ℝ)) (q :=
      (6217480247316111 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_358_7 :
    Uω (aρ 7) (bρ 7) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(6259748272245998521739 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (228757404424093 / 800000000000000 : ℝ) ≤
      (-(6259748272245998521739 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (228757404424093 / 800000000000000 : ℝ) =
            (228757404424093 / 200000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (228757404424093 / 200000000000000 : ℝ) ≤
            (671723530754001478261 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (28141181055517 / 100000000000000 : ℝ)) (q :=
      (228757404424093 / 800000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_358_8 :
    Uω (aρ 8) (bρ 8) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(13778384661680333337793 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39394208847257 / 156250000000000 : ℝ) ≤
      (-(13778384661680333337793 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39394208847257 / 156250000000000 : ℝ) = (39394208847257 / 39062500000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39394208847257 / 39062500000000 : ℝ) ≤
            (84558944319666662207 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2421183378738271 / 10000000000000000 : ℝ)) (q :=
      (39394208847257 / 156250000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_358_9 :
    Uω (aρ 9) (bρ 9) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(7898111955309340951673 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (412105781538001 / 2000000000000000 : ℝ) ≤
      (-(7898111955309340951673 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (412105781538001 / 2000000000000000 : ℝ) =
            (412105781538001 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (412105781538001 / 250000000000000 : ℝ) ≤
            (2499095749190659048327 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (368149618005877 / 2000000000000000 : ℝ)) (q :=
      (412105781538001 / 2000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_358_10 :
    Uω (aρ 10) (bρ 10) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(10112960883108076518971 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1323120438779999 / 10000000000000000 : ℝ) ≤
      (-(10112960883108076518971 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1323120438779999 / 10000000000000000 : ℝ) =
            (1323120438779999 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1323120438779999 / 1250000000000000 : ℝ) ≤
            (284246821391923481029 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (754490185704373 / 10000000000000000 : ℝ)) (q :=
      (1323120438779999 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_358_11 :
    Uω (aρ 11) (bρ 11) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_358_12 :
    Uω (aρ 12) (bρ 12) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_358_13 :
    Uω (aρ 13) (bρ 13) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_358_14 :
    Uω (aρ 14) (bρ 14) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_358_15 :
    Uω (aρ 15) (bρ 15) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_358_16 :
    Uω (aρ 16) (bρ 16) (5804584317273 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_358 :
    Uρ (5804584317273 / 16000000000000 : ℝ) ≤
      (-(14328342301148102981567 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5804584317273 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5159458327001527128447 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5804584317273 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5193281738929938716601 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5804584317273 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10523558134738120583187 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5804584317273 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10756311217136471123861 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5804584317273 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1390526815796387017917 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5804584317273 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(467347021317313664613 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5804584317273 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6259748272245998521739 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5804584317273 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13778384661680333337793 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5804584317273 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7898111955309340951673 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5804584317273 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10112960883108076518971 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5804584317273 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5804584317273 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5804584317273 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5804584317273 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5804584317273 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5804584317273 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_358_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_359_1 :
    Uω (aρ 1) (bρ 1) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(5150289229783770027499 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57117809531462451 / 160000000000000000 : ℝ) ≤
      (-(5150289229783770027499 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57117809531462451 / 160000000000000000 : ℝ) =
            (57117809531462451 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57117809531462451 / 40000000000000000 : ℝ) ≤
            (1781182573216229972501 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3569817808858197 / 10000000000000000 : ℝ)) (q :=
      (57117809531462451 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_359_2 :
    Uω (aρ 2) (bρ 2) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(5184049800320691189273 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56733442668706523 / 160000000000000000 : ℝ) ≤
      (-(5184049800320691189273 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56733442668706523 / 160000000000000000 : ℝ) =
            (56733442668706523 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56733442668706523 / 40000000000000000 : ℝ) ≤
            (1747422002679308810727 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1772770481761853 / 5000000000000000 : ℝ)) (q :=
      (56733442668706523 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_359_3 :
    Uω (aρ 3) (bρ 3) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(10504835724603574181621 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55962971132726131 / 160000000000000000 : ℝ) ≤
      (-(10504835724603574181621 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55962971132726131 / 160000000000000000 : ℝ) =
            (55962971132726131 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55962971132726131 / 40000000000000000 : ℝ) ≤
            (3358107881396425818379 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3496628127876157 / 10000000000000000 : ℝ)) (q :=
      (55962971132726131 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_359_4 :
    Uω (aρ 4) (bρ 4) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(2147427371592678436087 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (54677928600177467 / 160000000000000000 : ℝ) ≤
      (-(2147427371592678436087 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (54677928600177467 / 160000000000000000 : ℝ) =
            (54677928600177467 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (54677928600177467 / 40000000000000000 : ℝ) ≤
            (625161349607321563913 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1707145996186287 / 5000000000000000 : ℝ)) (q :=
      (54677928600177467 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_359_5 :
    Uω (aρ 5) (bρ 5) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(11104291311875286283503 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (52706810754558643 / 160000000000000000 : ℝ) ≤
      (-(11104291311875286283503 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (52706810754558643 / 160000000000000000 : ℝ) =
            (52706810754558643 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (52706810754558643 / 40000000000000000 : ℝ) ≤
            (2758652294124713716497 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3286092181005221 / 10000000000000000 : ℝ)) (q :=
      (52706810754558643 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_359_6 :
    Uω (aρ 6) (bρ 6) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(11662525011682297601331 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9969031133943807 / 32000000000000000 : ℝ) ≤
      (-(11662525011682297601331 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9969031133943807 / 32000000000000000 : ℝ) =
            (9969031133943807 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9969031133943807 / 8000000000000000 : ℝ) ≤
            (2200418594317702398669 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (309562567054027 / 1000000000000000 : ℝ)) (q :=
      (9969031133943807 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_359_7 :
    Uω (aρ 7) (bρ 7) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(12496282984634089874379 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45857809724625947 / 160000000000000000 : ℝ) ≤
      (-(12496282984634089874379 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45857809724625947 / 160000000000000000 : ℝ) =
            (45857809724625947 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45857809724625947 / 40000000000000000 : ℝ) ≤
            (1366660621365910125621 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1410434404081817 / 5000000000000000 : ℝ)) (q :=
      (45857809724625947 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_359_8 :
    Uω (aρ 8) (bρ 8) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(13751410833669744054049 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40448628276486739 / 160000000000000000 : ℝ) ≤
      (-(13751410833669744054049 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40448628276486739 / 160000000000000000 : ℝ) =
            (40448628276486739 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40448628276486739 / 40000000000000000 : ℝ) ≤
            (111532772330255945951 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2428262778486233 / 10000000000000000 : ℝ)) (q :=
      (40448628276486739 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_359_9 :
    Uω (aρ 9) (bρ 9) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(197009632752461729613 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33085554011979971 / 160000000000000000 : ℝ) ≤
      (-(197009632752461729613 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33085554011979971 / 160000000000000000 : ℝ) =
            (33085554011979971 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33085554011979971 / 20000000000000000 : ℝ) ≤
            (62920559860038270387 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1848844123782887 / 10000000000000000 : ℝ)) (q :=
      (33085554011979971 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_359_10 :
    Uω (aρ 10) (bρ 10) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(1258759909477100777669 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21352267909247611 / 160000000000000000 : ℝ) ≤
      (-(1258759909477100777669 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (21352267909247611 / 160000000000000000 : ℝ) =
            (21352267909247611 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21352267909247611 / 20000000000000000 : ℝ) ≤
            (40891053585399222331 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (385371197218171 / 5000000000000000 : ℝ)) (q :=
      (21352267909247611 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_359_11 :
    Uω (aρ 11) (bρ 11) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_359_12 :
    Uω (aρ 12) (bρ 12) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_359_13 :
    Uω (aρ 13) (bρ 13) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_359_14 :
    Uω (aρ 14) (bρ 14) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_359_15 :
    Uω (aρ 15) (bρ 15) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_359_16 :
    Uω (aρ 16) (bρ 16) (46520391688443 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_359 :
    Uρ (46520391688443 / 128000000000000 : ℝ) ≤
      (-(2861565311915866550951 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (46520391688443 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(5150289229783770027499 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (46520391688443 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5184049800320691189273 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (46520391688443 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10504835724603574181621 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (46520391688443 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2147427371592678436087 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (46520391688443 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(11104291311875286283503 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (46520391688443 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11662525011682297601331 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (46520391688443 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12496282984634089874379 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (46520391688443 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13751410833669744054049 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (46520391688443 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(197009632752461729613 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (46520391688443 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1258759909477100777669 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (46520391688443 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (46520391688443 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (46520391688443 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (46520391688443 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (46520391688443 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (46520391688443 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_359_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_360_1 :
    Uω (aρ 1) (bρ 1) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(10282273833372514520303 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28611228647203731 / 80000000000000000 : ℝ) ≤
      (-(10282273833372514520303 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28611228647203731 / 80000000000000000 : ℝ) =
            (28611228647203731 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28611228647203731 / 20000000000000000 : ℝ) ≤
            (3580669772627485479697 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3576358376862339 / 10000000000000000 : ℝ)) (q :=
      (28611228647203731 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_360_2 :
    Uω (aρ 2) (bρ 2) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(10349669757811332992301 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28419048960617947 / 80000000000000000 : ℝ) ≤
      (-(10349669757811332992301 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28419048960617947 / 80000000000000000 : ℝ) =
            (28419048960617947 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28419048960617947 / 20000000000000000 : ℝ) ≤
            (3513273848188667007699 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3552082467725893 / 10000000000000000 : ℝ)) (q :=
      (28419048960617947 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_360_3 :
    Uω (aρ 3) (bρ 3) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(1310768540370397377601 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28033824581068403 / 80000000000000000 : ℝ) ≤
      (-(1310768540370397377601 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28033824581068403 / 80000000000000000 : ℝ) =
            (28033824581068403 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28033824581068403 / 20000000000000000 : ℝ) ≤
            (422099410379602622399 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3503172479188507 / 10000000000000000 : ℝ)) (q :=
      (28033824581068403 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_360_4 :
    Uω (aρ 4) (bρ 4) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(1071799926009268155151 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1095653384267843 / 3200000000000000 : ℝ) ≤
      (-(1071799926009268155151 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1095653384267843 / 3200000000000000 : ℝ) =
            (1095653384267843 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1095653384267843 / 800000000000000 : ℝ) ≤
            (314494434590731844849 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (136833766666417 / 400000000000000 : ℝ)) (q :=
      (1095653384267843 / 3200000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_360_5 :
    Uω (aρ 5) (bρ 5) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(11084407906422986722507 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26405857050309291 / 80000000000000000 : ℝ) ≤
      (-(11084407906422986722507 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (26405857050309291 / 80000000000000000 : ℝ) =
            (26405857050309291 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26405857050309291 / 20000000000000000 : ℝ) ≤
            (2778535699577013277493 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3292664696898729 / 10000000000000000 : ℝ)) (q :=
      (26405857050309291 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_360_6 :
    Uω (aρ 6) (bρ 6) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(2328283939467763148137 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24975233264729499 / 80000000000000000 : ℝ) ≤
      (-(2328283939467763148137 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24975233264729499 / 80000000000000000 : ℝ) =
            (24975233264729499 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24975233264729499 / 20000000000000000 : ℝ) ≤
            (444304781732236851863 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3102249125643781 / 10000000000000000 : ℝ)) (q :=
      (24975233264729499 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_360_7 :
    Uω (aρ 7) (bρ 7) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(3118281226855059681807 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22982065328186551 / 80000000000000000 : ℝ) ≤
      (-(3118281226855059681807 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22982065328186551 / 80000000000000000 : ℝ) =
            (22982065328186551 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22982065328186551 / 20000000000000000 : ℝ) ≤
            (347454674644940318193 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (706904630567011 / 2500000000000000 : ℝ)) (q :=
      (22982065328186551 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_360_8 :
    Uω (aρ 8) (bρ 8) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(13724515514587036197389 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20278781289178551 / 80000000000000000 : ℝ) ≤
      (-(13724515514587036197389 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (20278781289178551 / 80000000000000000 : ℝ) =
            (20278781289178551 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20278781289178551 / 20000000000000000 : ℝ) ≤
            (138428091412963802611 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (608834790964011 / 2500000000000000 : ℝ)) (q :=
      (20278781289178551 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_360_9 :
    Uω (aρ 9) (bρ 9) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(15725472123040980563639 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16601273704238307 / 80000000000000000 : ℝ) ≤
      (-(15725472123040980563639 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16601273704238307 / 80000000000000000 : ℝ) =
            (16601273704238307 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16601273704238307 / 10000000000000000 : ℝ) ≤
            (5068943285959019436361 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1856927895980983 / 10000000000000000 : ℝ)) (q :=
      (16601273704238307 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_360_10 :
    Uω (aρ 10) (bρ 10) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(5014042440673356328323 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10766179120663659 / 80000000000000000 : ℝ) ≤
      (-(5014042440673356328323 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (10766179120663659 / 80000000000000000 : ℝ) =
            (10766179120663659 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10766179120663659 / 10000000000000000 : ℝ) ≤
            (184561411576643671677 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (786713283582321 / 10000000000000000 : ℝ)) (q :=
      (10766179120663659 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_360_11 :
    Uω (aρ 11) (bρ 11) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_360_12 :
    Uω (aρ 12) (bρ 12) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_360_13 :
    Uω (aρ 13) (bρ 13) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_360_14 :
    Uω (aρ 14) (bρ 14) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_360_15 :
    Uω (aρ 15) (bρ 15) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_360_16 :
    Uω (aρ 16) (bρ 16) (23302054419351 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_360 :
    Uρ (23302054419351 / 64000000000000 : ℝ) ≤
      (-(14287499111685594879077 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23302054419351 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) *
        (-(10282273833372514520303 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23302054419351 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10349669757811332992301 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23302054419351 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1310768540370397377601 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23302054419351 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1071799926009268155151 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23302054419351 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(11084407906422986722507 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23302054419351 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2328283939467763148137 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23302054419351 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3118281226855059681807 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23302054419351 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13724515514587036197389 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23302054419351 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(15725472123040980563639 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23302054419351 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5014042440673356328323 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23302054419351 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23302054419351 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23302054419351 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23302054419351 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23302054419351 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23302054419351 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_360_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_361_1 :
    Uω (aρ 1) (bρ 1) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(2052800530549085513821 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57327105052514521 / 160000000000000000 : ℝ) ≤
      (-(2052800530549085513821 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57327105052514521 / 160000000000000000 : ℝ) =
            (57327105052514521 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57327105052514521 / 40000000000000000 : ℝ) ≤
            (719788190650914486179 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3582898944261737 / 10000000000000000 : ℝ)) (q :=
      (57327105052514521 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_361_2 :
    Uω (aρ 2) (bρ 2) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(10331273824108637515949 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56942753141361409 / 160000000000000000 : ℝ) ≤
      (-(10331273824108637515949 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56942753141361409 / 160000000000000000 : ℝ) =
            (56942753141361409 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56942753141361409 / 40000000000000000 : ℝ) ≤
            (3531669781891362484051 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1779311983938799 / 5000000000000000 : ℝ)) (q :=
      (56942753141361409 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_361_3 :
    Uω (aρ 3) (bρ 3) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(5233747899529985342477 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56172327073769273 / 160000000000000000 : ℝ) ≤
      (-(5233747899529985342477 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56172327073769273 / 160000000000000000 : ℝ) =
            (56172327073769273 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56172327073769273 / 40000000000000000 : ℝ) ≤
            (1697723903470014657523 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3509716815778581 / 10000000000000000 : ℝ)) (q :=
      (56172327073769273 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_361_4 :
    Uω (aρ 4) (bρ 4) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(10698898282584064623033 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (54887409466858969 / 160000000000000000 : ℝ) ≤
      (-(10698898282584064623033 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (54887409466858969 / 160000000000000000 : ℝ) =
            (54887409466858969 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (54887409466858969 / 40000000000000000 : ℝ) ≤
            (3164045323415935376967 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3427396295979793 / 10000000000000000 : ℝ)) (q :=
      (54887409466858969 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_361_5 :
    Uω (aρ 5) (bρ 5) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(1383070518809231514651 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (52916616425588929 / 160000000000000000 : ℝ) ≤
      (-(1383070518809231514651 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (52916616425588929 / 160000000000000000 : ℝ) =
            (52916616425588929 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (52916616425588929 / 40000000000000000 : ℝ) ≤
            (349797431940768485349 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1649618542578019 / 5000000000000000 : ℝ)) (q :=
      (52916616425588929 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_361_6 :
    Uω (aρ 6) (bρ 6) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(1452544924334053118787 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (50055774575846001 / 160000000000000000 : ℝ) ≤
      (-(1452544924334053118787 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (50055774575846001 / 160000000000000000 : ℝ) =
            (50055774575846001 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (50055774575846001 / 40000000000000000 : ℝ) ≤
            (280323026415946881213 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (777218057269543 / 2500000000000000 : ℝ)) (q :=
      (50055774575846001 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_361_7 :
    Uω (aρ 7) (bρ 7) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(778126377514180342509 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46070443736556433 / 160000000000000000 : ℝ) ≤
      (-(778126377514180342509 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46070443736556433 / 160000000000000000 : ℝ) =
            (46070443736556433 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46070443736556433 / 40000000000000000 : ℝ) ≤
            (88307597860819657491 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (22143494179117 / 78125000000000 : ℝ)) (q :=
      (46070443736556433 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_361_8 :
    Uω (aρ 8) (bρ 8) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(856106138484193971651 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40666472974807153 / 160000000000000000 : ℝ) ≤
      (-(856106138484193971651 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40666472974807153 / 160000000000000000 : ℝ) =
            (40666472974807153 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40666472974807153 / 40000000000000000 : ℝ) ≤
            (10327836890806028349 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (610603140262079 / 2500000000000000 : ℝ)) (q :=
      (40666472974807153 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_361_9 :
    Uω (aρ 9) (bρ 9) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(15690326843274616969439 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33319443988064353 / 160000000000000000 : ℝ) ≤
      (-(15690326843274616969439 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33319443988064353 / 160000000000000000 : ℝ) =
            (33319443988064353 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33319443988064353 / 20000000000000000 : ℝ) ≤
            (5104088565725383030561 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (932499783032733 / 5000000000000000 : ℝ)) (q :=
      (33319443988064353 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_361_10 :
    Uω (aρ 10) (bρ 10) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(19973855197920723312371 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21710332399398641 / 160000000000000000 : ℝ) ≤
      (-(19973855197920723312371 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (21710332399398641 / 160000000000000000 : ℝ) =
            (21710332399398641 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21710332399398641 / 20000000000000000 : ℝ) ≤
            (820560211079276687629 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (200604912744313 / 2500000000000000 : ℝ)) (q :=
      (21710332399398641 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_361_11 :
    Uω (aρ 11) (bρ 11) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_361_12 :
    Uω (aρ 12) (bρ 12) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_361_13 :
    Uω (aρ 13) (bρ 13) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_361_14 :
    Uω (aρ 14) (bρ 14) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_361_15 :
    Uω (aρ 15) (bρ 15) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_361_16 :
    Uω (aρ 16) (bρ 16) (46687825988961 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_361 :
    Uρ (46687825988961 / 128000000000000 : ℝ) ≤
      (-(14267351142315811764633 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (46687825988961 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2052800530549085513821 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (46687825988961 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10331273824108637515949 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (46687825988961 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5233747899529985342477 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (46687825988961 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10698898282584064623033 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (46687825988961 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1383070518809231514651 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (46687825988961 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1452544924334053118787 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (46687825988961 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(778126377514180342509 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (46687825988961 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(856106138484193971651 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (46687825988961 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(15690326843274616969439 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (46687825988961 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(19973855197920723312371 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (46687825988961 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (46687825988961 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (46687825988961 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (46687825988961 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (46687825988961 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (46687825988961 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_361_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_362_1 :
    Uω (aρ 1) (bρ 1) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(2049152959136992528997 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14357938201452519 / 40000000000000000 : ℝ) ≤
      (-(2049152959136992528997 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14357938201452519 / 40000000000000000 : ℝ) =
            (14357938201452519 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14357938201452519 / 10000000000000000 : ℝ) ≤
            (723435762063007471003 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3589439511059697 / 10000000000000000 : ℝ)) (q :=
      (14357938201452519 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_362_2 :
    Uω (aρ 2) (bρ 2) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(5156455837481287013357 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2852370416463071 / 8000000000000000 : ℝ) ≤
      (-(5156455837481287013357 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2852370416463071 / 8000000000000000 : ℝ) =
            (2852370416463071 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2852370416463071 / 2000000000000000 : ℝ) ≤
            (1775015965518712986643 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (713033092800223 / 2000000000000000 : ℝ)) (q :=
      (2852370416463071 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_362_3 :
    Uω (aρ 3) (bρ 3) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(1306109752858577475561 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14069251217070289 / 40000000000000000 : ℝ) ≤
      (-(1306109752858577475561 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14069251217070289 / 40000000000000000 : ℝ) =
            (14069251217070289 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14069251217070289 / 10000000000000000 : ℝ) ≤
            (426758197891422524439 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1758130568864291 / 5000000000000000 : ℝ)) (q :=
      (14069251217070289 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_362_4 :
    Uω (aρ 4) (bρ 4) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(10679833785307686060643 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13748037340659291 / 40000000000000000 : ℝ) ≤
      (-(10679833785307686060643 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13748037340659291 / 40000000000000000 : ℝ) =
            (13748037340659291 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13748037340659291 / 10000000000000000 : ℝ) ≤
            (3183109820692313939357 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3433948380588083 / 10000000000000000 : ℝ)) (q :=
      (13748037340659291 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_362_5 :
    Uω (aρ 5) (bρ 5) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(11044759885449248784207 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13255379433889969 / 40000000000000000 : ℝ) ≤
      (-(11044759885449248784207 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13255379433889969 / 40000000000000000 : ℝ) =
            (13255379433889969 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13255379433889969 / 10000000000000000 : ℝ) ≤
            (2818183720550751215793 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1652904673269211 / 5000000000000000 : ℝ)) (q :=
      (13255379433889969 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_362_6 :
    Uω (aρ 6) (bρ 6) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(11599343909730129726657 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12540269956705601 / 40000000000000000 : ℝ) ≤
      (-(11599343909730129726657 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12540269956705601 / 40000000000000000 : ℝ) =
            (12540269956705601 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12540269956705601 / 10000000000000000 : ℝ) ≤
            (2263599696269870273343 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1557747491543119 / 5000000000000000 : ℝ)) (q :=
      (12540269956705601 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_362_7 :
    Uω (aρ 7) (bρ 7) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(3106743528122563498903 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11544187255281831 / 40000000000000000 : ℝ) ≤
      (-(3106743528122563498903 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11544187255281831 / 40000000000000000 : ℝ) =
            (11544187255281831 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11544187255281831 / 10000000000000000 : ℝ) ≤
            (358992373377436501097 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2841115013134353 / 10000000000000000 : ℝ)) (q :=
      (11544187255281831 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_362_8 :
    Uω (aρ 8) (bρ 8) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(13670958453277325403241 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10193839918233171 / 40000000000000000 : ℝ) ≤
      (-(13670958453277325403241 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10193839918233171 / 40000000000000000 : ℝ) =
            (10193839918233171 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10193839918233171 / 10000000000000000 : ℝ) ≤
            (191985152722674596759 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2449482995950023 / 10000000000000000 : ℝ)) (q :=
      (10193839918233171 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_362_9 :
    Uω (aρ 9) (bρ 9) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(3913833307851789537159 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1671812250119869 / 8000000000000000 : ℝ) ≤
      (-(3913833307851789537159 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1671812250119869 / 8000000000000000 : ℝ) =
            (1671812250119869 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1671812250119869 / 1000000000000000 : ℝ) ≤
            (1284770544398210462841 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (187305929049311 / 1000000000000000 : ℝ)) (q :=
      (1671812250119869 / 8000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_362_10 :
    Uω (aρ 10) (bρ 10) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(9946561910692850307419 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8754524920219 / 64000000000000 : ℝ) ≤
      (-(9946561910692850307419 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show (8754524920219 / 64000000000000 : ℝ) = (8754524920219 / 8000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8754524920219 / 8000000000000 : ℝ) ≤
            (450645793807149692581 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1308602778011 / 16000000000000 : ℝ)) (q :=
      (8754524920219 / 64000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_362_11 :
    Uω (aρ 11) (bρ 11) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_362_12 :
    Uω (aρ 12) (bρ 12) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_362_13 :
    Uω (aρ 13) (bρ 13) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_362_14 :
    Uω (aρ 14) (bρ 14) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_362_15 :
    Uω (aρ 15) (bρ 15) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_362_16 :
    Uω (aρ 16) (bρ 16) (2338577156961 / 6400000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_362 :
    Uρ (2338577156961 / 6400000000000 : ℝ) ≤
      (-(7123687311461268586551 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2338577156961 / 6400000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2049152959136992528997 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2338577156961 / 6400000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5156455837481287013357 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2338577156961 / 6400000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1306109752858577475561 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2338577156961 / 6400000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10679833785307686060643 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2338577156961 / 6400000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(11044759885449248784207 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2338577156961 / 6400000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11599343909730129726657 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2338577156961 / 6400000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3106743528122563498903 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2338577156961 / 6400000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13670958453277325403241 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2338577156961 / 6400000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3913833307851789537159 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2338577156961 / 6400000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(9946561910692850307419 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2338577156961 / 6400000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2338577156961 / 6400000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2338577156961 / 6400000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2338577156961 / 6400000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2338577156961 / 6400000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2338577156961 / 6400000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_362_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_363_1 :
    Uω (aρ 1) (bρ 1) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(2045512028171230018933 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57536400554320391 / 160000000000000000 : ℝ) ≤
      (-(2045512028171230018933 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57536400554320391 / 160000000000000000 : ℝ) =
            (57536400554320391 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57536400554320391 / 40000000000000000 : ℝ) ≤
            (727076693028769981067 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1797990038629751 / 5000000000000000 : ℝ)) (q :=
      (57536400554320391 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_363_2 :
    Uω (aρ 2) (bρ 2) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(5147291593243858290007 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57152063485113007 / 160000000000000000 : ℝ) ≤
      (-(5147291593243858290007 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57152063485113007 / 160000000000000000 : ℝ) =
            (57152063485113007 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57152063485113007 / 40000000000000000 : ℝ) ≤
            (1784180209756141709993 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3571706956118579 / 10000000000000000 : ℝ)) (q :=
      (57152063485113007 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_363_3 :
    Uω (aρ 3) (bρ 3) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(325946714534062058909 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56381682546325183 / 160000000000000000 : ℝ) ≤
      (-(325946714534062058909 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56381682546325183 / 160000000000000000 : ℝ) =
            (56381682546325183 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56381682546325183 / 40000000000000000 : ℝ) ≤
            (107270273153437941091 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3522805445120101 / 10000000000000000 : ℝ)) (q :=
      (56381682546325183 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_363_4 :
    Uω (aρ 4) (bρ 4) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(2665201407234472898471 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55096888902770287 / 160000000000000000 : ℝ) ≤
      (-(2665201407234472898471 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55096888902770287 / 160000000000000000 : ℝ) =
            (55096888902770287 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55096888902770287 / 40000000000000000 : ℝ) ≤
            (800534494265527101529 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3440500420740739 / 10000000000000000 : ℝ)) (q :=
      (55096888902770287 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_363_5 :
    Uω (aρ 5) (bρ 5) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(5512497476862254615211 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (53126418036573151 / 160000000000000000 : ℝ) ≤
      (-(5512497476862254615211 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (53126418036573151 / 160000000000000000 : ℝ) =
            (53126418036573151 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (53126418036573151 / 40000000000000000 : ℝ) ≤
            (1418974326137745384789 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3312381481801097 / 10000000000000000 : ℝ)) (q :=
      (53126418036573151 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_363_6 :
    Uω (aρ 6) (bρ 6) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(11578373049824663123831 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10053276460035483 / 32000000000000000 : ℝ) ≤
      (-(11578373049824663123831 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10053276460035483 / 32000000000000000 : ℝ) =
            (10053276460035483 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10053276460035483 / 8000000000000000 : ℝ) ≤
            (2284570556175336876169 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (312211738989163 / 1000000000000000 : ℝ)) (q :=
      (10053276460035483 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_363_7 :
    Uω (aρ 7) (bρ 7) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(12403980855685154507843 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9256609313099763 / 32000000000000000 : ℝ) ≤
      (-(12403980855685154507843 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9256609313099763 / 32000000000000000 : ℝ) =
            (9256609313099763 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9256609313099763 / 8000000000000000 : ℝ) ≤
            (1458962750314845492157 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (569572360763361 / 2000000000000000 : ℝ)) (q :=
      (9256609313099763 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_363_8 :
    Uω (aρ 8) (bρ 8) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(13644295748051856774619 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40884222877358991 / 160000000000000000 : ℝ) ≤
      (-(13644295748051856774619 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (40884222877358991 / 160000000000000000 : ℝ) =
            (40884222877358991 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40884222877358991 / 40000000000000000 : ℝ) ≤
            (218647857948143225381 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2456550494139327 / 10000000000000000 : ℝ)) (q :=
      (40884222877358991 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_363_9 :
    Uω (aρ 9) (bρ 9) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(15620489763713965806193 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6710590335968427 / 32000000000000000 : ℝ) ≤
      (-(15620489763713965806193 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6710590335968427 / 32000000000000000 : ℝ) =
            (6710590335968427 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6710590335968427 / 4000000000000000 : ℝ) ≤
            (5173925645286034193807 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (47027680570243 / 250000000000000 : ℝ)) (q :=
      (6710590335968427 / 32000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_363_10 :
    Uω (aρ 10) (bρ 10) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(3962778525587527231453 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22060408948427751 / 160000000000000000 : ℝ) ≤
      (-(3962778525587527231453 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (22060408948427751 / 160000000000000000 : ℝ) =
            (22060408948427751 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22060408948427751 / 20000000000000000 : ℝ) ≤
            (196104556212472768547 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (416549207438961 / 5000000000000000 : ℝ)) (q :=
      (22060408948427751 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_363_11 :
    Uω (aρ 11) (bρ 11) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_363_12 :
    Uω (aρ 12) (bρ 12) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_363_13 :
    Uω (aρ 13) (bρ 13) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_363_14 :
    Uω (aρ 14) (bρ 14) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_363_15 :
    Uω (aρ 15) (bρ 15) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_363_16 :
    Uω (aρ 16) (bρ 16) (46855260289479 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_363 :
    Uρ (46855260289479 / 128000000000000 : ℝ) ≤
      (-(14227562214506348845581 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (46855260289479 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2045512028171230018933 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (46855260289479 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(5147291593243858290007 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (46855260289479 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(325946714534062058909 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (46855260289479 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2665201407234472898471 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (46855260289479 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5512497476862254615211 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (46855260289479 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11578373049824663123831 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (46855260289479 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12403980855685154507843 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (46855260289479 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13644295748051856774619 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (46855260289479 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(15620489763713965806193 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (46855260289479 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3962778525587527231453 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (46855260289479 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (46855260289479 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (46855260289479 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (46855260289479 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (46855260289479 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (46855260289479 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_363_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
