/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U31) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_376_1 :
    Uω (aρ 1) (bρ 1) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(9993867007066015957191 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29448410430551627 / 80000000000000000 : ℝ) ≤
      (-(9993867007066015957191 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (29448410430551627 / 80000000000000000 : ℝ) =
            (29448410430551627 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29448410430551627 / 20000000000000000 : ℝ) ≤
            (3869076598933984042809 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3681007384875563 / 10000000000000000 : ℝ)) (q :=
      (29448410430551627 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_376_2 :
    Uω (aρ 2) (bρ 2) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(10059320806281235657447 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5851257767303279 / 16000000000000000 : ℝ) ≤
      (-(10059320806281235657447 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5851257767303279 / 16000000000000000 : ℝ) =
            (5851257767303279 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5851257767303279 / 4000000000000000 : ℝ) ≤
            (3803622799718764342553 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (731349199775351 / 2000000000000000 : ℝ)) (q :=
      (5851257767303279 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_376_3 :
    Uω (aρ 3) (bρ 3) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(2038361309453471391991 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5774248205069027 / 16000000000000000 : ℝ) ≤
      (-(2038361309453471391991 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5774248205069027 / 16000000000000000 : ℝ) =
            (5774248205069027 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5774248205069027 / 4000000000000000 : ℝ) ≤
            (734227411746528608009 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (180394007621697 / 500000000000000 : ℝ)) (q :=
      (5774248205069027 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_376_4 :
    Uω (aρ 4) (bρ 4) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(5208342325874971915933 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28229235731470567 / 80000000000000000 : ℝ) ≤
      (-(5208342325874971915933 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28229235731470567 / 80000000000000000 : ℝ) =
            (28229235731470567 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28229235731470567 / 20000000000000000 : ℝ) ≤
            (1723129477125028084067 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1762836505015149 / 5000000000000000 : ℝ)) (q :=
      (28229235731470567 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_376_5 :
    Uω (aρ 5) (bρ 5) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(2692890035511764538969 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5449003279831591 / 16000000000000000 : ℝ) ≤
      (-(2692890035511764538969 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5449003279831591 / 16000000000000000 : ℝ) =
            (5449003279831591 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5449003279831591 / 4000000000000000 : ℝ) ≤
            (772845865988235461031 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (679561619257429 / 2000000000000000 : ℝ)) (q :=
      (5449003279831591 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_376_6 :
    Uω (aρ 6) (bρ 6) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(11309727313063090127271 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25817534757717279 / 80000000000000000 : ℝ) ≤
      (-(11309727313063090127271 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25817534757717279 / 80000000000000000 : ℝ) =
            (25817534757717279 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25817534757717279 / 20000000000000000 : ℝ) ≤
            (2553216292936909872729 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (100255564408343 / 312500000000000 : ℝ)) (q :=
      (25817534757717279 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_376_7 :
    Uω (aρ 7) (bρ 7) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(12109924977090579279271 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23832117278369707 / 80000000000000000 : ℝ) ≤
      (-(12109924977090579279271 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (23832117278369707 / 80000000000000000 : ℝ) =
            (23832117278369707 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23832117278369707 / 20000000000000000 : ℝ) ≤
            (1753018628909420720729 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2935485071990083 / 10000000000000000 : ℝ)) (q :=
      (23832117278369707 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_376_8 :
    Uω (aρ 8) (bρ 8) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(13304483040210431015309 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21148697721244531 / 80000000000000000 : ℝ) ≤
      (-(13304483040210431015309 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21148697721244531 / 80000000000000000 : ℝ) =
            (21148697721244531 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21148697721244531 / 20000000000000000 : ℝ) ≤
            (558460565789568984691 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2548171834048789 / 10000000000000000 : ℝ)) (q :=
      (21148697721244531 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_376_9 :
    Uω (aρ 9) (bρ 9) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(15180537896117200035529 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3506207369726651 / 16000000000000000 : ℝ) ≤
      (-(15180537896117200035529 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3506207369726651 / 16000000000000000 : ℝ) =
            (3506207369726651 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3506207369726651 / 2000000000000000 : ℝ) ≤
            (5613877512882799964471 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (198472224425597 / 1000000000000000 : ℝ)) (q :=
      (3506207369726651 / 16000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_376_10 :
    Uω (aρ 10) (bρ 10) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(18892689722321229897263 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12094582942561791 / 80000000000000000 : ℝ) ≤
      (-(18892689722321229897263 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12094582942561791 / 80000000000000000 : ℝ) =
            (12094582942561791 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12094582942561791 / 10000000000000000 : ℝ) ≤
            (1901725686678770102737 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (63385487577069 / 625000000000000 : ℝ)) (q :=
      (12094582942561791 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_376_11 :
    Uω (aρ 11) (bρ 11) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_376_12 :
    Uω (aρ 12) (bρ 12) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_376_13 :
    Uω (aρ 13) (bρ 13) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_376_14 :
    Uω (aρ 14) (bρ 14) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_376_15 :
    Uω (aρ 15) (bρ 15) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_376_16 :
    Uω (aρ 16) (bρ 16) (23971791621423 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_376 :
    Uρ (23971791621423 / 64000000000000 : ℝ) ≤
      (-(6991230191038809068327 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23971791621423 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9993867007066015957191 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23971791621423 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10059320806281235657447 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23971791621423 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2038361309453471391991 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23971791621423 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5208342325874971915933 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23971791621423 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2692890035511764538969 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23971791621423 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11309727313063090127271 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23971791621423 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12109924977090579279271 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23971791621423 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13304483040210431015309 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23971791621423 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(15180537896117200035529 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23971791621423 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18892689722321229897263 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23971791621423 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23971791621423 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23971791621423 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23971791621423 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23971791621423 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23971791621423 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_376_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_377_1 :
    Uω (aρ 1) (bρ 1) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(9976114805201331339663 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (59001468545273121 / 160000000000000000 : ℝ) ≤
      (-(9976114805201331339663 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (59001468545273121 / 160000000000000000 : ℝ) =
            (59001468545273121 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (59001468545273121 / 40000000000000000 : ℝ) ≤
            (3886828800798668660337 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (921886985758203 / 2500000000000000 : ℝ)) (q :=
      (59001468545273121 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_377_2 :
    Uω (aρ 2) (bρ 2) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(2510362732834259353731 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58617232398093521 / 160000000000000000 : ℝ) ≤
      (-(2510362732834259353731 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58617232398093521 / 160000000000000000 : ℝ) =
            (58617232398093521 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58617232398093521 / 40000000000000000 : ℝ) ≤
            (955373168665740646269 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1831643718572681 / 5000000000000000 : ℝ)) (q :=
      (58617232398093521 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_377_3 :
    Uω (aρ 3) (bρ 3) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(10173694864971688524833 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57847158164087953 / 160000000000000000 : ℝ) ≤
      (-(10173694864971688524833 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57847158164087953 / 160000000000000000 : ℝ) =
            (57847158164087953 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57847158164087953 / 40000000000000000 : ℝ) ≤
            (3689248741028311475167 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1807212132122333 / 5000000000000000 : ℝ)) (q :=
      (57847158164087953 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_377_4 :
    Uω (aρ 4) (bρ 4) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(5199075537472519501479 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56563206230168601 / 160000000000000000 : ℝ) ≤
      (-(5199075537472519501479 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56563206230168601 / 160000000000000000 : ℝ) =
            (56563206230168601 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56563206230168601 / 40000000000000000 : ℝ) ≤
            (1732396265527480498521 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3532224453569747 / 10000000000000000 : ℝ)) (q :=
      (56563206230168601 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_377_5 :
    Uω (aρ 5) (bρ 5) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(10752329842358406152703 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (54594919582282977 / 160000000000000000 : ℝ) ≤
      (-(10752329842358406152703 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (54594919582282977 / 160000000000000000 : ℝ) =
            (54594919582282977 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (54594919582282977 / 40000000000000000 : ℝ) ≤
            (3110613763641593847297 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (851094635479761 / 2500000000000000 : ℝ)) (q :=
      (54594919582282977 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_377_6 :
    Uω (aρ 6) (bρ 6) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(11289361654615094735919 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (51740334887951473 / 160000000000000000 : ℝ) ≤
      (-(11289361654615094735919 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (51740334887951473 / 160000000000000000 : ℝ) =
            (51740334887951473 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (51740334887951473 / 40000000000000000 : ℝ) ≤
            (2573581951384905264081 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1607397915133803 / 5000000000000000 : ℝ)) (q :=
      (51740334887951473 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_377_7 :
    Uω (aρ 7) (bρ 7) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(12087670011636276249273 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (47770429270239633 / 160000000000000000 : ℝ) ≤
      (-(12087670011636276249273 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (47770429270239633 / 160000000000000000 : ℝ) =
            (47770429270239633 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (47770429270239633 / 40000000000000000 : ℝ) ≤
            (1775273594363723750727 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1471109504406813 / 5000000000000000 : ℝ)) (q :=
      (47770429270239633 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_377_8 :
    Uω (aρ 8) (bρ 8) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(13278851339418135968547 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1696237996931321 / 6400000000000000 : ℝ) ≤
      (-(13278851339418135968547 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1696237996931321 / 6400000000000000 : ℝ) =
            (1696237996931321 / 1600000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1696237996931321 / 1600000000000000 : ℝ) ≤
            (584092266581864031453 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (51104014835681 / 200000000000000 : ℝ)) (q :=
      (1696237996931321 / 6400000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_377_9 :
    Uω (aρ 9) (bρ 9) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(3029529911736138818707 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35177576859602393 / 160000000000000000 : ℝ) ≤
      (-(3029529911736138818707 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (35177576859602393 / 160000000000000000 : ℝ) =
            (35177576859602393 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35177576859602393 / 20000000000000000 : ℝ) ≤
            (1129353170063861181293 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1992619737183971 / 10000000000000000 : ℝ)) (q :=
      (35177576859602393 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_377_10 :
    Uω (aρ 10) (bρ 10) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(18828606670727822522699 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24344675185006513 / 160000000000000000 : ℝ) ≤
      (-(18828606670727822522699 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24344675185006513 / 160000000000000000 : ℝ) =
            (24344675185006513 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24344675185006513 / 20000000000000000 : ℝ) ≤
            (1965808738272177477301 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (513533030677243 / 5000000000000000 : ℝ)) (q :=
      (24344675185006513 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_377_11 :
    Uω (aρ 11) (bρ 11) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_377_12 :
    Uω (aρ 12) (bρ 12) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_377_13 :
    Uω (aρ 13) (bρ 13) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_377_14 :
    Uω (aρ 14) (bρ 14) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_377_15 :
    Uω (aρ 15) (bρ 15) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_377_16 :
    Uω (aρ 16) (bρ 16) (9605460078621 / 25600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_377 :
    Uρ (9605460078621 / 25600000000000 : ℝ) ≤
      (-(2792884219465679483077 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (9605460078621 / 25600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9976114805201331339663 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (9605460078621 / 25600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2510362732834259353731 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (9605460078621 / 25600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10173694864971688524833 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (9605460078621 / 25600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5199075537472519501479 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (9605460078621 / 25600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10752329842358406152703 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (9605460078621 / 25600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11289361654615094735919 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (9605460078621 / 25600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(12087670011636276249273 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (9605460078621 / 25600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13278851339418135968547 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (9605460078621 / 25600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3029529911736138818707 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (9605460078621 / 25600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18828606670727822522699 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (9605460078621 / 25600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (9605460078621 / 25600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (9605460078621 / 25600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (9605460078621 / 25600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (9605460078621 / 25600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (9605460078621 / 25600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_377_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_378_1 :
    Uω (aρ 1) (bρ 1) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(9958394062313398461891 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2955305811251481 / 8000000000000000 : ℝ) ≤
      (-(9958394062313398461891 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2955305811251481 / 8000000000000000 : ℝ) =
            (2955305811251481 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2955305811251481 / 2000000000000000 : ℝ) ≤
            (3904549543686601538109 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (369408850063839 / 1000000000000000 : ℝ)) (q :=
      (2955305811251481 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_378_2 :
    Uω (aρ 2) (bρ 2) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(10023612937712580116809 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14680471773403183 / 40000000000000000 : ℝ) ≤
      (-(10023612937712580116809 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14680471773403183 / 40000000000000000 : ℝ) =
            (14680471773403183 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14680471773403183 / 10000000000000000 : ℝ) ≤
            (3839330668287419883191 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3669828871721279 / 10000000000000000 : ℝ)) (q :=
      (14680471773403183 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_378_3 :
    Uω (aρ 3) (bρ 3) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(10155615945187571679447 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14487958542562941 / 40000000000000000 : ℝ) ≤
      (-(10155615945187571679447 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14487958542562941 / 40000000000000000 : ℝ) =
            (14487958542562941 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14487958542562941 / 10000000000000000 : ℝ) ≤
            (3707327660812428320553 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1810484181325579 / 5000000000000000 : ℝ)) (q :=
      (14487958542562941 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_378_4 :
    Uω (aρ 4) (bρ 4) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(518982592080921205731 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14166985167654459 / 40000000000000000 : ℝ) ≤
      (-(518982592080921205731 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14166985167654459 / 40000000000000000 : ℝ) =
            (14166985167654459 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14166985167654459 / 10000000000000000 : ℝ) ≤
            (174164588219078794269 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3538775856261917 / 10000000000000000 : ℝ)) (q :=
      (14166985167654459 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_378_5 :
    Uω (aρ 5) (bρ 5) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(10733136621036858840227 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13674951360604657 / 40000000000000000 : ℝ) ≤
      (-(10733136621036858840227 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13674951360604657 / 40000000000000000 : ℝ) =
            (13674951360604657 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13674951360604657 / 10000000000000000 : ℝ) ≤
            (3129806984963141159773 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (213184304504501 / 625000000000000 : ℝ)) (q :=
      (13674951360604657 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_378_6 :
    Uω (aρ 6) (bρ 6) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(11269037875509371656561 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12961399433092597 / 40000000000000000 : ℝ) ≤
      (-(11269037875509371656561 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12961399433092597 / 40000000000000000 : ℝ) =
            (12961399433092597 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12961399433092597 / 10000000000000000 : ℝ) ≤
            (2593905730490628343439 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1610706641727993 / 5000000000000000 : ℝ)) (q :=
      (12961399433092597 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_378_7 :
    Uω (aρ 7) (bρ 7) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(2413093184052817137671 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11969154253592859 / 40000000000000000 : ℝ) ≤
      (-(2413093184052817137671 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11969154253592859 / 40000000000000000 : ℝ) =
            (11969154253592859 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11969154253592859 / 10000000000000000 : ℝ) ≤
            (359495537147182862329 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2948952074466117 / 10000000000000000 : ℝ)) (q :=
      (11969154253592859 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_378_8 :
    Uω (aρ 8) (bρ 8) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(13253290037235338137851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10628620926866167 / 40000000000000000 : ℝ) ≤
      (-(13253290037235338137851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10628620926866167 / 40000000000000000 : ℝ) =
            (10628620926866167 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10628620926866167 / 10000000000000000 : ℝ) ≤
            (609653568764661862149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2562227062442771 / 10000000000000000 : ℝ)) (q :=
      (10628620926866167 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_378_9 :
    Uω (aρ 9) (bρ 9) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(7557445616019576398087 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (352930016678841 / 1600000000000000 : ℝ) ≤
      (-(7557445616019576398087 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (352930016678841 / 1600000000000000 : ℝ) =
            (352930016678841 / 200000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (352930016678841 / 200000000000000 : ℝ) ≤
            (2839762088480423601913 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2500634294819 / 12500000000000 : ℝ)) (q :=
      (352930016678841 / 1600000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_378_10 :
    Uω (aρ 10) (bρ 10) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(18765319741641310131049 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6124808429773381 / 40000000000000000 : ℝ) ≤
      (-(18765319741641310131049 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6124808429773381 / 40000000000000000 : ℝ) =
            (6124808429773381 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6124808429773381 / 5000000000000000 : ℝ) ≤
            (2029095667358689868951 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (519922737875689 / 5000000000000000 : ℝ)) (q :=
      (6124808429773381 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_378_11 :
    Uω (aρ 11) (bρ 11) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_378_12 :
    Uω (aρ 12) (bρ 12) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_378_13 :
    Uω (aρ 13) (bρ 13) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_378_14 :
    Uω (aρ 14) (bρ 14) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_378_15 :
    Uω (aρ 15) (bρ 15) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_378_16 :
    Uω (aρ 16) (bρ 16) (12027754385841 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_378 :
    Uρ (12027754385841 / 32000000000000 : ℝ) ≤
      (-(13946482418286257096903 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (12027754385841 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9958394062313398461891 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (12027754385841 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(10023612937712580116809 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (12027754385841 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10155615945187571679447 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (12027754385841 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(518982592080921205731 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (12027754385841 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10733136621036858840227 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (12027754385841 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11269037875509371656561 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (12027754385841 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2413093184052817137671 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (12027754385841 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13253290037235338137851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (12027754385841 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7557445616019576398087 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (12027754385841 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18765319741641310131049 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (12027754385841 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (12027754385841 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (12027754385841 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (12027754385841 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (12027754385841 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (12027754385841 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_378_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_379_1 :
    Uω (aρ 1) (bρ 1) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(9940704667098828597671 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11842152780079227 / 32000000000000000 : ℝ) ≤
      (-(9940704667098828597671 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11842152780079227 / 32000000000000000 : ℝ) =
            (11842152780079227 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11842152780079227 / 8000000000000000 : ℝ) ≤
            (3922238938901171402329 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (185031452884761 / 500000000000000 : ℝ)) (q :=
      (11842152780079227 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_379_2 :
    Uω (aρ 2) (bρ 2) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(2501451677958700695517 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58826541759748119 / 160000000000000000 : ℝ) ≤
      (-(2501451677958700695517 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58826541759748119 / 160000000000000000 : ℝ) =
            (58826541759748119 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58826541759748119 / 40000000000000000 : ℝ) ≤
            (964284223541299304483 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1838185151312109 / 5000000000000000 : ℝ)) (q :=
      (58826541759748119 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_379_3 :
    Uω (aρ 3) (bρ 3) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(5068784834766586812851 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58056510069762047 / 160000000000000000 : ℝ) ≤
      (-(5068784834766586812851 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58056510069762047 / 160000000000000000 : ℝ) =
            (58056510069762047 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58056510069762047 / 40000000000000000 : ℝ) ≤
            (1862686968233413187149 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3627512447725959 / 10000000000000000 : ℝ)) (q :=
      (58056510069762047 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_379_4 :
    Uω (aρ 4) (bρ 4) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(414447472980535392993 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56772674786100383 / 160000000000000000 : ℝ) ≤
      (-(414447472980535392993 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56772674786100383 / 160000000000000000 : ℝ) =
            (56772674786100383 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56772674786100383 / 40000000000000000 : ℝ) ≤
            (140070271259464607007 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3545327218333251 / 10000000000000000 : ℝ)) (q :=
      (56772674786100383 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_379_5 :
    Uω (aρ 5) (bρ 5) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(10713980334728234077113 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (54804690384051199 / 160000000000000000 : ℝ) ≤
      (-(10713980334728234077113 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (54804690384051199 / 160000000000000000 : ℝ) =
            (54804690384051199 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (54804690384051199 / 40000000000000000 : ℝ) ≤
            (3148963271271765922887 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3417519087412103 / 10000000000000000 : ℝ)) (q :=
      (54804690384051199 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_379_6 :
    Uω (aρ 6) (bρ 6) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(11248755801878956064031 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (51950858064239079 / 160000000000000000 : ℝ) ≤
      (-(11248755801878956064031 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (51950858064239079 / 160000000000000000 : ℝ) =
            (51950858064239079 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (51950858064239079 / 40000000000000000 : ℝ) ≤
            (2614187804121043935969 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (807007605643897 / 2500000000000000 : ℝ)) (q :=
      (51950858064239079 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_379_7 :
    Uω (aρ 7) (bρ 7) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(602165623219844768649 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (47982797836763607 / 160000000000000000 : ℝ) ≤
      (-(602165623219844768649 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (47982797836763607 / 160000000000000000 : ℝ) =
            (47982797836763607 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (47982797836763607 / 40000000000000000 : ℝ) ≤
            (90981557080155231351 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1477842137450577 / 5000000000000000 : ℝ)) (q :=
      (47982797836763607 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_379_8 :
    Uω (aρ 8) (bρ 8) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(6613899361208653044927 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42622996964835687 / 160000000000000000 : ℝ) ≤
      (-(6613899361208653044927 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42622996964835687 / 160000000000000000 : ℝ) =
            (42622996964835687 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42622996964835687 / 40000000000000000 : ℝ) ≤
            (317572441791346955073 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (642312704312541 / 2500000000000000 : ℝ)) (q :=
      (42622996964835687 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_379_9 :
    Uω (aρ 9) (bρ 9) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(3770565433462939589999 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1416333961811631 / 6400000000000000 : ℝ) ≤
      (-(3770565433462939589999 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1416333961811631 / 6400000000000000 : ℝ) =
            (1416333961811631 / 800000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1416333961811631 / 800000000000000 : ℝ) ≤
            (1428038418787060410001 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (40167709113341 / 200000000000000 : ℝ)) (q :=
      (1416333961811631 / 6400000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_379_10 :
    Uω (aρ 10) (bρ 10) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(3740560484983560820433 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24652876119599351 / 160000000000000000 : ℝ) ≤
      (-(3740560484983560820433 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24652876119599351 / 160000000000000000 : ℝ) =
            (24652876119599351 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24652876119599351 / 20000000000000000 : ℝ) ≤
            (418322596816439179567 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (526255186725311 / 5000000000000000 : ℝ)) (q :=
      (24652876119599351 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_379_11 :
    Uω (aρ 11) (bρ 11) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_379_12 :
    Uω (aρ 12) (bρ 12) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_379_13 :
    Uω (aρ 13) (bρ 13) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_379_14 :
    Uω (aρ 14) (bρ 14) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_379_15 :
    Uω (aρ 15) (bρ 15) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_379_16 :
    Uω (aρ 16) (bρ 16) (48194734693623 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_379 :
    Uρ (48194734693623 / 128000000000000 : ℝ) ≤
      (-(13928641877448414677921 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (48194734693623 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9940704667098828597671 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (48194734693623 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2501451677958700695517 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (48194734693623 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5068784834766586812851 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (48194734693623 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(414447472980535392993 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (48194734693623 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10713980334728234077113 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (48194734693623 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11248755801878956064031 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (48194734693623 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(602165623219844768649 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (48194734693623 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6613899361208653044927 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (48194734693623 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3770565433462939589999 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (48194734693623 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3740560484983560820433 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (48194734693623 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (48194734693623 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (48194734693623 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (48194734693623 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (48194734693623 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (48194734693623 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_379_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_380_1 :
    Uω (aρ 1) (bρ 1) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(4961523254421947127759 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29657705785697957 / 80000000000000000 : ℝ) ≤
      (-(4961523254421947127759 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (29657705785697957 / 80000000000000000 : ℝ) =
            (29657705785697957 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29657705785697957 / 20000000000000000 : ℝ) ≤
            (1969948548578052872241 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (14481131305493 / 39062500000000 : ℝ)) (q :=
      (29657705785697957 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_380_2 :
    Uω (aρ 2) (bρ 2) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(1248504017592068370069 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29465598198328121 / 80000000000000000 : ℝ) ≤
      (-(1248504017592068370069 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (29465598198328121 / 80000000000000000 : ℝ) =
            (29465598198328121 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29465598198328121 / 20000000000000000 : ℝ) ≤
            (484363933157931629931 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3682911729873749 / 10000000000000000 : ℝ)) (q :=
      (29465598198328121 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_380_3 :
    Uω (aρ 3) (bρ 3) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(10119555920267487374541 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29080592931597497 / 80000000000000000 : ℝ) ≤
      (-(10119555920267487374541 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (29080592931597497 / 80000000000000000 : ℝ) =
            (29080592931597497 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29080592931597497 / 20000000000000000 : ℝ) ≤
            (3743387685732512625459 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3634056519541093 / 10000000000000000 : ℝ)) (q :=
      (29080592931597497 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_380_4 :
    Uω (aρ 4) (bρ 4) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(10342755897080370757173 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28438704289207221 / 80000000000000000 : ℝ) ≤
      (-(10342755897080370757173 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28438704289207221 / 80000000000000000 : ℝ) =
            (28438704289207221 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28438704289207221 / 20000000000000000 : ℝ) ≤
            (3520187708919629242827 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (887969635002131 / 2500000000000000 : ℝ)) (q :=
      (28438704289207221 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_380_5 :
    Uω (aρ 5) (bρ 5) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(10694860840911806552079 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5490957441246801 / 16000000000000000 : ℝ) ≤
      (-(10694860840911806552079 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5490957441246801 / 16000000000000000 : ℝ) =
            (5490957441246801 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5490957441246801 / 4000000000000000 : ℝ) ≤
            (3168082765088193447921 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (171204459430011 / 500000000000000 : ℝ)) (q :=
      (5490957441246801 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_380_6 :
    Uω (aρ 6) (bρ 6) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(5614257630474681781133 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26028057949488689 / 80000000000000000 : ℝ) ≤
      (-(5614257630474681781133 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (26028057949488689 / 80000000000000000 : ℝ) =
            (26028057949488689 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26028057949488689 / 20000000000000000 : ℝ) ≤
            (1317214172525318218867 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3234647249553891 / 10000000000000000 : ℝ)) (q :=
      (26028057949488689 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_380_7 :
    Uω (aρ 7) (bρ 7) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(3005302351793728355003 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24044485892302941 / 80000000000000000 : ℝ) ≤
      (-(3005302351793728355003 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24044485892302941 / 80000000000000000 : ℝ) =
            (24044485892302941 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24044485892302941 / 20000000000000000 : ℝ) ≤
            (460433549706271644997 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1481207808008727 / 5000000000000000 : ℝ)) (q :=
      (24044485892302941 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_380_8 :
    Uω (aρ 8) (bρ 8) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(6601188493753449905703 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21365744931642169 / 80000000000000000 : ℝ) ≤
      (-(6601188493753449905703 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21365744931642169 / 80000000000000000 : ℝ) =
            (21365744931642169 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21365744931642169 / 20000000000000000 : ℝ) ≤
            (330283309246550094297 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2576272027192261 / 10000000000000000 : ℝ)) (q :=
      (21365744931642169 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_380_9 :
    Uω (aρ 9) (bρ 9) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(601990395975625400427 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17761809949724573 / 80000000000000000 : ℝ) ≤
      (-(601990395975625400427 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17761809949724573 / 80000000000000000 : ℝ) =
            (17761809949724573 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17761809949724573 / 10000000000000000 : ℝ) ≤
            (229786220384374599573 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1008126955036431 / 5000000000000000 : ℝ)) (q :=
      (17761809949724573 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_380_10 :
    Uω (aρ 10) (bρ 10) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(4660257416487714340737 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12402817534183093 / 80000000000000000 : ℝ) ≤
      (-(4660257416487714340737 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12402817534183093 / 80000000000000000 : ℝ) =
            (12402817534183093 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12402817534183093 / 10000000000000000 : ℝ) ≤
            (538346435762285659263 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (266266209920623 / 2500000000000000 : ℝ)) (q :=
      (12402817534183093 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_380_11 :
    Uω (aρ 11) (bρ 11) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_380_12 :
    Uω (aρ 12) (bρ 12) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_380_13 :
    Uω (aρ 13) (bρ 13) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_380_14 :
    Uω (aρ 14) (bρ 14) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_380_15 :
    Uω (aρ 15) (bρ 15) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_380_16 :
    Uω (aρ 16) (bρ 16) (24139225921941 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_380 :
    Uρ (24139225921941 / 64000000000000 : ℝ) ≤
      (-(6955448566996252704807 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (24139225921941 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4961523254421947127759 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (24139225921941 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1248504017592068370069 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (24139225921941 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10119555920267487374541 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (24139225921941 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10342755897080370757173 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (24139225921941 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10694860840911806552079 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (24139225921941 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5614257630474681781133 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (24139225921941 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3005302351793728355003 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (24139225921941 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6601188493753449905703 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (24139225921941 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(601990395975625400427 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (24139225921941 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(4660257416487714340737 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (24139225921941 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (24139225921941 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (24139225921941 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (24139225921941 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (24139225921941 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (24139225921941 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_380_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_381_1 :
    Uω (aρ 1) (bρ 1) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(9905419477420379522699 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (59420059238052021 / 160000000000000000 : ℝ) ≤
      (-(9905419477420379522699 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (59420059238052021 / 160000000000000000 : ℝ) =
            (59420059238052021 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (59420059238052021 / 40000000000000000 : ℝ) ≤
            (3957524128579620477301 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3713710170174237 / 10000000000000000 : ℝ)) (q :=
      (59420059238052021 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_381_2 :
    Uω (aρ 2) (bρ 2) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(997028911205224600551 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (59035851004492581 / 160000000000000000 : ℝ) ≤
      (-(997028911205224600551 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (59035851004492581 / 160000000000000000 : ℝ) =
            (59035851004492581 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (59035851004492581 / 40000000000000000 : ℝ) ≤
            (389265449394775399449 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3689453153489307 / 10000000000000000 : ℝ)) (q :=
      (59035851004492581 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_381_3 :
    Uω (aρ 3) (bρ 3) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(10101574580285721318899 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58265861551122629 / 160000000000000000 : ℝ) ≤
      (-(10101574580285721318899 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58265861551122629 / 160000000000000000 : ℝ) =
            (58265861551122629 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58265861551122629 / 40000000000000000 : ℝ) ≤
            (3761369025714278681101 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3640600578168063 / 10000000000000000 : ℝ)) (q :=
      (58265861551122629 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_381_4 :
    Uω (aρ 4) (bρ 4) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(10324358933471767397939 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56982142049344933 / 160000000000000000 : ℝ) ≤
      (-(10324358933471767397939 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56982142049344933 / 160000000000000000 : ℝ) =
            (56982142049344933 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56982142049344933 / 40000000000000000 : ℝ) ≤
            (3538584672528232602061 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3558429821510851 / 10000000000000000 : ℝ)) (q :=
      (56982142049344933 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_381_5 :
    Uω (aρ 5) (bρ 5) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(2135155599578764903971 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55014457532915797 / 160000000000000000 : ℝ) ≤
      (-(2135155599578764903971 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55014457532915797 / 160000000000000000 : ℝ) =
            (55014457532915797 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55014457532915797 / 40000000000000000 : ℝ) ≤
            (637433121621235096029 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3430659176292209 / 10000000000000000 : ℝ)) (q :=
      (55014457532915797 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_381_6 :
    Uω (aρ 6) (bρ 6) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(2802079020257341762367 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (52161371251878461 / 160000000000000000 : ℝ) ≤
      (-(2802079020257341762367 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (52161371251878461 / 160000000000000000 : ℝ) =
            (52161371251878461 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (52161371251878461 / 40000000000000000 : ℝ) ≤
            (663656881242658237633 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1620631883151271 / 5000000000000000 : ℝ)) (q :=
      (52161371251878461 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_381_7 :
    Uω (aρ 7) (bρ 7) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(11999156513438851452341 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48195138904654069 / 160000000000000000 : ℝ) ≤
      (-(11999156513438851452341 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (48195138904654069 / 160000000000000000 : ℝ) =
            (48195138904654069 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48195138904654069 / 40000000000000000 : ℝ) ≤
            (1863787092561148547659 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2969146103659493 / 10000000000000000 : ℝ)) (q :=
      (48195138904654069 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_381_8 :
    Uω (aρ 8) (bρ 8) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(329425610719656756109 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8567992513762633 / 32000000000000000 : ℝ) ≤
      (-(329425610719656756109 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8567992513762633 / 32000000000000000 : ℝ) =
            (8567992513762633 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8567992513762633 / 8000000000000000 : ℝ) ≤
            (17147979430343243891 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (129164535650969 / 500000000000000 : ℝ)) (q :=
      (8567992513762633 / 32000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_381_9 :
    Uω (aρ 9) (bρ 9) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(15017384581172952189737 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35638815122779349 / 160000000000000000 : ℝ) ≤
      (-(15017384581172952189737 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (35638815122779349 / 160000000000000000 : ℝ) =
            (35638815122779349 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35638815122779349 / 20000000000000000 : ℝ) ≤
            (5777030827827047810263 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2024112910625153 / 10000000000000000 : ℝ)) (q :=
      (35638815122779349 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_381_10 :
    Uω (aρ 10) (bρ 10) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(18579977755783579673383 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24957541445636653 / 160000000000000000 : ℝ) ≤
      (-(18579977755783579673383 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (24957541445636653 / 160000000000000000 : ℝ) =
            (24957541445636653 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24957541445636653 / 20000000000000000 : ℝ) ≤
            (2214437653216420326617 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (269378183619329 / 2500000000000000 : ℝ)) (q :=
      (24957541445636653 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_381_11 :
    Uω (aρ 11) (bρ 11) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_381_12 :
    Uω (aρ 12) (bρ 12) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_381_13 :
    Uω (aρ 13) (bρ 13) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_381_14 :
    Uω (aρ 14) (bρ 14) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_381_15 :
    Uω (aρ 15) (bρ 15) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_381_16 :
    Uω (aρ 16) (bρ 16) (48362168994141 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_381 :
    Uρ (48362168994141 / 128000000000000 : ℝ) ≤
      (-(2778649192868835725683 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (48362168994141 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9905419477420379522699 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (48362168994141 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(997028911205224600551 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (48362168994141 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(10101574580285721318899 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (48362168994141 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10324358933471767397939 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (48362168994141 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2135155599578764903971 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (48362168994141 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2802079020257341762367 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (48362168994141 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(11999156513438851452341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (48362168994141 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(329425610719656756109 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (48362168994141 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(15017384581172952189737 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (48362168994141 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18579977755783579673383 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (48362168994141 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (48362168994141 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (48362168994141 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (48362168994141 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (48362168994141 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (48362168994141 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_381_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_382_1 :
    Uω (aρ 1) (bρ 1) (121114715361 / 320000000000 : ℝ) ≤
      (-(395512938531258084853 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3720294181274211 / 10000000000000000 : ℝ) ≤
      (-(395512938531258084853 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3720294181274211 / 10000000000000000 : ℝ) =
            (3720294181274211 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3720294181274211 / 2500000000000000 : ℝ) ≤
            (159004805708741915147 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (930062681400543 / 2500000000000000 : ℝ)) (q :=
      (3720294181274211 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_382_2 :
    Uω (aρ 2) (bρ 2) (121114715361 / 320000000000 : ℝ) ≤
      (-(398103100560546859391 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1478512639585287 / 4000000000000000 : ℝ) ≤
      (-(398103100560546859391 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1478512639585287 / 4000000000000000 : ℝ) =
            (1478512639585287 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1478512639585287 / 1000000000000000 : ℝ) ≤
            (156414643679453140609 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (739198914698037 / 2000000000000000 : ℝ)) (q :=
      (1478512639585287 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_382_3 :
    Uω (aρ 3) (bρ 3) (121114715361 / 320000000000 : ℝ) ≤
      (-(2520906383278679509249 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1824079285441027 / 5000000000000000 : ℝ) ≤
      (-(2520906383278679509249 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1824079285441027 / 5000000000000000 : ℝ) =
            (1824079285441027 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1824079285441027 / 1250000000000000 : ℝ) ≤
            (944829518221320490751 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1823572311838929 / 5000000000000000 : ℝ)) (q :=
      (1824079285441027 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_382_4 :
    Uω (aρ 4) (bρ 4) (121114715361 / 320000000000 : ℝ) ≤
      (-(25764989521341751801 / 25000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1783964850020739 / 5000000000000000 : ℝ) ≤
      (-(25764989521341751801 / 25000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1783964850020739 / 5000000000000000 : ℝ) =
            (1783964850020739 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1783964850020739 / 1250000000000000 : ℝ) ≤
            (8892369493658248199 / 25000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1782490531530853 / 5000000000000000 : ℝ)) (q :=
      (1783964850020739 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_382_5 :
    Uω (aρ 5) (bρ 5) (121114715361 / 320000000000 : ℝ) ≤
      (-(10656731664801098998343 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (430619841801571 / 1250000000000000 : ℝ) ≤
      (-(10656731664801098998343 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (430619841801571 / 1250000000000000 : ℝ) =
            (430619841801571 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (430619841801571 / 312500000000000 : ℝ) ≤
            (3206211941198901001657 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1718614525569443 / 5000000000000000 : ℝ)) (q :=
      (430619841801571 / 1250000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_382_6 :
    Uω (aρ 6) (bρ 6) (121114715361 / 320000000000 : ℝ) ≤
      (-(11188158091501860923951 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1633332004315943 / 5000000000000000 : ℝ) ≤
      (-(11188158091501860923951 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1633332004315943 / 5000000000000000 : ℝ) =
            (1633332004315943 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1633332004315943 / 1250000000000000 : ℝ) ≤
            (2674785514498139076049 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1623939987358761 / 5000000000000000 : ℝ)) (q :=
      (1633332004315943 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_382_7 :
    Uω (aρ 7) (bρ 7) (121114715361 / 320000000000 : ℝ) ≤
      (-(5988576774856659351441 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3018831202702193 / 10000000000000000 : ℝ) ≤
      (-(5988576774856659351441 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3018831202702193 / 10000000000000000 : ℝ) =
            (3018831202702193 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3018831202702193 / 2500000000000000 : ℝ) ≤
            (942895028143340648559 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (371984467952267 / 1250000000000000 : ℝ)) (q :=
      (3018831202702193 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_382_8 :
    Uω (aρ 8) (bρ 8) (121114715361 / 320000000000 : ℝ) ≤
      (-(13151740646229372841851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5368551905695767 / 20000000000000000 : ℝ) ≤
      (-(13151740646229372841851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5368551905695767 / 20000000000000000 : ℝ) =
            (5368551905695767 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5368551905695767 / 5000000000000000 : ℝ) ≤
            (711202959770627158149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2590306895249517 / 10000000000000000 : ℝ)) (q :=
      (5368551905695767 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_382_9 :
    Uω (aρ 9) (bρ 9) (121114715361 / 320000000000 : ℝ) ≤
      (-(14985134648602909743777 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4469241949103891 / 20000000000000000 : ℝ) ≤
      (-(14985134648602909743777 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4469241949103891 / 20000000000000000 : ℝ) =
            (4469241949103891 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4469241949103891 / 2500000000000000 : ℝ) ≤
            (5809280760397090256223 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2031962567017641 / 10000000000000000 : ℝ)) (q :=
      (4469241949103891 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_382_10 :
    Uω (aρ 10) (bρ 10) (121114715361 / 320000000000 : ℝ) ≤
      (-(72342282154980825373 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (3138578058074391 / 20000000000000000 : ℝ) ≤
      (-(72342282154980825373 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3138578058074391 / 20000000000000000 : ℝ) =
            (3138578058074391 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3138578058074391 / 2500000000000000 : ℝ) ≤
            (8885903036425424627 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1089857709483141 / 10000000000000000 : ℝ)) (q :=
      (3138578058074391 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_382_11 :
    Uω (aρ 11) (bρ 11) (121114715361 / 320000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_382_12 :
    Uω (aρ 12) (bρ 12) (121114715361 / 320000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_382_13 :
    Uω (aρ 13) (bρ 13) (121114715361 / 320000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_382_14 :
    Uω (aρ 14) (bρ 14) (121114715361 / 320000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_382_15 :
    Uω (aρ 15) (bρ 15) (121114715361 / 320000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_382_16 :
    Uω (aρ 16) (bρ 16) (121114715361 / 320000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_382 :
    Uρ (121114715361 / 320000000000 : ℝ) ≤
      (-(2775137250727846017459 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (121114715361 / 320000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(395512938531258084853 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (121114715361 / 320000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(398103100560546859391 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (121114715361 / 320000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2520906383278679509249 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (121114715361 / 320000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(25764989521341751801 / 25000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (121114715361 / 320000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10656731664801098998343 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (121114715361 / 320000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11188158091501860923951 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (121114715361 / 320000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5988576774856659351441 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (121114715361 / 320000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13151740646229372841851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (121114715361 / 320000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(14985134648602909743777 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (121114715361 / 320000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(72342282154980825373 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (121114715361 / 320000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (121114715361 / 320000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (121114715361 / 320000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (121114715361 / 320000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (121114715361 / 320000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (121114715361 / 320000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_382_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_383_1 :
    Uω (aρ 1) (bρ 1) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(38555696708818691983 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (11925870911684943 / 32000000000000000 : ℝ) ≤
      (-(38555696708818691983 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11925870911684943 / 32000000000000000 : ℝ) =
            (11925870911684943 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11925870911684943 / 8000000000000000 : ℝ) ≤
            (15596426752118808017 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (745358256098571 / 2000000000000000 : ℝ)) (q :=
      (11925870911684943 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_383_2 :
    Uω (aρ 2) (bρ 2) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(993489723544569558129 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (59245160133566219 / 160000000000000000 : ℝ) ≤
      (-(993489723544569558129 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (59245160133566219 / 160000000000000000 : ℝ) =
            (59245160133566219 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (59245160133566219 / 40000000000000000 : ℝ) ≤
            (392804637055430441871 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3702535989895543 / 10000000000000000 : ℝ)) (q :=
      (59245160133566219 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_383_3 :
    Uω (aρ 3) (bρ 3) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(2516427165727103197089 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58475212612729563 / 160000000000000000 : ℝ) ≤
      (-(2516427165727103197089 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58475212612729563 / 160000000000000000 : ℝ) =
            (58475212612729563 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58475212612729563 / 40000000000000000 : ℝ) ≤
            (949308735772896802911 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3653688656140961 / 10000000000000000 : ℝ)) (q :=
      (58475212612729563 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_383_4 :
    Uω (aρ 4) (bρ 4) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(10287666397815893786367 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57191608034129379 / 160000000000000000 : ℝ) ≤
      (-(10287666397815893786367 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57191608034129379 / 160000000000000000 : ℝ) =
            (57191608034129379 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57191608034129379 / 40000000000000000 : ℝ) ≤
            (3575277208184106213633 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1785766132440469 / 5000000000000000 : ℝ)) (q :=
      (57191608034129379 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_383_5 :
    Uω (aρ 5) (bρ 5) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(5318860850787325044227 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55224221070690603 / 160000000000000000 : ℝ) ≤
      (-(5318860850787325044227 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55224221070690603 / 160000000000000000 : ℝ) =
            (55224221070690603 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55224221070690603 / 40000000000000000 : ℝ) ≤
            (1612610952212674955773 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3443798813786091 / 10000000000000000 : ℝ)) (q :=
      (55224221070690603 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_383_6 :
    Uω (aρ 6) (bρ 6) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(11168041122814828369441 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (52371874572716323 / 160000000000000000 : ℝ) ≤
      (-(11168041122814828369441 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (52371874572716323 / 160000000000000000 : ℝ) =
            (52371874572716323 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (52371874572716323 / 40000000000000000 : ℝ) ≤
            (2694902483185171630559 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1627247938339653 / 5000000000000000 : ℝ)) (q :=
      (52371874572716323 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_383_7 :
    Uω (aρ 7) (bρ 7) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(11955200284190424110453 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48407452846251931 / 160000000000000000 : ℝ) ≤
      (-(11955200284190424110453 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (48407452846251931 / 160000000000000000 : ℝ) =
            (48407452846251931 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48407452846251931 / 40000000000000000 : ℝ) ≤
            (1907743321809575889547 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2982604541631257 / 10000000000000000 : ℝ)) (q :=
      (48407452846251931 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_383_8 :
    Uω (aρ 8) (bρ 8) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(3281631310863808718577 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43056848055855387 / 160000000000000000 : ℝ) ≤
      (-(3281631310863808718577 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (43056848055855387 / 160000000000000000 : ℝ) =
            (43056848055855387 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43056848055855387 / 40000000000000000 : ℝ) ≤
            (184104590636191281423 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2597320594171689 / 10000000000000000 : ℝ)) (q :=
      (43056848055855387 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_383_9 :
    Uω (aρ 9) (bρ 9) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(934563061726455595199 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35868982172610707 / 160000000000000000 : ℝ) ≤
      (-(934563061726455595199 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (35868982172610707 / 160000000000000000 : ℝ) =
            (35868982172610707 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35868982172610707 / 20000000000000000 : ℝ) ≤
            (365087901336044404801 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (254975373390763 / 1250000000000000 : ℝ)) (q :=
      (35868982172610707 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_383_10 :
    Uω (aρ 10) (bρ 10) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(9229973893465110443607 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25258911793304411 / 160000000000000000 : ℝ) ≤
      (-(9229973893465110443607 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (25258911793304411 / 160000000000000000 : ℝ) =
            (25258911793304411 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25258911793304411 / 20000000000000000 : ℝ) ≤
            (1167233811034889556393 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1102103223207817 / 10000000000000000 : ℝ)) (q :=
      (25258911793304411 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_383_11 :
    Uω (aρ 11) (bρ 11) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_383_12 :
    Uω (aρ 12) (bρ 12) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_383_13 :
    Uω (aρ 13) (bρ 13) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_383_14 :
    Uω (aρ 14) (bρ 14) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_383_15 :
    Uω (aρ 15) (bρ 15) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_383_16 :
    Uω (aρ 16) (bρ 16) (48529603294659 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_383 :
    Uρ (48529603294659 / 128000000000000 : ℝ) ≤
      (-(13858215987978432094499 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (48529603294659 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(38555696708818691983 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (48529603294659 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(993489723544569558129 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (48529603294659 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2516427165727103197089 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (48529603294659 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10287666397815893786367 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (48529603294659 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5318860850787325044227 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (48529603294659 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11168041122814828369441 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (48529603294659 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(11955200284190424110453 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (48529603294659 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3281631310863808718577 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (48529603294659 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(934563061726455595199 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (48529603294659 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(9229973893465110443607 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (48529603294659 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (48529603294659 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (48529603294659 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (48529603294659 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (48529603294659 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (48529603294659 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_383_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_384_1 :
    Uω (aρ 1) (bρ 1) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(9852724051552499823691 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29867001106093319 / 80000000000000000 : ℝ) ≤
      (-(9852724051552499823691 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (29867001106093319 / 80000000000000000 : ℝ) =
            (29867001106093319 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29867001106093319 / 20000000000000000 : ℝ) ≤
            (4010219554447500176309 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3733331834849111 / 10000000000000000 : ℝ)) (q :=
      (29867001106093319 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_384_2 :
    Uω (aρ 2) (bρ 2) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(9917248165762109789853 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29674907327554487 / 80000000000000000 : ℝ) ≤
      (-(9917248165762109789853 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (29674907327554487 / 80000000000000000 : ℝ) =
            (29674907327554487 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29674907327554487 / 20000000000000000 : ℝ) ≤
            (3945695440237890210147 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3709077402724403 / 10000000000000000 : ℝ)) (q :=
      (29674907327554487 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_384_3 :
    Uω (aρ 3) (bρ 3) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(5023911927221671117419 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1171597759750651 / 3200000000000000 : ℝ) ≤
      (-(5023911927221671117419 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1171597759750651 / 3200000000000000 : ℝ) =
            (1171597759750651 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1171597759750651 / 800000000000000 : ℝ) ≤
            (1907559875778328882581 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (73204653512547 / 200000000000000 : ℝ)) (q :=
      (1171597759750651 / 3200000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_384_4 :
    Uω (aρ 4) (bρ 4) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(10269370577536574744851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28648170275744011 / 80000000000000000 : ℝ) ≤
      (-(10269370577536574744851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28648170275744011 / 80000000000000000 : ℝ) =
            (28648170275744011 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28648170275744011 / 20000000000000000 : ℝ) ≤
            (3593573028463425255149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (111815107099587 / 312500000000000 : ℝ)) (q :=
      (28648170275744011 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_384_5 :
    Uω (aρ 5) (bρ 5) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(2654686992240856056823 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27664550749155799 / 80000000000000000 : ℝ) ≤
      (-(2654686992240856056823 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27664550749155799 / 80000000000000000 : ℝ) =
            (27664550749155799 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27664550749155799 / 20000000000000000 : ℝ) ≤
            (811048909259143943177 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3450368464874731 / 10000000000000000 : ℝ)) (q :=
      (27664550749155799 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_384_6 :
    Uω (aρ 6) (bρ 6) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(11147965006472399763539 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26238561285308971 / 80000000000000000 : ℝ) ≤
      (-(11147965006472399763539 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (26238561285308971 / 80000000000000000 : ℝ) =
            (26238561285308971 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26238561285308971 / 20000000000000000 : ℝ) ≤
            (2714978599527600236461 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (101909733564157 / 312500000000000 : ℝ)) (q :=
      (26238561285308971 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_384_7 :
    Uω (aρ 7) (bρ 7) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(5966648243356786807413 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4851359975918859 / 16000000000000000 : ℝ) ≤
      (-(5966648243356786807413 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4851359975918859 / 16000000000000000 : ℝ) =
            (4851359975918859 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4851359975918859 / 4000000000000000 : ℝ) ≤
            (964823559643213192587 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (597866500676871 / 2000000000000000 : ℝ)) (q :=
      (4851359975918859 / 16000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_384_8 :
    Uω (aρ 8) (bρ 8) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(1310137782768200082229 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21582630580093707 / 80000000000000000 : ℝ) ≤
      (-(1310137782768200082229 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21582630580093707 / 80000000000000000 : ℝ) =
            (21582630580093707 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21582630580093707 / 20000000000000000 : ℝ) ≤
            (76156577831799917771 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (325541478731151 / 1250000000000000 : ℝ)) (q :=
      (21582630580093707 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_384_9 :
    Uω (aρ 9) (bρ 9) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(14921006500376229850049 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17991977855449379 / 80000000000000000 : ℝ) ≤
      (-(14921006500376229850049 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17991977855449379 / 80000000000000000 : ℝ) =
            (17991977855449379 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17991977855449379 / 10000000000000000 : ℝ) ≤
            (5873408908623770149951 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1023817138524063 / 5000000000000000 : ℝ)) (q :=
      (17991977855449379 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_384_10 :
    Uω (aρ 10) (bρ 10) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(18400928188958520139997 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12704214832724787 / 80000000000000000 : ℝ) ≤
      (-(18400928188958520139997 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (12704214832724787 / 80000000000000000 : ℝ) =
            (12704214832724787 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12704214832724787 / 10000000000000000 : ℝ) ≤
            (2393487220041479860003 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (557126277430989 / 5000000000000000 : ℝ)) (q :=
      (12704214832724787 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_384_11 :
    Uω (aρ 11) (bρ 11) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_384_12 :
    Uω (aρ 12) (bρ 12) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_384_13 :
    Uω (aρ 13) (bρ 13) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_384_14 :
    Uω (aρ 14) (bρ 14) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_384_15 :
    Uω (aρ 15) (bρ 15) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_384_16 :
    Uω (aρ 16) (bρ 16) (24306660222459 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_384 :
    Uρ (24306660222459 / 64000000000000 : ℝ) ≤
      (-(3460208311846665330791 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (24306660222459 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9852724051552499823691 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (24306660222459 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(9917248165762109789853 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (24306660222459 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5023911927221671117419 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (24306660222459 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10269370577536574744851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (24306660222459 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2654686992240856056823 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (24306660222459 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11147965006472399763539 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (24306660222459 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5966648243356786807413 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (24306660222459 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1310137782768200082229 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (24306660222459 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(14921006500376229850049 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (24306660222459 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18400928188958520139997 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (24306660222459 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (24306660222459 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (24306660222459 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (24306660222459 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (24306660222459 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (24306660222459 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_384_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_385_1 :
    Uω (aρ 1) (bρ 1) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(9835220437739158478671 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (59838649861695569 / 160000000000000000 : ℝ) ≤
      (-(9835220437739158478671 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (59838649861695569 / 160000000000000000 : ℝ) =
            (59838649861695569 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (59838649861695569 / 40000000000000000 : ℝ) ≤
            (4027723168260841521329 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3739872388673743 / 10000000000000000 : ℝ)) (q :=
      (59838649861695569 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_385_2 :
    Uω (aρ 2) (bρ 2) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(4949815097480732821211 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11890893829638173 / 32000000000000000 : ℝ) ≤
      (-(4949815097480732821211 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11890893829638173 / 32000000000000000 : ℝ) =
            (11890893829638173 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11890893829638173 / 8000000000000000 : ℝ) ≤
            (1981656705519267178789 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (743123762399131 / 2000000000000000 : ℝ)) (q :=
      (11890893829638173 / 32000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_385_3 :
    Uω (aρ 3) (bρ 3) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(5014985496557094599463 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58684563259077641 / 160000000000000000 : ℝ) ≤
      (-(5014985496557094599463 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58684563259077641 / 160000000000000000 : ℝ) =
            (58684563259077641 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58684563259077641 / 40000000000000000 : ℝ) ≤
            (1916486306442905400537 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1833388341103251 / 5000000000000000 : ℝ)) (q :=
      (58684563259077641 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_385_4 :
    Uω (aρ 4) (bρ 4) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(5125554112303715040283 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57401072754472689 / 160000000000000000 : ℝ) ≤
      (-(5125554112303715040283 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57401072754472689 / 160000000000000000 : ℝ) =
            (57401072754472689 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57401072754472689 / 40000000000000000 : ℝ) ≤
            (1805917690696284959717 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3584634550195883 / 10000000000000000 : ℝ)) (q :=
      (57401072754472689 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_385_5 :
    Uω (aρ 5) (bρ 5) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(2119962065703611401969 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55433981038552289 / 160000000000000000 : ℝ) ≤
      (-(2119962065703611401969 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55433981038552289 / 160000000000000000 : ℝ) =
            (55433981038552289 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55433981038552289 / 40000000000000000 : ℝ) ≤
            (652626655496388598031 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3456938005040833 / 10000000000000000 : ℝ)) (q :=
      (55433981038552289 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_385_6 :
    Uω (aρ 6) (bρ 6) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(445117183001040530557 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10516473629322909 / 32000000000000000 : ℝ) ≤
      (-(445117183001040530557 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10516473629322909 / 32000000000000000 : ℝ) =
            (10516473629322909 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10516473629322909 / 8000000000000000 : ℝ) ≤
            (109400561238959469443 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (653545353737723 / 2000000000000000 : ℝ)) (q :=
      (10516473629322909 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_385_7 :
    Uω (aρ 7) (bρ 7) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(1488930241095184756289 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9723948005422973 / 32000000000000000 : ℝ) ≤
      (-(1488930241095184756289 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9723948005422973 / 32000000000000000 : ℝ) =
            (9723948005422973 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9723948005422973 / 8000000000000000 : ℝ) ≤
            (243937709654815243711 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (599211926902231 / 2000000000000000 : ℝ)) (q :=
      (9723948005422973 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_385_8 :
    Uω (aρ 8) (bρ 8) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(6538149004840853801523 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8654730943457773 / 32000000000000000 : ℝ) ≤
      (-(6538149004840853801523 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8654730943457773 / 32000000000000000 : ℝ) =
            (8654730943457773 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8654730943457773 / 8000000000000000 : ℝ) ≤
            (393322798159146198477 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (522268124424581 / 2000000000000000 : ℝ)) (q :=
      (8654730943457773 / 32000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_385_9 :
    Uω (aρ 9) (bρ 9) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(14889126104872971111557 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (36098857042559593 / 160000000000000000 : ℝ) ≤
      (-(14889126104872971111557 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (36098857042559593 / 160000000000000000 : ℝ) =
            (36098857042559593 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (36098857042559593 / 20000000000000000 : ℝ) ≤
            (5905289304127028888443 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1027728270570873 / 5000000000000000 : ℝ)) (q :=
      (36098857042559593 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_385_10 :
    Uω (aρ 10) (bρ 10) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(18342546204662378687801 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25557202981117793 / 160000000000000000 : ℝ) ≤
      (-(18342546204662378687801 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (25557202981117793 / 160000000000000000 : ℝ) =
            (25557202981117793 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25557202981117793 / 20000000000000000 : ℝ) ≤
            (2451869204337621312199 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1126308816956521 / 10000000000000000 : ℝ)) (q :=
      (25557202981117793 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_385_11 :
    Uω (aρ 11) (bρ 11) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_385_12 :
    Uω (aρ 12) (bρ 12) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_385_13 :
    Uω (aρ 13) (bρ 13) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_385_14 :
    Uω (aρ 14) (bρ 14) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_385_15 :
    Uω (aρ 15) (bρ 15) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_385_16 :
    Uω (aρ 16) (bρ 16) (48697037595177 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_385 :
    Uρ (48697037595177 / 128000000000000 : ℝ) ≤
      (-(13823536199399352962991 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (48697037595177 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9835220437739158478671 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (48697037595177 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4949815097480732821211 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (48697037595177 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(5014985496557094599463 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (48697037595177 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5125554112303715040283 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (48697037595177 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2119962065703611401969 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (48697037595177 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(445117183001040530557 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (48697037595177 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1488930241095184756289 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (48697037595177 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6538149004840853801523 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (48697037595177 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(14889126104872971111557 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (48697037595177 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18342546204662378687801 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (48697037595177 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (48697037595177 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (48697037595177 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (48697037595177 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (48697037595177 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (48697037595177 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_385_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_386_1 :
    Uω (aρ 1) (bρ 1) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(9817747408755780516049 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14985824376743447 / 40000000000000000 : ℝ) ≤
      (-(9817747408755780516049 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14985824376743447 / 40000000000000000 : ℝ) =
            (14985824376743447 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14985824376743447 / 10000000000000000 : ℝ) ≤
            (4045196197244219483951 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (29268851109137 / 78125000000000 : ℝ)) (q :=
      (14985824376743447 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_386_2 :
    Uω (aρ 2) (bρ 2) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(4941021606811480716549 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14889780903240487 / 40000000000000000 : ℝ) ≤
      (-(4941021606811480716549 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14889780903240487 / 40000000000000000 : ℝ) =
            (14889780903240487 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14889780903240487 / 10000000000000000 : ℝ) ≤
            (1990450196188519283451 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (465270027216007 / 1250000000000000 : ℝ)) (q :=
      (14889780903240487 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_386_3 :
    Uω (aρ 3) (bρ 3) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(625759372808085277601 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14697309606979173 / 40000000000000000 : ℝ) ≤
      (-(625759372808085277601 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14697309606979173 / 40000000000000000 : ℝ) =
            (14697309606979173 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14697309606979173 / 10000000000000000 : ℝ) ≤
            (240674602566914722399 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3673320675947399 / 10000000000000000 : ℝ)) (q :=
      (14697309606979173 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_386_4 :
    Uω (aρ 4) (bρ 4) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(10232879216613597053591 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2875290232240193 / 8000000000000000 : ℝ) ≤
      (-(10232879216613597053591 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2875290232240193 / 8000000000000000 : ℝ) =
            (2875290232240193 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2875290232240193 / 2000000000000000 : ℝ) ≤
            (3630064389386402946409 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (718237126824659 / 2000000000000000 : ℝ)) (q :=
      (2875290232240193 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_386_5 :
    Uω (aρ 5) (bρ 5) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(10580908642584709892287 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13884714924115549 / 40000000000000000 : ℝ) ≤
      (-(10580908642584709892287 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13884714924115549 / 40000000000000000 : ℝ) =
            (13884714924115549 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13884714924115549 / 10000000000000000 : ℝ) ≤
            (3282034963415290107713 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3463507434915587 / 10000000000000000 : ℝ)) (q :=
      (13884714924115549 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_386_6 :
    Uω (aρ 6) (bρ 6) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(11107934662065662635813 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13171902828846341 / 40000000000000000 : ℝ) ≤
      (-(11107934662065662635813 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13171902828846341 / 40000000000000000 : ℝ) =
            (13171902828846341 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13171902828846341 / 10000000000000000 : ℝ) ≤
            (2755008943934337364187 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3274341762420983 / 10000000000000000 : ℝ)) (q :=
      (13171902828846341 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_386_7 :
    Uω (aρ 7) (bρ 7) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(2377927276686470457359 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12181468423672783 / 40000000000000000 : ℝ) ≤
      (-(2377927276686470457359 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12181468423672783 / 40000000000000000 : ℝ) =
            (12181468423672783 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12181468423672783 / 10000000000000000 : ℝ) ≤
            (394661444513529542641 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (750696485148551 / 2500000000000000 : ℝ)) (q :=
      (12181468423672783 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_386_8 :
    Uω (aρ 8) (bρ 8) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(13051285403735799505811 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10845507221032959 / 40000000000000000 : ℝ) ≤
      (-(13051285403735799505811 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10845507221032959 / 40000000000000000 : ℝ) =
            (10845507221032959 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10845507221032959 / 10000000000000000 : ℝ) ≤
            (811658202264200494189 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (654586747653573 / 2500000000000000 : ℝ)) (q :=
      (10845507221032959 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_386_9 :
    Uω (aρ 9) (bρ 9) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(7428683367336118564909 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9053421747210509 / 40000000000000000 : ℝ) ≤
      (-(7428683367336118564909 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9053421747210509 / 40000000000000000 : ℝ) =
            (9053421747210509 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9053421747210509 / 5000000000000000 : ℝ) ≤
            (2968524337163881435091 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2063269882063067 / 10000000000000000 : ℝ)) (q :=
      (9053421747210509 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_386_10 :
    Uω (aρ 10) (bρ 10) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(18284783532368180351299 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6426313849671687 / 40000000000000000 : ℝ) ≤
      (-(18284783532368180351299 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6426313849671687 / 40000000000000000 : ℝ) =
            (6426313849671687 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6426313849671687 / 5000000000000000 : ℝ) ≤
            (2509631876631819648701 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (71142185424291 / 625000000000000 : ℝ)) (q :=
      (6426313849671687 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_386_11 :
    Uω (aρ 11) (bρ 11) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_386_12 :
    Uω (aρ 12) (bρ 12) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_386_13 :
    Uω (aρ 13) (bρ 13) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_386_14 :
    Uω (aρ 14) (bρ 14) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_386_15 :
    Uω (aρ 15) (bρ 15) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_386_16 :
    Uω (aρ 16) (bρ 16) (12195188686359 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_386 :
    Uρ (12195188686359 / 32000000000000 : ℝ) ≤
      (-(6903161546604532718271 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (12195188686359 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9817747408755780516049 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (12195188686359 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4941021606811480716549 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (12195188686359 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(625759372808085277601 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (12195188686359 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10232879216613597053591 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (12195188686359 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10580908642584709892287 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (12195188686359 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11107934662065662635813 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (12195188686359 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2377927276686470457359 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (12195188686359 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(13051285403735799505811 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (12195188686359 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7428683367336118564909 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (12195188686359 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18284783532368180351299 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (12195188686359 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (12195188686359 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (12195188686359 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (12195188686359 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (12195188686359 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (12195188686359 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_386_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_387_1 :
    Uω (aρ 1) (bρ 1) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(9800304857901901130603 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12009589029608683 / 32000000000000000 : ℝ) ≤
      (-(9800304857901901130603 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12009589029608683 / 32000000000000000 : ℝ) =
            (12009589029608683 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12009589029608683 / 8000000000000000 : ℝ) ≤
            (4062638748098098869397 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (750590698947851 / 2000000000000000 : ℝ)) (q :=
      (12009589029608683 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_387_2 :
    Uω (aρ 2) (bρ 2) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(4932243556451181186989 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (59663778049571223 / 160000000000000000 : ℝ) ≤
      (-(4932243556451181186989 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (59663778049571223 / 160000000000000000 : ℝ) =
            (59663778049571223 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (59663778049571223 / 40000000000000000 : ℝ) ≤
            (1999228246548818813011 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3728701619940231 / 10000000000000000 : ℝ)) (q :=
      (59663778049571223 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_387_3 :
    Uω (aρ 3) (bρ 3) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(499718032825331389293 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58893913494597647 / 160000000000000000 : ℝ) ≤
      (-(499718032825331389293 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58893913494597647 / 160000000000000000 : ℝ) =
            (58893913494597647 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58893913494597647 / 40000000000000000 : ℝ) ≤
            (193429147474668610707 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1839932328459267 / 5000000000000000 : ℝ)) (q :=
      (58893913494597647 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_387_4 :
    Uω (aρ 4) (bρ 4) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(10214683431811717131443 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57610536224189447 / 160000000000000000 : ℝ) ≤
      (-(10214683431811717131443 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (57610536224189447 / 160000000000000000 : ℝ) =
            (57610536224189447 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57610536224189447 / 40000000000000000 : ℝ) ≤
            (3648260174188282868557 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3597736679182509 / 10000000000000000 : ℝ)) (q :=
      (57610536224189447 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_387_5 :
    Uω (aρ 5) (bρ 5) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(10562042774298962654907 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55643737477052503 / 160000000000000000 : ℝ) ≤
      (-(10562042774298962654907 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55643737477052503 / 160000000000000000 : ℝ) =
            (55643737477052503 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55643737477052503 / 40000000000000000 : ℝ) ≤
            (3300900831701037345093 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3470076755125391 / 10000000000000000 : ℝ)) (q :=
      (55643737477052503 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_387_6 :
    Uω (aρ 6) (bρ 6) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(11087980102211234289417 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (52792852091490599 / 160000000000000000 : ℝ) ≤
      (-(11087980102211234289417 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (52792852091490599 / 160000000000000000 : ℝ) =
            (52792852091490599 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (52792852091490599 / 40000000000000000 : ℝ) ≤
            (2774963503788765710583 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3280956457070153 / 10000000000000000 : ℝ)) (q :=
      (52792852091490599 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_387_7 :
    Uω (aρ 7) (bρ 7) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(11867879625428304621113 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48832000806173063 / 160000000000000000 : ℝ) ≤
      (-(11867879625428304621113 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (48832000806173063 / 160000000000000000 : ℝ) =
            (48832000806173063 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48832000806173063 / 40000000000000000 : ℝ) ≤
            (1995063980571695378887 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3009511427165461 / 10000000000000000 : ℝ)) (q :=
      (48832000806173063 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_387_8 :
    Uω (aρ 8) (bρ 8) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(3256584906897836630917 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1739615352638351 / 6400000000000000 : ℝ) ≤
      (-(3256584906897836630917 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1739615352638351 / 6400000000000000 : ℝ) =
            (1739615352638351 / 1600000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1739615352638351 / 1600000000000000 : ℝ) ≤
            (209150994602163369083 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (105014038189147 / 400000000000000 : ℝ)) (q :=
      (1739615352638351 / 6400000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_387_9 :
    Uω (aρ 9) (bρ 9) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(593029093542680300733 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7265689271534427 / 32000000000000000 : ℝ) ≤
      (-(593029093542680300733 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7265689271534427 / 32000000000000000 : ℝ) =
            (7265689271534427 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7265689271534427 / 4000000000000000 : ℝ) ≤
            (238747522817319699267 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (414214880160569 / 2000000000000000 : ℝ)) (q :=
      (7265689271534427 / 32000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_387_10 :
    Uω (aρ 10) (bρ 10) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(18227622739612179984223 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25852609418760503 / 160000000000000000 : ℝ) ≤
      (-(18227622739612179984223 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (25852609418760503 / 160000000000000000 : ℝ) =
            (25852609418760503 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25852609418760503 / 20000000000000000 : ℝ) ≤
            (2566792669387820015777 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1150153816933891 / 10000000000000000 : ℝ)) (q :=
      (25852609418760503 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_387_11 :
    Uω (aρ 11) (bρ 11) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_387_12 :
    Uω (aρ 12) (bρ 12) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_387_13 :
    Uω (aρ 13) (bρ 13) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_387_14 :
    Uω (aρ 14) (bρ 14) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_387_15 :
    Uω (aρ 15) (bρ 15) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_387_16 :
    Uω (aρ 16) (bρ 16) (9772894379139 / 25600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_387 :
    Uρ (9772894379139 / 25600000000000 : ℝ) ≤
      (-(13789192254313298509481 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (9772894379139 / 25600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9800304857901901130603 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (9772894379139 / 25600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4932243556451181186989 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (9772894379139 / 25600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(499718032825331389293 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (9772894379139 / 25600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(10214683431811717131443 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (9772894379139 / 25600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(10562042774298962654907 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (9772894379139 / 25600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(11087980102211234289417 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (9772894379139 / 25600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(11867879625428304621113 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (9772894379139 / 25600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3256584906897836630917 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (9772894379139 / 25600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(593029093542680300733 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (9772894379139 / 25600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(18227622739612179984223 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (9772894379139 / 25600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (9772894379139 / 25600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (9772894379139 / 25600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (9772894379139 / 25600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (9772894379139 / 25600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (9772894379139 / 25600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_387_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
