/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U33) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_400_1 :
    Uω (aρ 1) (bρ 1) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(9274145591088656349597 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15823005011909681 / 40000000000000000 : ℝ) ≤
      (-(9274145591088656349597 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15823005011909681 / 40000000000000000 : ℝ) =
            (15823005011909681 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15823005011909681 / 10000000000000000 : ℝ) ≤
            (4588798014911343650403 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3955710383905153 / 10000000000000000 : ℝ)) (q :=
      (15823005011909681 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_400_2 :
    Uω (aρ 2) (bρ 2) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(145859318811119573189 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15727013095788583 / 40000000000000000 : ℝ) ≤
      (-(145859318811119573189 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15727013095788583 / 40000000000000000 : ℝ) =
            (15727013095788583 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15727013095788583 / 10000000000000000 : ℝ) ≤
            (70749175032630426811 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (982870859588651 / 2500000000000000 : ℝ)) (q :=
      (15727013095788583 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_400_3 :
    Uω (aρ 3) (bρ 3) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(9458033394948477753999 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (621387927094633 / 1600000000000000 : ℝ) ≤
      (-(9458033394948477753999 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (621387927094633 / 1600000000000000 : ℝ) =
            (621387927094633 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (621387927094633 / 400000000000000 : ℝ) ≤
            (4404910211051522246001 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (155308883419729 / 400000000000000 : ℝ)) (q :=
      (621387927094633 / 1600000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_400_4 :
    Uω (aρ 4) (bρ 4) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(4833229095758892645243 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15214267432021373 / 40000000000000000 : ℝ) ≤
      (-(4833229095758892645243 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15214267432021373 / 40000000000000000 : ℝ) =
            (15214267432021373 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15214267432021373 / 10000000000000000 : ℝ) ≤
            (2098242707241107354757 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3800800893885999 / 10000000000000000 : ℝ)) (q :=
      (15214267432021373 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_400_5 :
    Uω (aρ 5) (bρ 5) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(9994254414217391606101 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14723634800085159 / 40000000000000000 : ℝ) ≤
      (-(9994254414217391606101 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14723634800085159 / 40000000000000000 : ℝ) =
            (14723634800085159 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14723634800085159 / 10000000000000000 : ℝ) ≤
            (3868689191782608393899 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (918418624313223 / 2500000000000000 : ℝ)) (q :=
      (14723634800085159 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_400_6 :
    Uω (aρ 6) (bρ 6) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(10488546692852194258217 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14013550919603397 / 40000000000000000 : ℝ) ≤
      (-(10488546692852194258217 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14013550919603397 / 40000000000000000 : ℝ) =
            (14013550919603397 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14013550919603397 / 10000000000000000 : ℝ) ≤
            (3374396913147805741783 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3485872932152011 / 10000000000000000 : ℝ)) (q :=
      (14013550919603397 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_400_7 :
    Uω (aρ 7) (bρ 7) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(2804114770301443257797 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13029728383838411 / 40000000000000000 : ℝ) ≤
      (-(2804114770301443257797 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13029728383838411 / 40000000000000000 : ℝ) =
            (13029728383838411 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13029728383838411 / 10000000000000000 : ℝ) ≤
            (661621131198556742203 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1608811522514759 / 5000000000000000 : ℝ)) (q :=
      (13029728383838411 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_400_8 :
    Uω (aρ 8) (bρ 8) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(12284230347491191553647 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11710155055891933 / 40000000000000000 : ℝ) ≤
      (-(12284230347491191553647 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11710155055891933 / 40000000000000000 : ℝ) =
            (11710155055891933 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11710155055891933 / 10000000000000000 : ℝ) ≤
            (1578713258508808446353 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2841378032396279 / 10000000000000000 : ℝ)) (q :=
      (11710155055891933 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_400_9 :
    Uω (aρ 9) (bρ 9) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(6949648283068307006159 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9963713034161937 / 40000000000000000 : ℝ) ≤
      (-(6949648283068307006159 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9963713034161937 / 40000000000000000 : ℝ) =
            (9963713034161937 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9963713034161937 / 5000000000000000 : ℝ) ≤
            (3447559421431692993841 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2309122649891281 / 10000000000000000 : ℝ)) (q :=
      (9963713034161937 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_400_10 :
    Uω (aρ 10) (bρ 10) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(16686293334959350296841 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7540210654092581 / 40000000000000000 : ℝ) ≤
      (-(16686293334959350296841 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7540210654092581 / 40000000000000000 : ℝ) =
            (7540210654092581 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7540210654092581 / 5000000000000000 : ℝ) ≤
            (4108122074040649703159 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1485930493351603 / 10000000000000000 : ℝ)) (q :=
      (7540210654092581 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_400_11 :
    Uω (aρ 11) (bρ 11) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_400_12 :
    Uω (aρ 12) (bρ 12) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_400_13 :
    Uω (aρ 13) (bρ 13) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_400_14 :
    Uω (aρ 14) (bρ 14) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_400_15 :
    Uω (aρ 15) (bρ 15) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_400_16 :
    Uω (aρ 16) (bρ 16) (12864925888431 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_400 :
    Uρ (12864925888431 / 32000000000000 : ℝ) ≤
      (-(6646107995395590288459 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (12864925888431 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9274145591088656349597 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (12864925888431 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(145859318811119573189 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (12864925888431 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(9458033394948477753999 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (12864925888431 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4833229095758892645243 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (12864925888431 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9994254414217391606101 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (12864925888431 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(10488546692852194258217 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (12864925888431 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2804114770301443257797 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (12864925888431 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(12284230347491191553647 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (12864925888431 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(6949648283068307006159 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (12864925888431 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(16686293334959350296841 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (12864925888431 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (12864925888431 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (12864925888431 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (12864925888431 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (12864925888431 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (12864925888431 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_400_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_401_1 :
    Uω (aρ 1) (bρ 1) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(2302056756254861910491 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (995478282737609 / 2500000000000000 : ℝ) ≤
      (-(2302056756254861910491 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (995478282737609 / 2500000000000000 : ℝ) =
            (995478282737609 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (995478282737609 / 625000000000000 : ℝ) ≤
            (1163679145245138089509 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3981872530395247 / 10000000000000000 : ℝ)) (q :=
      (995478282737609 / 2500000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_401_2 :
    Uω (aρ 2) (bρ 2) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(1853734599609437634619 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1978958333561489 / 5000000000000000 : ℝ) ≤
      (-(1853734599609437634619 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1978958333561489 / 5000000000000000 : ℝ) =
            (1978958333561489 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1978958333561489 / 1250000000000000 : ℝ) ≤
            (918854121590562365381 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3957648615250331 / 10000000000000000 : ℝ)) (q :=
      (1978958333561489 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_401_3 :
    Uω (aρ 3) (bρ 3) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(4695439966694920649199 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3909842528460269 / 10000000000000000 : ℝ) ≤
      (-(4695439966694920649199 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3909842528460269 / 10000000000000000 : ℝ) =
            (3909842528460269 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3909842528460269 / 2500000000000000 : ℝ) ≤
            (2236031836305079350801 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3908896444274913 / 10000000000000000 : ℝ)) (q :=
      (3909842528460269 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_401_4 :
    Uω (aρ 4) (bρ 4) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(9597862507636789230839 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (306379790068437 / 800000000000000 : ℝ) ≤
      (-(9597862507636789230839 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (306379790068437 / 800000000000000 : ℝ) =
            (306379790068437 / 200000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (306379790068437 / 200000000000000 : ℝ) ≤
            (4265081098363210769161 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (38270003201303 / 100000000000000 : ℝ)) (q :=
      (306379790068437 / 800000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_401_5 :
    Uω (aρ 5) (bρ 5) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(1240411754096010472283 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3707121461951423 / 10000000000000000 : ℝ) ≤
      (-(1240411754096010472283 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3707121461951423 / 10000000000000000 : ℝ) =
            (3707121461951423 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3707121461951423 / 2500000000000000 : ℝ) ≤
            (492456196653989527717 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3699938411657221 / 10000000000000000 : ℝ)) (q :=
      (3707121461951423 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_401_6 :
    Uω (aρ 6) (bρ 6) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(1301722415710541881821 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1411871921821389 / 4000000000000000 : ℝ) ≤
      (-(1301722415710541881821 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1411871921821389 / 4000000000000000 : ℝ) =
            (1411871921821389 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1411871921821389 / 1000000000000000 : ℝ) ≤
            (431145535039458118179 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (87807386800033 / 250000000000000 : ℝ)) (q :=
      (1411871921821389 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_401_7 :
    Uω (aρ 7) (bρ 7) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(5567744317910864751661 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (410489342450739 / 1250000000000000 : ℝ) ≤
      (-(5567744317910864751661 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (410489342450739 / 1250000000000000 : ℝ) =
            (410489342450739 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (410489342450739 / 312500000000000 : ℝ) ≤
            (1363727485089135248339 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3244426722866199 / 10000000000000000 : ℝ)) (q :=
      (410489342450739 / 1250000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_401_8 :
    Uω (aρ 8) (bρ 8) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(12192603200744992393569 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2954486233823141 / 10000000000000000 : ℝ) ≤
      (-(12192603200744992393569 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2954486233823141 / 10000000000000000 : ℝ) =
            (2954486233823141 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2954486233823141 / 2500000000000000 : ℝ) ≤
            (1670340405255007606431 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2869111362640657 / 10000000000000000 : ℝ)) (q :=
      (2954486233823141 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_401_9 :
    Uω (aρ 9) (bρ 9) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(13786735457843431653397 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (629781204456927 / 2500000000000000 : ℝ) ≤
      (-(13786735457843431653397 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (629781204456927 / 2500000000000000 : ℝ) =
            (629781204456927 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (629781204456927 / 625000000000000 : ℝ) ≤
            (76208148156568346603 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2339354159009791 / 10000000000000000 : ℝ)) (q :=
      (629781204456927 / 2500000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_401_10 :
    Uω (aρ 10) (bρ 10) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(16512559890281452104139 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (767235389239469 / 4000000000000000 : ℝ) ≤
      (-(16512559890281452104139 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (767235389239469 / 4000000000000000 : ℝ) =
            (767235389239469 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (767235389239469 / 500000000000000 : ℝ) ≤
            (4281855518718547895861 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4768251572021 / 31250000000000 : ℝ)) (q :=
      (767235389239469 / 4000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_401_11 :
    Uω (aρ 11) (bρ 11) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_401_12 :
    Uω (aρ 12) (bρ 12) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_401_13 :
    Uω (aρ 13) (bρ 13) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_401_14 :
    Uω (aρ 14) (bρ 14) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_401_15 :
    Uω (aρ 15) (bρ 15) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_401_16 :
    Uω (aρ 16) (bρ 16) (1294864303869 / 3200000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_401 :
    Uρ (1294864303869 / 3200000000000 : ℝ) ≤
      (-(13232137085469873442083 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1294864303869 / 3200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2302056756254861910491 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1294864303869 / 3200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1853734599609437634619 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1294864303869 / 3200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4695439966694920649199 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1294864303869 / 3200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9597862507636789230839 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1294864303869 / 3200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1240411754096010472283 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1294864303869 / 3200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1301722415710541881821 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1294864303869 / 3200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5567744317910864751661 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1294864303869 / 3200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(12192603200744992393569 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1294864303869 / 3200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(13786735457843431653397 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1294864303869 / 3200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(16512559890281452104139 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1294864303869 / 3200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1294864303869 / 3200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1294864303869 / 3200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1294864303869 / 3200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1294864303869 / 3200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1294864303869 / 3200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_401_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_402_1 :
    Uω (aρ 1) (bρ 1) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(2285685037350096200439 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16032300021672153 / 40000000000000000 : ℝ) ≤
      (-(2285685037350096200439 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (16032300021672153 / 40000000000000000 : ℝ) =
            (16032300021672153 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16032300021672153 / 10000000000000000 : ℝ) ≤
            (1180050864149903799561 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2004017334937257 / 5000000000000000 : ℝ)) (q :=
      (16032300021672153 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_402_2 :
    Uω (aρ 2) (bρ 2) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(4601393316889063213119 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3187264029495937 / 8000000000000000 : ℝ) ≤
      (-(4601393316889063213119 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3187264029495937 / 8000000000000000 : ℝ) =
            (3187264029495937 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3187264029495937 / 2000000000000000 : ℝ) ≤
            (2330078486110936786881 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (99595343632207 / 250000000000000 : ℝ)) (q :=
      (3187264029495937 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_402_3 :
    Uω (aρ 3) (bρ 3) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(4662087319745159335967 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15744041711187323 / 40000000000000000 : ℝ) ≤
      (-(4662087319745159335967 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15744041711187323 / 40000000000000000 : ℝ) =
            (15744041711187323 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15744041711187323 / 10000000000000000 : ℝ) ≤
            (2269384483254840664033 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3935070633492099 / 10000000000000000 : ℝ)) (q :=
      (15744041711187323 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_402_4 :
    Uω (aρ 4) (bρ 4) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(1191216852877995912977 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15423710547039463 / 40000000000000000 : ℝ) ≤
      (-(1191216852877995912977 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15423710547039463 / 40000000000000000 : ℝ) =
            (15423710547039463 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15423710547039463 / 10000000000000000 : ℝ) ≤
            (541651097872004087023 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3853199232483169 / 10000000000000000 : ℝ)) (q :=
      (15423710547039463 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_402_5 :
    Uω (aρ 5) (bρ 5) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(9852835570745593329249 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14933334016782087 / 40000000000000000 : ℝ) ≤
      (-(9852835570745593329249 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14933334016782087 / 40000000000000000 : ℝ) =
            (14933334016782087 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14933334016782087 / 10000000000000000 : ℝ) ≤
            (4010108035254406670751 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3726200886689481 / 10000000000000000 : ℝ)) (q :=
      (14933334016782087 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_402_6 :
    Uω (aρ 6) (bρ 6) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(10339572280256983547971 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14223879762145861 / 40000000000000000 : ℝ) ≤
      (-(10339572280256983547971 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14223879762145861 / 40000000000000000 : ℝ) =
            (14223879762145861 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14223879762145861 / 10000000000000000 : ℝ) ≤
            (3523371325743016452029 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (442339266813921 / 1250000000000000 : ℝ)) (q :=
      (14223879762145861 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_402_7 :
    Uω (aρ 7) (bρ 7) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(690949015699183907021 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13241568741205117 / 40000000000000000 : ℝ) ≤
      (-(690949015699183907021 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13241568741205117 / 40000000000000000 : ℝ) =
            (13241568741205117 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13241568741205117 / 10000000000000000 : ℝ) ≤
            (175484959675816092979 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (817805001200249 / 2500000000000000 : ℝ)) (q :=
      (13241568741205117 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_402_8 :
    Uω (aρ 8) (bρ 8) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(12101857029900682044303 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11925676331596149 / 40000000000000000 : ℝ) ≤
      (-(12101857029900682044303 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11925676331596149 / 40000000000000000 : ℝ) =
            (11925676331596149 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11925676331596149 / 10000000000000000 : ℝ) ≤
            (1761086576099317955697 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (45262741427133 / 156250000000000 : ℝ)) (q :=
      (11925676331596149 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_402_9 :
    Uω (aρ 9) (bρ 9) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(6837808690690216867231 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10189091787651641 / 40000000000000000 : ℝ) ≤
      (-(6837808690690216867231 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10189091787651641 / 40000000000000000 : ℝ) =
            (10189091787651641 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10189091787651641 / 10000000000000000 : ℝ) ≤
            (93663112309783132769 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1184744403862129 / 5000000000000000 : ℝ)) (q :=
      (10189091787651641 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_402_10 :
    Uω (aρ 10) (bρ 10) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(2042910051658331651807 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7803336604278519 / 40000000000000000 : ℝ) ≤
      (-(2042910051658331651807 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (7803336604278519 / 40000000000000000 : ℝ) =
            (7803336604278519 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7803336604278519 / 5000000000000000 : ℝ) ≤
            (556391874466668348193 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1565170249532697 / 10000000000000000 : ℝ)) (q :=
      (7803336604278519 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_402_11 :
    Uω (aρ 11) (bρ 11) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_402_12 :
    Uω (aρ 12) (bρ 12) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_402_13 :
    Uω (aρ 13) (bρ 13) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_402_14 :
    Uω (aρ 14) (bρ 14) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_402_15 :
    Uω (aρ 15) (bρ 15) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_402_16 :
    Uω (aρ 16) (bρ 16) (13032360188949 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_402 :
    Uρ (13032360188949 / 32000000000000 : ℝ) ≤
      (-(13172843436669313561171 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (13032360188949 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2285685037350096200439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (13032360188949 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4601393316889063213119 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (13032360188949 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4662087319745159335967 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (13032360188949 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1191216852877995912977 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (13032360188949 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9852835570745593329249 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (13032360188949 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(10339572280256983547971 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (13032360188949 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(690949015699183907021 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (13032360188949 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(12101857029900682044303 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (13032360188949 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(6837808690690216867231 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (13032360188949 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2042910051658331651807 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (13032360188949 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (13032360188949 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (13032360188949 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (13032360188949 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (13032360188949 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (13032360188949 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_402_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_403_1 :
    Uω (aρ 1) (bρ 1) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(9077679346739136303621 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8068473752896849 / 20000000000000000 : ℝ) ≤
      (-(9077679346739136303621 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8068473752896849 / 20000000000000000 : ℝ) =
            (8068473752896849 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8068473752896849 / 5000000000000000 : ℝ) ≤
            (4785264259260863696379 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4034196802479349 / 10000000000000000 : ℝ)) (q :=
      (8068473752896849 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_403_2 :
    Uω (aρ 2) (bρ 2) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(2284332897053214077443 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8020486767293193 / 20000000000000000 : ℝ) ≤
      (-(2284332897053214077443 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8020486767293193 / 20000000000000000 : ℝ) =
            (8020486767293193 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8020486767293193 / 5000000000000000 : ℝ) ≤
            (1181403004446785922557 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4009978829385693 / 10000000000000000 : ℝ)) (q :=
      (8020486767293193 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_403_3 :
    Uω (aρ 3) (bρ 3) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(4628955784060132778483 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7924356488063509 / 20000000000000000 : ℝ) ≤
      (-(4628955784060132778483 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7924356488063509 / 20000000000000000 : ℝ) =
            (7924356488063509 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7924356488063509 / 5000000000000000 : ℝ) ≤
            (2302516018939867221517 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3961244656506009 / 10000000000000000 : ℝ)) (q :=
      (7924356488063509 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_403_4 :
    Uω (aρ 4) (bρ 4) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(9462068786104314284357 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1941053822962141 / 5000000000000000 : ℝ) ≤
      (-(9462068786104314284357 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1941053822962141 / 5000000000000000 : ℝ) =
            (1941053822962141 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1941053822962141 / 1250000000000000 : ℝ) ≤
            (4400874819895685715643 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (121231176292377 / 312500000000000 : ℝ)) (q :=
      (1941053822962141 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_403_5 :
    Uω (aρ 5) (bρ 5) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(4891435975477487785923 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7519089683728511 / 20000000000000000 : ℝ) ≤
      (-(4891435975477487785923 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7519089683728511 / 20000000000000000 : ℝ) =
            (7519089683728511 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7519089683728511 / 5000000000000000 : ℝ) ≤
            (2040035827522512214077 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3752461952571011 / 10000000000000000 : ℝ)) (q :=
      (7519089683728511 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_403_6 :
    Uω (aρ 6) (bρ 6) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(10265917141164475357851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1432903272379271 / 4000000000000000 : ℝ) ≤
      (-(10265917141164475357851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1432903272379271 / 4000000000000000 : ℝ) =
            (1432903272379271 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1432903272379271 / 1000000000000000 : ℝ) ≤
            (3597026464835524642149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (713025801175771 / 2000000000000000 : ℝ)) (q :=
      (1432903272379271 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_403_7 :
    Uω (aρ 7) (bρ 7) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(1371941851203687294137 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3336864559731609 / 10000000000000000 : ℝ) ≤
      (-(1371941851203687294137 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3336864559731609 / 10000000000000000 : ℝ) =
            (3336864559731609 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3336864559731609 / 2500000000000000 : ℝ) ≤
            (360926099546312705863 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1649001572102859 / 5000000000000000 : ℝ)) (q :=
      (3336864559731609 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_403_8 :
    Uω (aρ 8) (bρ 8) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(12011974165207489099981 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6016675453428553 / 20000000000000000 : ℝ) ≤
      (-(12011974165207489099981 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6016675453428553 / 20000000000000000 : ℝ) =
            (6016675453428553 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6016675453428553 / 5000000000000000 : ℝ) ≤
            (1850969440792510900019 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2924491129511053 / 10000000000000000 : ℝ)) (q :=
      (6016675453428553 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_403_9 :
    Uω (aρ 9) (bρ 9) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(1695737679398358110773 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (103014978817541 / 400000000000000 : ℝ) ≤
      (-(1695737679398358110773 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (103014978817541 / 400000000000000 : ℝ) =
            (103014978817541 / 100000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (103014978817541 / 100000000000000 : ℝ) ≤
            (37130271351641889227 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (47990604906391 / 200000000000000 : ℝ)) (q :=
      (103014978817541 / 400000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_403_10 :
    Uω (aρ 10) (bρ 10) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(647126960665450513509 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3966622080239831 / 20000000000000000 : ℝ) ≤
      (-(647126960665450513509 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3966622080239831 / 20000000000000000 : ℝ) =
            (3966622080239831 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3966622080239831 / 2500000000000000 : ℝ) ≤
            (184649655694549486491 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1603962418177331 / 10000000000000000 : ℝ)) (q :=
      (3966622080239831 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_403_11 :
    Uω (aρ 11) (bρ 11) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_403_12 :
    Uω (aρ 12) (bρ 12) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_403_13 :
    Uω (aρ 13) (bρ 13) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_403_14 :
    Uω (aρ 14) (bρ 14) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_403_15 :
    Uω (aρ 15) (bρ 15) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_403_16 :
    Uω (aρ 16) (bρ 16) (1639509667401 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_403 :
    Uρ (1639509667401 / 4000000000000 : ℝ) ≤
      (-(3278575728550199324133 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1639509667401 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(9077679346739136303621 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1639509667401 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2284332897053214077443 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1639509667401 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4628955784060132778483 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1639509667401 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9462068786104314284357 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1639509667401 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4891435975477487785923 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1639509667401 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(10265917141164475357851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1639509667401 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1371941851203687294137 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1639509667401 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(12011974165207489099981 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1639509667401 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1695737679398358110773 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1639509667401 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(647126960665450513509 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1639509667401 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1639509667401 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1639509667401 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1639509667401 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1639509667401 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1639509667401 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_403_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_404_1 :
    Uω (aρ 1) (bρ 1) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(8948814032234249353119 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8173121216923227 / 20000000000000000 : ℝ) ≤
      (-(8948814032234249353119 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8173121216923227 / 20000000000000000 : ℝ) =
            (8173121216923227 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8173121216923227 / 5000000000000000 : ℝ) ≤
            (4914129573765750646881 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1021630261898463 / 2500000000000000 : ℝ)) (q :=
      (8173121216923227 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_404_2 :
    Uω (aρ 2) (bρ 2) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(1125961639650166118421 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (126955312814517 / 312500000000000 : ℝ) ≤
      (-(1125961639650166118421 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (126955312814517 / 312500000000000 : ℝ) = (126955312814517 / 78125000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (126955312814517 / 78125000000000 : ℝ) ≤
            (606906311099833881579 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4062308863309713 / 10000000000000000 : ℝ)) (q :=
      (126955312814517 / 312500000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_404_3 :
    Uω (aρ 3) (bρ 3) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(456334444861630339123 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1003628408424973 / 2500000000000000 : ℝ) ≤
      (-(456334444861630339123 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1003628408424973 / 2500000000000000 : ℝ) =
            (1003628408424973 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1003628408424973 / 625000000000000 : ℝ) ≤
            (236812735438369660877 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4013592216930409 / 10000000000000000 : ℝ)) (q :=
      (1003628408424973 / 2500000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_404_4 :
    Uω (aρ 4) (bρ 4) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(9328096888636753907783 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (78689338583237 / 200000000000000 : ℝ) ≤
      (-(9328096888636753907783 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (78689338583237 / 200000000000000 : ℝ) = (78689338583237 / 50000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (78689338583237 / 50000000000000 : ℝ) ≤
            (4534846717363246092217 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (157271719556773 / 400000000000000 : ℝ)) (q :=
      (78689338583237 / 200000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_404_5 :
    Uω (aρ 5) (bρ 5) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(2411100417759986548877 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1905982730914291 / 5000000000000000 : ℝ) ≤
      (-(2411100417759986548877 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1905982730914291 / 5000000000000000 : ℝ) =
            (1905982730914291 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1905982730914291 / 1250000000000000 : ℝ) ≤
            (1054635483740013451123 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3804979973587789 / 10000000000000000 : ℝ)) (q :=
      (1905982730914291 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_404_6 :
    Uω (aρ 6) (bρ 6) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(5060114932047977894949 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7269658282256159 / 20000000000000000 : ℝ) ≤
      (-(5060114932047977894949 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7269658282256159 / 20000000000000000 : ℝ) =
            (7269658282256159 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7269658282256159 / 5000000000000000 : ℝ) ≤
            (1871356870952022105051 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (56530432926981 / 156250000000000 : ℝ)) (q :=
      (7269658282256159 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_404_7 :
    Uω (aρ 7) (bρ 7) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(10818157684744796127839 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (423724322632849 / 1250000000000000 : ℝ) ≤
      (-(10818157684744796127839 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (423724322632849 / 1250000000000000 : ℝ) =
            (423724322632849 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (423724322632849 / 312500000000000 : ℝ) ≤
            (3044785921255203872161 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3351539967956209 / 10000000000000000 : ℝ)) (q :=
      (423724322632849 / 1250000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_404_8 :
    Uω (aρ 8) (bρ 8) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(5917365200118181528387 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3062133981399583 / 10000000000000000 : ℝ) ≤
      (-(5917365200118181528387 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3062133981399583 / 10000000000000000 : ℝ) =
            (3062133981399583 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3062133981399583 / 2500000000000000 : ℝ) ≤
            (1014106602881818471613 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2979760419969791 / 10000000000000000 : ℝ)) (q :=
      (3062133981399583 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_404_9 :
    Uω (aρ 9) (bρ 9) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(3337630368056965153349 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13157222635451 / 50000000000000 : ℝ) ≤
      (-(3337630368056965153349 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13157222635451 / 50000000000000 : ℝ) = (13157222635451 / 12500000000000 : ℝ) / 2 ^ 2 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13157222635451 / 12500000000000 : ℝ) ≤
            (128105533443034846651 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (98373885588441 / 400000000000000 : ℝ)) (q :=
      (13157222635451 / 50000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_404_10 :
    Uω (aρ 10) (bρ 10) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(15859495990828664169851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4095065341923027 / 20000000000000000 : ℝ) ≤
      (-(15859495990828664169851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4095065341923027 / 20000000000000000 : ℝ) =
            (4095065341923027 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4095065341923027 / 2500000000000000 : ℝ) ≤
            (4934919418171335830149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (420020615237163 / 2500000000000000 : ℝ)) (q :=
      (4095065341923027 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_404_11 :
    Uω (aρ 11) (bρ 11) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_404_12 :
    Uω (aρ 12) (bρ 12) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_404_13 :
    Uω (aρ 13) (bρ 13) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_404_14 :
    Uω (aρ 14) (bρ 14) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_404_15 :
    Uω (aρ 15) (bρ 15) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_404_16 :
    Uω (aρ 16) (bρ 16) (6641755819863 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_404 :
    Uρ (6641755819863 / 16000000000000 : ℝ) ≤
      (-(3249841497956135963179 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (6641755819863 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(8948814032234249353119 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (6641755819863 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1125961639650166118421 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (6641755819863 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(456334444861630339123 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (6641755819863 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9328096888636753907783 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (6641755819863 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2411100417759986548877 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (6641755819863 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5060114932047977894949 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (6641755819863 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(10818157684744796127839 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (6641755819863 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(5917365200118181528387 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (6641755819863 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3337630368056965153349 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (6641755819863 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(15859495990828664169851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (6641755819863 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (6641755819863 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (6641755819863 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (6641755819863 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (6641755819863 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (6641755819863 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_404_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_405_1 :
    Uω (aρ 1) (bρ 1) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(2205397067664007022223 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (66222149240023 / 160000000000000 : ℝ) ≤
      (-(2205397067664007022223 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (66222149240023 / 160000000000000 : ℝ) = (66222149240023 / 40000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (66222149240023 / 40000000000000 : ℝ) ≤
            (1260338833835992977777 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33110762134093 / 80000000000000 : ℝ)) (q :=
      (66222149240023 / 160000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_405_2 :
    Uω (aρ 2) (bρ 2) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(4439856992194217320277 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (822979309962943 / 2000000000000000 : ℝ) ≤
      (-(4439856992194217320277 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (822979309962943 / 2000000000000000 : ℝ) =
            (822979309962943 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (822979309962943 / 500000000000000 : ℝ) ≤
            (2491614810805782679723 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (205731936194909 / 500000000000000 : ℝ)) (q :=
      (822979309962943 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_405_3 :
    Uω (aρ 3) (bρ 3) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(2249291664094980362187 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4066848710052361 / 10000000000000000 : ℝ) ≤
      (-(2249291664094980362187 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4066848710052361 / 10000000000000000 : ℝ) =
            (4066848710052361 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4066848710052361 / 2500000000000000 : ℝ) ≤
            (1216444237405019637813 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (254121196920217 / 625000000000000 : ℝ)) (q :=
      (4066848710052361 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_405_4 :
    Uω (aρ 4) (bρ 4) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(143685914272745119657 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7973650529002219 / 20000000000000000 : ℝ) ≤
      (-(143685914272745119657 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7973650529002219 / 20000000000000000 : ℝ) =
            (7973650529002219 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7973650529002219 / 5000000000000000 : ℝ) ≤
            (72922579571004880343 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3984186440685969 / 10000000000000000 : ℝ)) (q :=
      (7973650529002219 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_405_5 :
    Uω (aρ 5) (bρ 5) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(4753914742488689626759 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3864383434570763 / 10000000000000000 : ℝ) ≤
      (-(4753914742488689626759 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3864383434570763 / 10000000000000000 : ℝ) =
            (3864383434570763 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3864383434570763 / 2500000000000000 : ℝ) ≤
            (2177557060511310373241 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (964373175040069 / 2500000000000000 : ℝ)) (q :=
      (3864383434570763 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_405_6 :
    Uω (aρ 6) (bρ 6) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(2494163466899750630607 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1474957202092181 / 4000000000000000 : ℝ) ≤
      (-(2494163466899750630607 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1474957202092181 / 4000000000000000 : ℝ) =
            (1474957202092181 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1474957202092181 / 1000000000000000 : ℝ) ≤
            (971572434600249369393 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (734150443323931 / 2000000000000000 : ℝ)) (q :=
      (1474957202092181 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_405_7 :
    Uω (aρ 7) (bρ 7) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(2665818446664646446537 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1721352868739247 / 5000000000000000 : ℝ) ≤
      (-(2665818446664646446537 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1721352868739247 / 5000000000000000 : ℝ) =
            (1721352868739247 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1721352868739247 / 1250000000000000 : ℝ) ≤
            (799917454835353553463 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1702519530937869 / 5000000000000000 : ℝ)) (q :=
      (1721352868739247 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_405_8 :
    Uω (aρ 8) (bρ 8) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(11660741129451976871839 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6231756031451009 / 20000000000000000 : ℝ) ≤
      (-(11660741129451976871839 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6231756031451009 / 20000000000000000 : ℝ) =
            (6231756031451009 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6231756031451009 / 5000000000000000 : ℝ) ≤
            (2202202476548023128161 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3034925269709759 / 10000000000000000 : ℝ)) (q :=
      (6231756031451009 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_405_9 :
    Uω (aρ 9) (bρ 9) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(13140303395378854275257 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5374695565840111 / 20000000000000000 : ℝ) ≤
      (-(13140303395378854275257 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5374695565840111 / 20000000000000000 : ℝ) =
            (5374695565840111 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5374695565840111 / 5000000000000000 : ℝ) ≤
            (722640210621145724743 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2518830432458861 / 10000000000000000 : ℝ)) (q :=
      (5374695565840111 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_405_10 :
    Uω (aρ 10) (bρ 10) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(1555478437684198579321 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (844353462736983 / 4000000000000000 : ℝ) ≤
      (-(1555478437684198579321 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (844353462736983 / 4000000000000000 : ℝ) =
            (844353462736983 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (844353462736983 / 500000000000000 : ℝ) ≤
            (523963103215801420679 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (350892242759733 / 2000000000000000 : ℝ)) (q :=
      (844353462736983 / 4000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_405_11 :
    Uω (aρ 11) (bρ 11) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_405_12 :
    Uω (aρ 12) (bρ 12) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_405_13 :
    Uω (aρ 13) (bρ 13) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_405_14 :
    Uω (aρ 14) (bρ 14) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_405_15 :
    Uω (aρ 15) (bρ 15) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_405_16 :
    Uω (aρ 16) (bρ 16) (3362736485061 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_405 :
    Uρ (3362736485061 / 8000000000000 : ℝ) ≤
      (-(12887117814147303746673 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (3362736485061 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2205397067664007022223 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (3362736485061 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4439856992194217320277 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (3362736485061 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2249291664094980362187 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (3362736485061 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(143685914272745119657 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (3362736485061 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4753914742488689626759 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (3362736485061 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2494163466899750630607 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (3362736485061 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2665818446664646446537 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (3362736485061 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(11660741129451976871839 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (3362736485061 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(13140303395378854275257 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (3362736485061 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1555478437684198579321 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (3362736485061 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (3362736485061 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (3362736485061 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (3362736485061 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (3362736485061 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (3362736485061 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_405_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_406_1 :
    Uω (aρ 1) (bρ 1) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(8695960864778360946079 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8382416068107581 / 20000000000000000 : ℝ) ≤
      (-(8695960864778360946079 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8382416068107581 / 20000000000000000 : ℝ) =
            (8382416068107581 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8382416068107581 / 5000000000000000 : ℝ) ≤
            (5166982741221639053921 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (523896182619307 / 1250000000000000 : ℝ)) (q :=
      (8382416068107581 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_406_2 :
    Uω (aρ 2) (bρ 2) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(4376676121341284168073 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4167223006162299 / 10000000000000000 : ℝ) ≤
      (-(4376676121341284168073 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4167223006162299 / 10000000000000000 : ℝ) =
            (4167223006162299 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4167223006162299 / 2500000000000000 : ℝ) ≤
            (2554795681658715831927 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4166968417681473 / 10000000000000000 : ℝ)) (q :=
      (4167223006162299 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_406_3 :
    Uω (aρ 3) (bρ 3) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(2217325329992838613491 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1029795871259173 / 2500000000000000 : ℝ) ≤
      (-(2217325329992838613491 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1029795871259173 / 2500000000000000 : ℝ) =
            (1029795871259173 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1029795871259173 / 625000000000000 : ℝ) ≤
            (1248410571507161386509 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4118285481780259 / 10000000000000000 : ℝ)) (q :=
      (1029795871259173 / 2500000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_406_4 :
    Uω (aρ 4) (bρ 4) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(9065427257069945571199 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1615673075540913 / 4000000000000000 : ℝ) ≤
      (-(9065427257069945571199 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1615673075540913 / 4000000000000000 : ℝ) =
            (1615673075540913 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1615673075540913 / 1000000000000000 : ℝ) ≤
            (4797516348930054428801 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (100914451761911 / 250000000000000 : ℝ)) (q :=
      (1615673075540913 / 4000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_406_5 :
    Uω (aρ 5) (bρ 5) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(4686551939544443826109 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (391679886675027 / 1000000000000000 : ℝ) ≤
      (-(4686551939544443826109 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (391679886675027 / 1000000000000000 : ℝ) =
            (391679886675027 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (391679886675027 / 250000000000000 : ℝ) ≤
            (2244919863455556173891 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (782000069121483 / 2000000000000000 : ℝ)) (q :=
      (391679886675027 / 1000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_406_6 :
    Uω (aρ 6) (bρ 6) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(9835128300274148067791 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7479900150298289 / 20000000000000000 : ℝ) ≤
      (-(9835128300274148067791 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7479900150298289 / 20000000000000000 : ℝ) =
            (7479900150298289 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7479900150298289 / 5000000000000000 : ℝ) ≤
            (4027815305725851932209 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (930885784386291 / 2500000000000000 : ℝ)) (q :=
      (7479900150298289 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_406_7 :
    Uω (aρ 7) (bρ 7) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(5132228374587151913 / 4882812500000000000 : ℝ)) := by
  have hlg :
    Real.log (6991197808870553 / 20000000000000000 : ℝ) ≤
      (-(5132228374587151913 / 4882812500000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6991197808870553 / 20000000000000000 : ℝ) =
            (6991197808870553 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6991197808870553 / 5000000000000000 : ℝ) ≤
            (1636787058030035587 / 4882812500000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (864625544219357 / 2500000000000000 : ℝ)) (q :=
      (6991197808870553 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_406_8 :
    Uω (aρ 8) (bρ 8) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(11489883318043325304749 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6339145253052087 / 20000000000000000 : ℝ) ≤
      (-(11489883318043325304749 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6339145253052087 / 20000000000000000 : ℝ) =
            (6339145253052087 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6339145253052087 / 5000000000000000 : ℝ) ≤
            (2373060287956674695251 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1544995636199481 / 5000000000000000 : ℝ)) (q :=
      (6339145253052087 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_406_9 :
    Uω (aρ 9) (bρ 9) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(404218113034351628443 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (68577394599119 / 250000000000000 : ℝ) ≤
      (-(404218113034351628443 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (68577394599119 / 250000000000000 : ℝ) = (68577394599119 / 62500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (68577394599119 / 62500000000000 : ℝ) ≤
            (28998874653148371557 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (515600643127279 / 2000000000000000 : ℝ)) (q :=
      (68577394599119 / 250000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_406_10 :
    Uω (aρ 10) (bρ 10) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(7631299881357333164523 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2173470319964777 / 10000000000000000 : ℝ) ≤
      (-(7631299881357333164523 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2173470319964777 / 10000000000000000 : ℝ) =
            (2173470319964777 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2173470319964777 / 1250000000000000 : ℝ) ≤
            (2765907823142666835477 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1827311321131429 / 10000000000000000 : ℝ)) (q :=
      (2173470319964777 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_406_11 :
    Uω (aρ 11) (bρ 11) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_406_12 :
    Uω (aρ 12) (bρ 12) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_406_13 :
    Uω (aρ 13) (bρ 13) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_406_14 :
    Uω (aρ 14) (bρ 14) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_406_15 :
    Uω (aρ 15) (bρ 15) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_406_16 :
    Uω (aρ 16) (bρ 16) (6809190120381 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_406 :
    Uρ (6809190120381 / 16000000000000 : ℝ) ≤
      (-(399293109801970771631 / 312500000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (6809190120381 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(8695960864778360946079 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (6809190120381 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4376676121341284168073 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (6809190120381 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2217325329992838613491 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (6809190120381 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(9065427257069945571199 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (6809190120381 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4686551939544443826109 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (6809190120381 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9835128300274148067791 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (6809190120381 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(5132228374587151913 / 4882812500000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (6809190120381 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(11489883318043325304749 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (6809190120381 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(404218113034351628443 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (6809190120381 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(7631299881357333164523 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (6809190120381 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (6809190120381 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (6809190120381 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (6809190120381 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (6809190120381 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (6809190120381 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_406_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_407_1 :
    Uω (aρ 1) (bρ 1) (86161340883 / 200000000000 : ℝ) ≤
      (-(342875686036299859671 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21217658642903 / 50000000000000 : ℝ) ≤
      (-(342875686036299859671 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (21217658642903 / 50000000000000 : ℝ) = (21217658642903 / 12500000000000 : ℝ) / 2 ^ 2 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21217658642903 / 12500000000000 : ℝ) ≤
            (211642058203700140329 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (21217468155481 / 50000000000000 : ℝ)) (q :=
      (21217658642903 / 50000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_407_2 :
    Uω (aρ 2) (bρ 2) (86161340883 / 200000000000 : ℝ) ≤
      (-(1725713503188980663307 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (527443672776311 / 1250000000000000 : ℝ) ≤
      (-(1725713503188980663307 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (527443672776311 / 1250000000000000 : ℝ) =
            (527443672776311 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (527443672776311 / 312500000000000 : ℝ) ≤
            (1046875218011019336693 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (527412243858247 / 1250000000000000 : ℝ)) (q :=
      (527443672776311 / 1250000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_407_3 :
    Uω (aρ 3) (bρ 3) (86161340883 / 200000000000 : ℝ) ≤
      (-(8743051013203827149901 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8343035940000919 / 20000000000000000 : ℝ) ≤
      (-(8743051013203827149901 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8343035940000919 / 20000000000000000 : ℝ) =
            (8343035940000919 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8343035940000919 / 5000000000000000 : ℝ) ≤
            (5119892592796172850099 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4170631232795919 / 10000000000000000 : ℝ)) (q :=
      (8343035940000919 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_407_4 :
    Uω (aρ 4) (bρ 4) (86161340883 / 200000000000 : ℝ) ≤
      (-(2234159628991301625199 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4091539237232629 / 10000000000000000 : ℝ) ≤
      (-(2234159628991301625199 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4091539237232629 / 10000000000000000 : ℝ) =
            (4091539237232629 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4091539237232629 / 2500000000000000 : ℝ) ≤
            (1231576272508698374801 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2044483974162629 / 5000000000000000 : ℝ)) (q :=
      (4091539237232629 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_407_5 :
    Uω (aρ 5) (bρ 5) (86161340883 / 200000000000 : ℝ) ≤
      (-(1848035083146948254919 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3969211859363087 / 10000000000000000 : ℝ) ≤
      (-(1848035083146948254919 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3969211859363087 / 10000000000000000 : ℝ) =
            (3969211859363087 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3969211859363087 / 2500000000000000 : ℝ) ≤
            (924553638053051745081 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1981251555960587 / 5000000000000000 : ℝ)) (q :=
      (3969211859363087 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_407_6 :
    Uω (aρ 6) (bρ 6) (86161340883 / 200000000000 : ℝ) ≤
      (-(1939118985162720111611 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7585001271642383 / 20000000000000000 : ℝ) ≤
      (-(1939118985162720111611 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7585001271642383 / 20000000000000000 : ℝ) =
            (7585001271642383 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7585001271642383 / 5000000000000000 : ℝ) ≤
            (833469736037279888389 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3776321039977383 / 10000000000000000 : ℝ)) (q :=
      (7585001271642383 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_407_7 :
    Uω (aρ 7) (bρ 7) (86161340883 / 200000000000 : ℝ) ≤
      (-(10360671859386552173789 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7096949807018291 / 20000000000000000 : ℝ) ≤
      (-(10360671859386552173789 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7096949807018291 / 20000000000000000 : ℝ) =
            (7096949807018291 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7096949807018291 / 5000000000000000 : ℝ) ≤
            (3502271746613447826211 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3511930956113291 / 10000000000000000 : ℝ)) (q :=
      (7096949807018291 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_407_8 :
    Uω (aρ 8) (bρ 8) (86161340883 / 200000000000 : ℝ) ≤
      (-(2264408210820016486429 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (805805102478053 / 2500000000000000 : ℝ) ≤
      (-(2264408210820016486429 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (805805102478053 / 2500000000000000 : ℝ) =
            (805805102478053 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (805805102478053 / 625000000000000 : ℝ) ≤
            (508180510379983513571 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (98280113133107 / 312500000000000 : ℝ)) (q :=
      (805805102478053 / 2500000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_407_9 :
    Uω (aρ 9) (bρ 9) (86161340883 / 200000000000 : ℝ) ≤
      (-(12734304324888259626497 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (699674745550947 / 2500000000000000 : ℝ) ≤
      (-(12734304324888259626497 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (699674745550947 / 2500000000000000 : ℝ) =
            (699674745550947 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (699674745550947 / 625000000000000 : ℝ) ≤
            (1128639281111740373503 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (164805399575161 / 625000000000000 : ℝ)) (q :=
      (699674745550947 / 2500000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_407_10 :
    Uω (aρ 10) (bρ 10) (86161340883 / 200000000000 : ℝ) ≤
      (-(3745433928253882754121 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (558845159230569 / 2500000000000000 : ℝ) ≤
      (-(3745433928253882754121 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (558845159230569 / 2500000000000000 : ℝ) =
            (558845159230569 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (558845159230569 / 312500000000000 : ℝ) ≤
            (1453169923996117245879 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (237351092016819 / 1250000000000000 : ℝ)) (q :=
      (558845159230569 / 2500000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_407_11 :
    Uω (aρ 11) (bρ 11) (86161340883 / 200000000000 : ℝ) ≤
      (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_11]) (by norm_num [bρ_11])]; exact Lmid_11

lemma U_407_12 :
    Uω (aρ 12) (bρ 12) (86161340883 / 200000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_407_13 :
    Uω (aρ 13) (bρ 13) (86161340883 / 200000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_407_14 :
    Uω (aρ 14) (bρ 14) (86161340883 / 200000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_407_15 :
    Uω (aρ 15) (bρ 15) (86161340883 / 200000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_407_16 :
    Uω (aρ 16) (bρ 16) (86161340883 / 200000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_407 :
    Uρ (86161340883 / 200000000000 : ℝ) ≤
      (-(791874724932342320321 / 625000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (86161340883 / 200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(342875686036299859671 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (86161340883 / 200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1725713503188980663307 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (86161340883 / 200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8743051013203827149901 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (86161340883 / 200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2234159628991301625199 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (86161340883 / 200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1848035083146948254919 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (86161340883 / 200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1939118985162720111611 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (86161340883 / 200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(10360671859386552173789 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (86161340883 / 200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2264408210820016486429 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (86161340883 / 200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(12734304324888259626497 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (86161340883 / 200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3745433928253882754121 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (86161340883 / 200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4457298065613116122159 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (86161340883 / 200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (86161340883 / 200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (86161340883 / 200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (86161340883 / 200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (86161340883 / 200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_407_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_408_1 :
    Uω (aρ 1) (bρ 1) (54181913021 / 125000000000 : ℝ) ≤
      (-(1701934117171983693411 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4270017962423161 / 10000000000000000 : ℝ) ≤
      (-(1701934117171983693411 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4270017962423161 / 10000000000000000 : ℝ) =
            (4270017962423161 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4270017962423161 / 2500000000000000 : ℝ) ≤
            (1070654604028016306589 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2134990050625661 / 5000000000000000 : ℝ)) (q :=
      (4270017962423161 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_408_2 :
    Uω (aρ 2) (bρ 2) (54181913021 / 125000000000 : ℝ) ≤
      (-(535374392089433119633 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4246036948215849 / 10000000000000000 : ℝ) ≤
      (-(535374392089433119633 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4246036948215849 / 10000000000000000 : ℝ) =
            (4246036948215849 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4246036948215849 / 2500000000000000 : ℝ) ≤
            (331059583285566880367 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2122893542673349 / 5000000000000000 : ℝ)) (q :=
      (4246036948215849 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_408_3 :
    Uω (aρ 3) (bρ 3) (54181913021 / 125000000000 : ℝ) ≤
      (-(867974593018045612053 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (524751195412123 / 1250000000000000 : ℝ) ≤
      (-(867974593018045612053 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (524751195412123 / 1250000000000000 : ℝ) =
            (524751195412123 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (524751195412123 / 312500000000000 : ℝ) ≤
            (518319767581954387947 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (524641052732371 / 1250000000000000 : ℝ)) (q :=
      (524751195412123 / 1250000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_408_4 :
    Uω (aρ 4) (bρ 4) (54181913021 / 125000000000 : ℝ) ≤
      (-(8872073375269568597809 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2059020891423341 / 5000000000000000 : ℝ) ≤
      (-(8872073375269568597809 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2059020891423341 / 5000000000000000 : ℝ) =
            (2059020891423341 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2059020891423341 / 1250000000000000 : ℝ) ≤
            (4990870230730431402191 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1028871760505841 / 2500000000000000 : ℝ)) (q :=
      (2059020891423341 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_408_5 :
    Uω (aρ 5) (bρ 5) (54181913021 / 125000000000 : ℝ) ≤
      (-(917355697984571850539 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (499467800122701 / 1250000000000000 : ℝ) ≤
      (-(917355697984571850539 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (499467800122701 / 1250000000000000 : ℝ) =
            (499467800122701 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (499467800122701 / 312500000000000 : ℝ) ≤
            (468938662615428149461 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (498634774703527 / 1250000000000000 : ℝ)) (q :=
      (499467800122701 / 1250000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_408_6 :
    Uω (aρ 6) (bρ 6) (54181913021 / 125000000000 : ℝ) ≤
      (-(1925140956285161018611 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (238693707408891 / 625000000000000 : ℝ) ≤
      (-(1925140956285161018611 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (238693707408891 / 625000000000000 : ℝ) =
            (238693707408891 / 156250000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (238693707408891 / 156250000000000 : ℝ) ≤
            (847447764914838981389 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (475379050986189 / 1250000000000000 : ℝ)) (q :=
      (238693707408891 / 625000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_408_7 :
    Uω (aρ 7) (bρ 7) (54181913021 / 125000000000 : ℝ) ≤
      (-(10285543461370157781439 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7150468842237723 / 20000000000000000 : ℝ) ≤
      (-(10285543461370157781439 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7150468842237723 / 20000000000000000 : ℝ) =
            (7150468842237723 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7150468842237723 / 5000000000000000 : ℝ) ≤
            (3577400144629842218561 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3538963993802723 / 10000000000000000 : ℝ)) (q :=
      (7150468842237723 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_408_8 :
    Uω (aρ 8) (bρ 8) (54181913021 / 125000000000 : ℝ) ≤
      (-(112381938674848357789 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (162517991270787 / 500000000000000 : ℝ) ≤
      (-(112381938674848357789 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (162517991270787 / 500000000000000 : ℝ) =
            (162517991270787 / 125000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (162517991270787 / 125000000000000 : ℝ) ≤
            (26247497385151642211 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (19829727835853 / 62500000000000 : ℝ)) (q :=
      (162517991270787 / 500000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_408_9 :
    Uω (aρ 9) (bρ 9) (54181913021 / 125000000000 : ℝ) ≤
      (-(12634421825163466454341 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2826793159500669 / 10000000000000000 : ℝ) ≤
      (-(12634421825163466454341 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2826793159500669 / 10000000000000000 : ℝ) =
            (2826793159500669 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2826793159500669 / 2500000000000000 : ℝ) ≤
            (1228521780836533545659 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1333294375133169 / 5000000000000000 : ℝ)) (q :=
      (2826793159500669 / 10000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_408_10 :
    Uω (aρ 10) (bρ 10) (54181913021 / 125000000000 : ℝ) ≤
      (-(7421773000218264526129 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4532971445688459 / 20000000000000000 : ℝ) ≤
      (-(7421773000218264526129 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4532971445688459 / 20000000000000000 : ℝ) =
            (4532971445688459 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4532971445688459 / 2500000000000000 : ℝ) ≤
            (2975434704281735473871 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1934532910448459 / 10000000000000000 : ℝ)) (q :=
      (4532971445688459 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_408_11 :
    Uω (aρ 11) (bρ 11) (54181913021 / 125000000000 : ℝ) ≤
      (-(10359853335001487342957 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2518747126261537 / 20000000000000000 : ℝ) ≤
      (-(10359853335001487342957 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2518747126261537 / 20000000000000000 : ℝ) =
            (2518747126261537 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2518747126261537 / 2500000000000000 : ℝ) ≤
            (37354369498512657043 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (338785217226537 / 10000000000000000 : ℝ)) (q :=
      (2518747126261537 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_408_12 :
    Uω (aρ 12) (bρ 12) (54181913021 / 125000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_408_13 :
    Uω (aρ 13) (bρ 13) (54181913021 / 125000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_408_14 :
    Uω (aρ 14) (bρ 14) (54181913021 / 125000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_408_15 :
    Uω (aρ 15) (bρ 15) (54181913021 / 125000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_408_16 :
    Uω (aρ 16) (bρ 16) (54181913021 / 125000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_408 :
    Uρ (54181913021 / 125000000000 : ℝ) ≤
      (-(12492873305617532369633 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (54181913021 / 125000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1701934117171983693411 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (54181913021 / 125000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(535374392089433119633 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (54181913021 / 125000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(867974593018045612053 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (54181913021 / 125000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8872073375269568597809 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (54181913021 / 125000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(917355697984571850539 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (54181913021 / 125000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1925140956285161018611 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (54181913021 / 125000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(10285543461370157781439 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (54181913021 / 125000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(112381938674848357789 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (54181913021 / 125000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(12634421825163466454341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (54181913021 / 125000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(7421773000218264526129 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (54181913021 / 125000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(10359853335001487342957 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (54181913021 / 125000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (54181913021 / 125000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (54181913021 / 125000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (54181913021 / 125000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (54181913021 / 125000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_408_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_409_1 :
    Uω (aρ 1) (bρ 1) (436103903921 / 1000000000000 : ℝ) ≤
      (-(8447833787109033449899 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8593008386704303 / 20000000000000000 : ℝ) ≤
      (-(8447833787109033449899 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8593008386704303 / 20000000000000000 : ℝ) =
            (8593008386704303 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8593008386704303 / 5000000000000000 : ℝ) ≤
            (5415109818890966550101 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4296466565579303 / 10000000000000000 : ℝ)) (q :=
      (8593008386704303 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_409_2 :
    Uω (aρ 2) (bρ 2) (436103903921 / 1000000000000 : ℝ) ≤
      (-(531487639599329723427 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1068131123693129 / 2500000000000000 : ℝ) ≤
      (-(531487639599329723427 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1068131123693129 / 2500000000000000 : ℝ) =
            (1068131123693129 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1068131123693129 / 625000000000000 : ℝ) ≤
            (334946335775670276573 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (267017261308127 / 625000000000000 : ℝ)) (q :=
      (1068131123693129 / 2500000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_409_3 :
    Uω (aρ 3) (bρ 3) (436103903921 / 1000000000000 : ℝ) ≤
      (-(4308419623487413080987 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8449002172795053 / 20000000000000000 : ℝ) ≤
      (-(4308419623487413080987 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8449002172795053 / 20000000000000000 : ℝ) =
            (8449002172795053 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8449002172795053 / 5000000000000000 : ℝ) ≤
            (2623052179512586919013 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4223625470530053 / 10000000000000000 : ℝ)) (q :=
      (8449002172795053 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_409_4 :
    Uω (aρ 4) (bρ 4) (436103903921 / 1000000000000 : ℝ) ≤
      (-(352316917537988224177 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8289088233391073 / 20000000000000000 : ℝ) ≤
      (-(352316917537988224177 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8289088233391073 / 20000000000000000 : ℝ) =
            (8289088233391073 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8289088233391073 / 5000000000000000 : ℝ) ≤
            (202200826702011775823 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4142005712191073 / 10000000000000000 : ℝ)) (q :=
      (8289088233391073 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_409_5 :
    Uω (aρ 5) (bρ 5) (436103903921 / 1000000000000 : ℝ) ≤
      (-(9107380873511893660103 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8044544708027943 / 20000000000000000 : ℝ) ≤
      (-(9107380873511893660103 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8044544708027943 / 20000000000000000 : ℝ) =
            (8044544708027943 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8044544708027943 / 5000000000000000 : ℝ) ≤
            (4755562732488106339897 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4015652106162943 / 10000000000000000 : ℝ)) (q :=
      (8044544708027943 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_409_6 :
    Uω (aρ 6) (bρ 6) (436103903921 / 1000000000000 : ℝ) ≤
      (-(9556303782198983042833 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3845696435999927 / 10000000000000000 : ℝ) ≤
      (-(9556303782198983042833 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3845696435999927 / 10000000000000000 : ℝ) =
            (3845696435999927 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3845696435999927 / 2500000000000000 : ℝ) ≤
            (4306639823801016957167 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1914870322637427 / 5000000000000000 : ℝ)) (q :=
      (3845696435999927 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_409_7 :
    Uω (aρ 7) (bρ 7) (436103903921 / 1000000000000 : ℝ) ≤
      (-(10210986681307664216749 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7203979667384347 / 20000000000000000 : ℝ) ≤
      (-(10210986681307664216749 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7203979667384347 / 20000000000000000 : ℝ) =
            (7203979667384347 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7203979667384347 / 5000000000000000 : ℝ) ≤
            (3651956924692335783251 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3565988821419347 / 10000000000000000 : ℝ)) (q :=
      (7203979667384347 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_409_8 :
    Uω (aρ 8) (bρ 8) (436103903921 / 1000000000000 : ℝ) ≤
      (-(11155077685116505444933 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6554976318838763 / 20000000000000000 : ℝ) ≤
      (-(11155077685116505444933 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6554976318838763 / 20000000000000000 : ℝ) =
            (6554976318838763 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6554976318838763 / 5000000000000000 : ℝ) ≤
            (2707865920883494555067 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3200527124213763 / 10000000000000000 : ℝ)) (q :=
      (6554976318838763 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_409_9 :
    Uω (aρ 9) (bρ 9) (436103903921 / 1000000000000 : ℝ) ≤
      (-(12535644509160010633761 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5709707646635067 / 20000000000000000 : ℝ) ≤
      (-(12535644509160010633761 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5709707646635067 / 20000000000000000 : ℝ) =
            (5709707646635067 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5709707646635067 / 5000000000000000 : ℝ) ≤
            (1327299096839989366239 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2696224080370067 / 10000000000000000 : ℝ)) (q :=
      (5709707646635067 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_409_10 :
    Uω (aρ 10) (bρ 10) (436103903921 / 1000000000000 : ℝ) ≤
      (-(14707874772608179319249 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (918977980753321 / 4000000000000000 : ℝ) ≤
      (-(14707874772608179319249 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (918977980753321 / 4000000000000000 : ℝ) =
            (918977980753321 / 500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (918977980753321 / 500000000000000 : ℝ) ≤
            (6086540636391820680751 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (393993074199321 / 2000000000000000 : ℝ)) (q :=
      (918977980753321 / 4000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_409_11 :
    Uω (aρ 11) (bρ 11) (436103903921 / 1000000000000 : ℝ) ≤
      (-(10036489124495165724449 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (671756125206833 / 5000000000000000 : ℝ) ≤
      (-(10036489124495165724449 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (671756125206833 / 5000000000000000 : ℝ) =
            (671756125206833 / 625000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (671756125206833 / 625000000000000 : ℝ) ≤
            (360718580004834275551 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (120144148565583 / 2500000000000000 : ℝ)) (q :=
      (671756125206833 / 5000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_409_12 :
    Uω (aρ 12) (bρ 12) (436103903921 / 1000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_409_13 :
    Uω (aρ 13) (bρ 13) (436103903921 / 1000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_409_14 :
    Uω (aρ 14) (bρ 14) (436103903921 / 1000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_409_15 :
    Uω (aρ 15) (bρ 15) (436103903921 / 1000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_409_16 :
    Uω (aρ 16) (bρ 16) (436103903921 / 1000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_409 :
    Uρ (436103903921 / 1000000000000 : ℝ) ≤
      (-(6194447236115731929341 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (436103903921 / 1000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(8447833787109033449899 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (436103903921 / 1000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(531487639599329723427 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (436103903921 / 1000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4308419623487413080987 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (436103903921 / 1000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(352316917537988224177 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (436103903921 / 1000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9107380873511893660103 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (436103903921 / 1000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9556303782198983042833 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (436103903921 / 1000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(10210986681307664216749 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (436103903921 / 1000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(11155077685116505444933 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (436103903921 / 1000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(12535644509160010633761 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (436103903921 / 1000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(14707874772608179319249 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (436103903921 / 1000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(10036489124495165724449 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (436103903921 / 1000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (436103903921 / 1000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (436103903921 / 1000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (436103903921 / 1000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (436103903921 / 1000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_409_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_410_1 :
    Uω (aρ 1) (bρ 1) (219376251837 / 500000000000 : ℝ) ≤
      (-(2096594256290114153041 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34583923371369 / 80000000000000 : ℝ) ≤
      (-(2096594256290114153041 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (34583923371369 / 80000000000000 : ℝ) = (34583923371369 / 20000000000000 : ℝ) / 2 ^ 2 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34583923371369 / 20000000000000 : ℝ) ≤
            (1369141645209885846959 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (17291812096749 / 40000000000000 : ℝ)) (q :=
      (34583923371369 / 80000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_410_2 :
    Uω (aρ 2) (bρ 2) (219376251837 / 500000000000 : ℝ) ≤
      (-(1055249823054743877783 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8598024044480041 / 20000000000000000 : ℝ) ≤
      (-(1055249823054743877783 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8598024044480041 / 20000000000000000 : ℝ) =
            (8598024044480041 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8598024044480041 / 5000000000000000 : ℝ) ≤
            (677618127695256122217 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4298765238335041 / 10000000000000000 : ℝ)) (q :=
      (8598024044480041 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_410_3 :
    Uω (aρ 3) (bρ 3) (219376251837 / 500000000000 : ℝ) ≤
      (-(4277162989177892952323 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4250992540614981 / 10000000000000000 : ℝ) ≤
      (-(4277162989177892952323 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4250992540614981 / 10000000000000000 : ℝ) =
            (4250992540614981 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4250992540614981 / 2500000000000000 : ℝ) ≤
            (2654308813822107047677 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2125061190717481 / 5000000000000000 : ℝ)) (q :=
      (4250992540614981 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_410_4 :
    Uω (aρ 4) (bρ 4) (219376251837 / 500000000000 : ℝ) ≤
      (-(4372090952870243498743 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2085523121410359 / 5000000000000000 : ℝ) ≤
      (-(4372090952870243498743 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2085523121410359 / 5000000000000000 : ℝ) =
            (2085523121410359 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2085523121410359 / 1250000000000000 : ℝ) ≤
            (2559380850129756501257 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1042130991727859 / 2500000000000000 : ℝ)) (q :=
      (2085523121410359 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_410_5 :
    Uω (aρ 5) (bρ 5) (219376251837 / 500000000000 : ℝ) ≤
      (-(904164124252520286273 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8097603460136829 / 20000000000000000 : ℝ) ≤
      (-(904164124252520286273 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8097603460136829 / 20000000000000000 : ℝ) =
            (8097603460136829 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8097603460136829 / 5000000000000000 : ℝ) ≤
            (482130236347479713727 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4042224860741829 / 10000000000000000 : ℝ)) (q :=
      (8097603460136829 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_410_6 :
    Uω (aρ 6) (bρ 6) (219376251837 / 500000000000 : ℝ) ≤
      (-(9487385073304664494243 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7744584041430827 / 20000000000000000 : ℝ) ≤
      (-(9487385073304664494243 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7744584041430827 / 20000000000000000 : ℝ) =
            (7744584041430827 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7744584041430827 / 5000000000000000 : ℝ) ≤
            (4375558532695335505757 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3856445817175827 / 10000000000000000 : ℝ)) (q :=
      (7744584041430827 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_410_7 :
    Uω (aρ 7) (bρ 7) (219376251837 / 500000000000 : ℝ) ≤
      (-(5068496359337917405659 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7257482467714601 / 20000000000000000 : ℝ) ≤
      (-(5068496359337917405659 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7257482467714601 / 20000000000000000 : ℝ) =
            (7257482467714601 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7257482467714601 / 5000000000000000 : ℝ) ≤
            (1862975443662082594341 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3593005624219601 / 10000000000000000 : ℝ)) (q :=
      (7257482467714601 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_410_8 :
    Uω (aρ 8) (bρ 8) (219376251837 / 500000000000 : ℝ) ≤
      (-(11072679310070797156689 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6609211395806087 / 20000000000000000 : ℝ) ≤
      (-(11072679310070797156689 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6609211395806087 / 20000000000000000 : ℝ) =
            (6609211395806087 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6609211395806087 / 5000000000000000 : ℝ) ≤
            (2790264295929202843311 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3228276203651087 / 10000000000000000 : ℝ)) (q :=
      (6609211395806087 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_410_9 :
    Uω (aρ 9) (bρ 9) (219376251837 / 500000000000 : ℝ) ≤
      (-(6218972905446657801553 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1441441033374307 / 5000000000000000 : ℝ) ≤
      (-(6218972905446657801553 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1441441033374307 / 5000000000000000 : ℝ) =
            (1441441033374307 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1441441033374307 / 1250000000000000 : ℝ) ≤
            (712498897553342198447 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (681448642425557 / 2500000000000000 : ℝ)) (q :=
      (1441441033374307 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_410_10 :
    Uω (aρ 10) (bρ 10) (219376251837 / 500000000000 : ℝ) ≤
      (-(14574612834924164906609 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (582066514092719 / 2500000000000000 : ℝ) ≤
      (-(14574612834924164906609 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (582066514092719 / 2500000000000000 : ℝ) =
            (582066514092719 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (582066514092719 / 312500000000000 : ℝ) ≤
            (6219802574075835093391 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (250640197805219 / 1250000000000000 : ℝ)) (q :=
      (582066514092719 / 2500000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_410_11 :
    Uω (aρ 11) (bρ 11) (219376251837 / 500000000000 : ℝ) ≤
      (-(611820281831991679449 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1411651351459397 / 10000000000000000 : ℝ) ≤
      (-(611820281831991679449 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1411651351459397 / 10000000000000000 : ℝ) =
            (1411651351459397 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1411651351459397 / 1250000000000000 : ℝ) ≤
            (38005199699258320551 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (295184399411897 / 5000000000000000 : ℝ)) (q :=
      (1411651351459397 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_410_12 :
    Uω (aρ 12) (bρ 12) (219376251837 / 500000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_410_13 :
    Uω (aρ 13) (bρ 13) (219376251837 / 500000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_410_14 :
    Uω (aρ 14) (bρ 14) (219376251837 / 500000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_410_15 :
    Uω (aρ 15) (bρ 15) (219376251837 / 500000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_410_16 :
    Uω (aρ 16) (bρ 16) (219376251837 / 500000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_410 :
    Uρ (219376251837 / 500000000000 : ℝ) ≤
      (-(12297444852051932068801 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (219376251837 / 500000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2096594256290114153041 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (219376251837 / 500000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1055249823054743877783 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (219376251837 / 500000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4277162989177892952323 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (219376251837 / 500000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4372090952870243498743 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (219376251837 / 500000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(904164124252520286273 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (219376251837 / 500000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9487385073304664494243 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (219376251837 / 500000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5068496359337917405659 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (219376251837 / 500000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(11072679310070797156689 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (219376251837 / 500000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(6218972905446657801553 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (219376251837 / 500000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(14574612834924164906609 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (219376251837 / 500000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(611820281831991679449 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (219376251837 / 500000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (219376251837 / 500000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (219376251837 / 500000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (219376251837 / 500000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (219376251837 / 500000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_410_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_411_1 :
    Uω (aρ 1) (bρ 1) (880153607101 / 2000000000000 : ℝ) ≤
      (-(8355789703777010327123 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4336233534399483 / 10000000000000000 : ℝ) ≤
      (-(8355789703777010327123 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4336233534399483 / 10000000000000000 : ℝ) =
            (4336233534399483 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4336233534399483 / 2500000000000000 : ℝ) ≤
            (5507153902222989672877 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2168098125689483 / 5000000000000000 : ℝ)) (q :=
      (4336233534399483 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_411_2 :
    Uω (aρ 2) (bρ 2) (880153607101 / 2000000000000 : ℝ) ≤
      (-(1682247885388241367499 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8624511557850547 / 20000000000000000 : ℝ) ≤
      (-(1682247885388241367499 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8624511557850547 / 20000000000000000 : ℝ) =
            (8624511557850547 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8624511557850547 / 5000000000000000 : ℝ) ≤
            (1090340835811758632501 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4312009752940547 / 10000000000000000 : ℝ)) (q :=
      (8624511557850547 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_411_3 :
    Uω (aρ 3) (bρ 3) (880153607101 / 2000000000000 : ℝ) ≤
      (-(4261607671066074145483 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4264238242293903 / 10000000000000000 : ℝ) ≤
      (-(4261607671066074145483 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4264238242293903 / 10000000000000000 : ℝ) =
            (4264238242293903 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4264238242293903 / 2500000000000000 : ℝ) ≤
            (2669864131933925854517 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2131685393013903 / 5000000000000000 : ℝ)) (q :=
      (4264238242293903 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_411_4 :
    Uω (aρ 4) (bρ 4) (880153607101 / 2000000000000 : ℝ) ≤
      (-(2178115821864365629041 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4184297229221859 / 10000000000000000 : ℝ) ≤
      (-(2178115821864365629041 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4184297229221859 / 10000000000000000 : ℝ) =
            (4184297229221859 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4184297229221859 / 2500000000000000 : ℝ) ≤
            (1287620079635634370959 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2090891470474359 / 5000000000000000 : ℝ)) (q :=
      (4184297229221859 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_411_5 :
    Uω (aρ 5) (bρ 5) (880153607101 / 2000000000000 : ℝ) ≤
      (-(9008933307601673657931 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2031033102636581 / 5000000000000000 : ℝ) ≤
      (-(9008933307601673657931 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2031033102636581 / 5000000000000000 : ℝ) =
            (2031033102636581 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2031033102636581 / 1250000000000000 : ℝ) ≤
            (4854010298398326342069 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1013877703096581 / 2500000000000000 : ℝ)) (q :=
      (2031033102636581 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_411_6 :
    Uω (aρ 6) (bρ 6) (880153607101 / 2000000000000 : ℝ) ≤
      (-(4726552237572163998887 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7771178496422463 / 20000000000000000 : ℝ) ≤
      (-(4726552237572163998887 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7771178496422463 / 20000000000000000 : ℝ) =
            (7771178496422463 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7771178496422463 / 5000000000000000 : ℝ) ≤
            (2204919565427836001113 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3869797273402463 / 10000000000000000 : ℝ)) (q :=
      (7771178496422463 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_411_7 :
    Uω (aρ 7) (bρ 7) (880153607101 / 2000000000000 : ℝ) ≤
      (-(404008164002188548969 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7284230914933357 / 20000000000000000 : ℝ) ≤
      (-(404008164002188548969 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7284230914933357 / 20000000000000000 : ℝ) =
            (7284230914933357 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7284230914933357 / 5000000000000000 : ℝ) ≤
            (150509580237811451031 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3606511072673357 / 10000000000000000 : ℝ)) (q :=
      (7284230914933357 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_411_8 :
    Uω (aρ 8) (bρ 8) (880153607101 / 2000000000000 : ℝ) ≤
      (-(5515872638589955285107 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1327264202182369 / 4000000000000000 : ℝ) ≤
      (-(5515872638589955285107 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1327264202182369 / 4000000000000000 : ℝ) =
            (1327264202182369 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1327264202182369 / 1000000000000000 : ℝ) ≤
            (1415599164410044714893 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (648428563998369 / 2000000000000000 : ℝ)) (q :=
      (1327264202182369 / 4000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_411_9 :
    Uω (aρ 9) (bρ 9) (880153607101 / 2000000000000 : ℝ) ≤
      (-(12389492920326356581651 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5793768717721283 / 20000000000000000 : ℝ) ≤
      (-(12389492920326356581651 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5793768717721283 / 20000000000000000 : ℝ) =
            (5793768717721283 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5793768717721283 / 5000000000000000 : ℝ) ≤
            (1473450685673643418349 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2740556155161283 / 10000000000000000 : ℝ)) (q :=
      (5793768717721283 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_411_10 :
    Uω (aρ 10) (bρ 10) (880153607101 / 2000000000000 : ℝ) ≤
      (-(56675208404681107481 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (4687254129813093 / 20000000000000000 : ℝ) ≤
      (-(56675208404681107481 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4687254129813093 / 20000000000000000 : ℝ) =
            (4687254129813093 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4687254129813093 / 2500000000000000 : ℝ) ≤
            (24552976786725142519 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2022600600748093 / 10000000000000000 : ℝ)) (q :=
      (4687254129813093 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_411_11 :
    Uω (aρ 11) (bρ 11) (880153607101 / 2000000000000 : ℝ) ≤
      (-(968136623931926557471 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2884809956741063 / 20000000000000000 : ℝ) ≤
      (-(968136623931926557471 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2884809956741063 / 20000000000000000 : ℝ) =
            (2884809956741063 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2884809956741063 / 2500000000000000 : ℝ) ≤
            (71584146518073442529 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (638633053881063 / 10000000000000000 : ℝ)) (q :=
      (2884809956741063 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_411_12 :
    Uω (aρ 12) (bρ 12) (880153607101 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_411_13 :
    Uω (aρ 13) (bρ 13) (880153607101 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_411_14 :
    Uω (aρ 14) (bρ 14) (880153607101 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_411_15 :
    Uω (aρ 15) (bρ 15) (880153607101 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_411_16 :
    Uω (aρ 16) (bρ 16) (880153607101 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_411 :
    Uρ (880153607101 / 2000000000000 : ℝ) ≤
      (-(6127214758723858306379 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (880153607101 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(8355789703777010327123 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (880153607101 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1682247885388241367499 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (880153607101 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4261607671066074145483 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (880153607101 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2178115821864365629041 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (880153607101 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(9008933307601673657931 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (880153607101 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4726552237572163998887 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (880153607101 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(404008164002188548969 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (880153607101 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(5515872638589955285107 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (880153607101 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(12389492920326356581651 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (880153607101 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(56675208404681107481 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (880153607101 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(968136623931926557471 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (880153607101 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (880153607101 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (880153607101 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (880153607101 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (880153607101 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_411_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
