/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U35) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_424_1 :
    Uω (aρ 1) (bρ 1) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(8069783430186067276137 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8924086147760843 / 20000000000000000 : ℝ) ≤
      (-(8069783430186067276137 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8924086147760843 / 20000000000000000 : ℝ) =
            (8924086147760843 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8924086147760843 / 5000000000000000 : ℝ) ≤
            (5793160175813932723863 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4462006842073343 / 10000000000000000 : ℝ)) (q :=
      (8924086147760843 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_424_2 :
    Uω (aρ 2) (bρ 2) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(1624730430815369043297 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8876142483631273 / 20000000000000000 : ℝ) ≤
      (-(1624730430815369043297 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8876142483631273 / 20000000000000000 : ℝ) =
            (8876142483631273 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8876142483631273 / 5000000000000000 : ℝ) ≤
            (1147858290384630956703 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4437832190453773 / 10000000000000000 : ℝ)) (q :=
      (8876142483631273 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_424_3 :
    Uω (aρ 3) (bρ 3) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(4116197784770404230469 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4390071594604641 / 10000000000000000 : ℝ) ≤
      (-(4116197784770404230469 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4390071594604641 / 10000000000000000 : ℝ) =
            (4390071594604641 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4390071594604641 / 2500000000000000 : ℝ) ≤
            (2815274018229595769531 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2194614501190891 / 5000000000000000 : ℝ)) (q :=
      (4390071594604641 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_424_4 :
    Uω (aρ 4) (bρ 4) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(8416056233038239239309 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8620358298217587 / 20000000000000000 : ℝ) ≤
      (-(8416056233038239239309 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8620358298217587 / 20000000000000000 : ℝ) =
            (8620358298217587 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8620358298217587 / 5000000000000000 : ℝ) ≤
            (5446887372961760760691 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4307738292455087 / 10000000000000000 : ℝ)) (q :=
      (8620358298217587 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_424_5 :
    Uω (aρ 5) (bρ 5) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(8703446256895322532487 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (837614384878577 / 2000000000000000 : ℝ) ≤
      (-(8703446256895322532487 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (837614384878577 / 2000000000000000 : ℝ) =
            (837614384878577 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (837614384878577 / 500000000000000 : ℝ) ≤
            (5159497349104677467513 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (418171376235827 / 1000000000000000 : ℝ)) (q :=
      (837614384878577 / 2000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_424_6 :
    Uω (aρ 6) (bρ 6) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(2283303540356153156021 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8023789823958269 / 20000000000000000 : ℝ) ≤
      (-(2283303540356153156021 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8023789823958269 / 20000000000000000 : ℝ) =
            (8023789823958269 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8023789823958269 / 5000000000000000 : ℝ) ≤
            (1182432361143846843979 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3996600112670769 / 10000000000000000 : ℝ)) (q :=
      (8023789823958269 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_424_7 :
    Uω (aρ 7) (bρ 7) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(2439356390886610766343 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (188456185376221 / 500000000000000 : ℝ) ≤
      (-(2439356390886610766343 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (188456185376221 / 500000000000000 : ℝ) =
            (188456185376221 / 125000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (188456185376221 / 125000000000000 : ℝ) ≤
            (1026379510613389233657 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (186735954226067 / 500000000000000 : ℝ)) (q :=
      (188456185376221 / 500000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_424_8 :
    Uω (aρ 8) (bρ 8) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(10651370252152340611 / 10000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (344680621415669 / 1000000000000000 : ℝ) ≤
      (-(10651370252152340611 / 10000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (344680621415669 / 1000000000000000 : ℝ) =
            (344680621415669 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (344680621415669 / 250000000000000 : ℝ) ≤
            (3211573353847659389 / 10000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (84340643728147 / 250000000000000 : ℝ)) (q :=
      (344680621415669 / 1000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_424_9 :
    Uω (aρ 9) (bρ 9) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(1194174976479651820651 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6059075899093861 / 20000000000000000 : ℝ) ≤
      (-(1194174976479651820651 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6059075899093861 / 20000000000000000 : ℝ) =
            (6059075899093861 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6059075899093861 / 5000000000000000 : ℝ) ≤
            (192119384120348179349 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2880054848266361 / 10000000000000000 : ℝ)) (q :=
      (6059075899093861 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_424_10 :
    Uω (aρ 10) (bρ 10) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(13910766432101367482929 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2488072835094411 / 10000000000000000 : ℝ) ≤
      (-(13910766432101367482929 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2488072835094411 / 10000000000000000 : ℝ) =
            (2488072835094411 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2488072835094411 / 1250000000000000 : ℝ) ≤
            (6883648976898632517071 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1092841826428161 / 5000000000000000 : ℝ)) (q :=
      (2488072835094411 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_424_11 :
    Uω (aρ 11) (bρ 11) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(8909444894819806137933 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3366397878121701 / 20000000000000000 : ℝ) ≤
      (-(8909444894819806137933 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3366397878121701 / 20000000000000000 : ℝ) =
            (3366397878121701 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3366397878121701 / 2500000000000000 : ℝ) ≤
            (1487762809680193862067 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (994412486994201 / 10000000000000000 : ℝ)) (q :=
      (3366397878121701 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_424_12 :
    Uω (aρ 12) (bρ 12) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_424_13 :
    Uω (aρ 13) (bρ 13) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_424_14 :
    Uω (aρ 14) (bρ 14) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_424_15 :
    Uω (aρ 15) (bρ 15) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_424_16 :
    Uω (aρ 16) (bρ 16) (1810630609509 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_424 :
    Uρ (1810630609509 / 4000000000000 : ℝ) ≤
      (-(11891711587405053258781 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1810630609509 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(8069783430186067276137 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1810630609509 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1624730430815369043297 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1810630609509 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4116197784770404230469 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1810630609509 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8416056233038239239309 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1810630609509 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8703446256895322532487 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1810630609509 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2283303540356153156021 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1810630609509 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2439356390886610766343 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1810630609509 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) * (-(10651370252152340611 / 10000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1810630609509 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1194174976479651820651 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1810630609509 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(13910766432101367482929 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1810630609509 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(8909444894819806137933 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1810630609509 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1810630609509 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1810630609509 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1810630609509 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1810630609509 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_424_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_425_1 :
    Uω (aρ 1) (bρ 1) (906639604631 / 2000000000000 : ℝ) ≤
      (-(4027477348275718747337 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (357493170156023 / 800000000000000 : ℝ) ≤
      (-(4027477348275718747337 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (357493170156023 / 800000000000000 : ℝ) =
            (357493170156023 / 200000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (357493170156023 / 200000000000000 : ℝ) ≤
            (2903994454724281252663 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (178745137953223 / 400000000000000 : ℝ)) (q :=
      (357493170156023 / 800000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_425_2 :
    Uω (aρ 2) (bρ 2) (906639604631 / 2000000000000 : ℝ) ≤
      (-(4054371351793893970459 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1777877238938007 / 4000000000000000 : ℝ) ≤
      (-(4054371351793893970459 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1777877238938007 / 4000000000000000 : ℝ) =
            (1777877238938007 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1777877238938007 / 1000000000000000 : ℝ) ≤
            (2877100451206106029541 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (888890880426007 / 2000000000000000 : ℝ)) (q :=
      (1777877238938007 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_425_3 :
    Uω (aρ 3) (bρ 3) (906639604631 / 2000000000000 : ℝ) ≤
      (-(8217321149963825466591 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8793388726378293 / 20000000000000000 : ℝ) ≤
      (-(8217321149963825466591 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8793388726378293 / 20000000000000000 : ℝ) =
            (8793388726378293 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8793388726378293 / 5000000000000000 : ℝ) ≤
            (5645622456036174533409 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4395853040168293 / 10000000000000000 : ℝ)) (q :=
      (8793388726378293 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_425_4 :
    Uω (aρ 4) (bρ 4) (906639604631 / 2000000000000 : ℝ) ≤
      (-(4200348437088783331463 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4316804394612983 / 10000000000000000 : ℝ) ≤
      (-(4200348437088783331463 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4316804394612983 / 10000000000000000 : ℝ) =
            (4316804394612983 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4316804394612983 / 2500000000000000 : ℝ) ≤
            (2731123365911216668537 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2157183642040483 / 5000000000000000 : ℝ)) (q :=
      (4316804394612983 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_425_5 :
    Uω (aρ 5) (bρ 5) (906639604631 / 2000000000000 : ℝ) ≤
      (-(8687624402469212596989 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8389406951225531 / 20000000000000000 : ℝ) ≤
      (-(8687624402469212596989 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8389406951225531 / 20000000000000000 : ℝ) =
            (8389406951225531 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8389406951225531 / 5000000000000000 : ℝ) ≤
            (5175319203530787403011 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4188355365415531 / 10000000000000000 : ℝ)) (q :=
      (8389406951225531 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_425_6 :
    Uω (aρ 6) (bρ 6) (906639604631 / 2000000000000 : ℝ) ≤
      (-(1139582518123484126347 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8037083418905043 / 20000000000000000 : ℝ) ≤
      (-(1139582518123484126347 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8037083418905043 / 20000000000000000 : ℝ) =
            (8037083418905043 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8037083418905043 / 5000000000000000 : ℝ) ≤
            (593285432626515873653 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4003272208235043 / 10000000000000000 : ℝ)) (q :=
      (8037083418905043 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_425_7 :
    Uω (aρ 7) (bρ 7) (906639604631 / 2000000000000 : ℝ) ≤
      (-(1947942394458633086619 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3775806095905767 / 10000000000000000 : ℝ) ≤
      (-(1947942394458633086619 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3775806095905767 / 10000000000000000 : ℝ) =
            (3775806095905767 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3775806095905767 / 2500000000000000 : ℝ) ≤
            (824646326741366913381 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1870731180950767 / 5000000000000000 : ℝ)) (q :=
      (3775806095905767 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_425_8 :
    Uω (aρ 8) (bρ 8) (906639604631 / 2000000000000 : ℝ) ≤
      (-(10631763071366856419741 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6907142118447623 / 20000000000000000 : ℝ) ≤
      (-(10631763071366856419741 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6907142118447623 / 20000000000000000 : ℝ) =
            (6907142118447623 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6907142118447623 / 5000000000000000 : ℝ) ≤
            (3231180534633143580259 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3380533939877623 / 10000000000000000 : ℝ)) (q :=
      (6907142118447623 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_425_9 :
    Uω (aρ 9) (bρ 9) (906639604631 / 2000000000000 : ℝ) ≤
      (-(11918788004198888387561 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23722674177189 / 78125000000000 : ℝ) ≤
      (-(11918788004198888387561 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (23722674177189 / 78125000000000 : ℝ) = (23722674177189 / 19531250000000 : ℝ) / 2 ^ 2 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23722674177189 / 19531250000000 : ℝ) ≤
            (1944155601801111612439 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (180460127446899 / 625000000000000 : ℝ)) (q :=
      (23722674177189 / 78125000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_425_10 :
    Uω (aρ 10) (bρ 10) (906639604631 / 2000000000000 : ℝ) ≤
      (-(3470132493185344546727 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2495607271404321 / 10000000000000000 : ℝ) ≤
      (-(3470132493185344546727 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2495607271404321 / 10000000000000000 : ℝ) =
            (2495607271404321 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2495607271404321 / 1250000000000000 : ℝ) ≤
            (1728471359064655453273 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1097065513046821 / 5000000000000000 : ℝ)) (q :=
      (2495607271404321 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_425_11 :
    Uω (aρ 11) (bρ 11) (906639604631 / 2000000000000 : ℝ) ≤
      (-(221910297290179888531 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3388711953436309 / 20000000000000000 : ℝ) ≤
      (-(221910297290179888531 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3388711953436309 / 20000000000000000 : ℝ) =
            (3388711953436309 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3388711953436309 / 2500000000000000 : ℝ) ≤
            (38019895322320111469 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1010105062926309 / 10000000000000000 : ℝ)) (q :=
      (3388711953436309 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_425_12 :
    Uω (aρ 12) (bρ 12) (906639604631 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_425_13 :
    Uω (aρ 13) (bρ 13) (906639604631 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_425_14 :
    Uω (aρ 14) (bρ 14) (906639604631 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_425_15 :
    Uω (aρ 15) (bρ 15) (906639604631 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_425_16 :
    Uω (aρ 16) (bρ 16) (906639604631 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_425 :
    Uρ (906639604631 / 2000000000000 : ℝ) ≤
      (-(11874116246818642659339 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (906639604631 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4027477348275718747337 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (906639604631 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4054371351793893970459 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (906639604631 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8217321149963825466591 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (906639604631 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4200348437088783331463 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (906639604631 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8687624402469212596989 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (906639604631 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1139582518123484126347 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (906639604631 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1947942394458633086619 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (906639604631 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(10631763071366856419741 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (906639604631 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(11918788004198888387561 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (906639604631 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3470132493185344546727 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (906639604631 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(221910297290179888531 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (906639604631 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (906639604631 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (906639604631 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (906639604631 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (906639604631 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_425_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_426_1 :
    Uω (aρ 1) (bρ 1) (363185561803 / 800000000000 : ℝ) ≤
      (-(1608029583970223099703 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1790114471944513 / 4000000000000000 : ℝ) ≤
      (-(1608029583970223099703 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1790114471944513 / 4000000000000000 : ℝ) =
            (1790114471944513 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1790114471944513 / 1000000000000000 : ℝ) ≤
            (1164559137229776900297 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (895050011054013 / 2000000000000000 : ℝ)) (q :=
      (1790114471944513 / 4000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_426_2 :
    Uω (aρ 2) (bρ 2) (363185561803 / 800000000000 : ℝ) ≤
      (-(252932982861302534687 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8902629903629441 / 20000000000000000 : ℝ) ≤
      (-(252932982861302534687 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8902629903629441 / 20000000000000000 : ℝ) =
            (8902629903629441 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8902629903629441 / 5000000000000000 : ℝ) ≤
            (180284004826197465313 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4451076611686941 / 10000000000000000 : ℝ)) (q :=
      (8902629903629441 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_426_3 :
    Uω (aρ 3) (bρ 3) (363185561803 / 800000000000 : ℝ) ≤
      (-(4101134714336247887123 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (220165856397753 / 500000000000000 : ℝ) ≤
      (-(4101134714336247887123 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (220165856397753 / 500000000000000 : ℝ) =
            (220165856397753 / 125000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (220165856397753 / 125000000000000 : ℝ) ≤
            (2830337088663752112877 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (220123853515881 / 500000000000000 : ℝ)) (q :=
      (220165856397753 / 500000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_426_4 :
    Uω (aρ 4) (bρ 4) (363185561803 / 800000000000 : ℝ) ≤
      (-(8385361096703903811737 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (864685925725911 / 2000000000000000 : ℝ) ≤
      (-(8385361096703903811737 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (864685925725911 / 2000000000000000 : ℝ) =
            (864685925725911 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (864685925725911 / 500000000000000 : ℝ) ≤
            (5477582509296096188263 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (432099625273161 / 1000000000000000 : ℝ)) (q :=
      (864685925725911 / 2000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_426_5 :
    Uω (aρ 5) (bρ 5) (363185561803 / 800000000000 : ℝ) ≤
      (-(541989226078443513091 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1680533998020911 / 4000000000000000 : ℝ) ≤
      (-(541989226078443513091 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1680533998020911 / 4000000000000000 : ℝ) =
            (1680533998020911 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1680533998020911 / 1000000000000000 : ℝ) ≤
            (324444749296556486909 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (838999380982411 / 2000000000000000 : ℝ)) (q :=
      (1680533998020911 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_426_6 :
    Uω (aρ 6) (bρ 6) (363185561803 / 800000000000 : ℝ) ≤
      (-(2275033423792574258343 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8050376846117527 / 20000000000000000 : ℝ) ≤
      (-(2275033423792574258343 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8050376846117527 / 20000000000000000 : ℝ) =
            (8050376846117527 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8050376846117527 / 5000000000000000 : ℝ) ≤
            (1190702477707425741657 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4009944136065027 / 10000000000000000 : ℝ)) (q :=
      (8050376846117527 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_426_7 :
    Uω (aρ 7) (bρ 7) (363185561803 / 800000000000 : ℝ) ≤
      (-(1215253784585170195443 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3782488267178449 / 10000000000000000 : ℝ) ≤
      (-(1215253784585170195443 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3782488267178449 / 10000000000000000 : ℝ) =
            (3782488267178449 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3782488267178449 / 2500000000000000 : ℝ) ≤
            (517614166164829804557 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1874102602532199 / 5000000000000000 : ℝ)) (q :=
      (3782488267178449 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_426_8 :
    Uω (aρ 8) (bρ 8) (363185561803 / 800000000000 : ℝ) ≤
      (-(2122439182815299947461 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6920670663515501 / 20000000000000000 : ℝ) ≤
      (-(2122439182815299947461 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6920670663515501 / 20000000000000000 : ℝ) =
            (6920670663515501 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6920670663515501 / 5000000000000000 : ℝ) ≤
            (650149538384700052539 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3387440985563001 / 10000000000000000 : ℝ)) (q :=
      (6920670663515501 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_426_9 :
    Uω (aρ 9) (bρ 9) (363185561803 / 800000000000 : ℝ) ≤
      (-(2973971066903655038759 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1521732495046507 / 5000000000000000 : ℝ) ≤
      (-(2973971066903655038759 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1521732495046507 / 5000000000000000 : ℝ) =
            (1521732495046507 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1521732495046507 / 1250000000000000 : ℝ) ≤
            (491764834596344961241 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (361833241324191 / 1250000000000000 : ℝ)) (q :=
      (1521732495046507 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_426_10 :
    Uω (aρ 10) (bρ 10) (363185561803 / 800000000000 : ℝ) ≤
      (-(1731301202107627005709 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5006270923733017 / 20000000000000000 : ℝ) ≤
      (-(1731301202107627005709 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5006270923733017 / 20000000000000000 : ℝ) =
            (5006270923733017 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5006270923733017 / 5000000000000000 : ℝ) ≤
            (1566748642372994291 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2202565907635517 / 10000000000000000 : ℝ)) (q :=
      (5006270923733017 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_426_11 :
    Uω (aρ 11) (bρ 11) (363185561803 / 800000000000 : ℝ) ≤
      (-(17687769941311851423913 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1705414343765671 / 10000000000000000 : ℝ) ≤
      (-(17687769941311851423913 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1705414343765671 / 10000000000000000 : ℝ) =
            (1705414343765671 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1705414343765671 / 1250000000000000 : ℝ) ≤
            (3106645467688148576087 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (512800148819421 / 5000000000000000 : ℝ)) (q :=
      (1705414343765671 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_426_12 :
    Uω (aρ 12) (bρ 12) (363185561803 / 800000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_426_13 :
    Uω (aρ 13) (bρ 13) (363185561803 / 800000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_426_14 :
    Uω (aρ 14) (bρ 14) (363185561803 / 800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_426_15 :
    Uω (aρ 15) (bρ 15) (363185561803 / 800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_426_16 :
    Uω (aρ 16) (bρ 16) (363185561803 / 800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_426 :
    Uρ (363185561803 / 800000000000 : ℝ) ≤
      (-(11856629194172474159109 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (363185561803 / 800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1608029583970223099703 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (363185561803 / 800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(252932982861302534687 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (363185561803 / 800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4101134714336247887123 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (363185561803 / 800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8385361096703903811737 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (363185561803 / 800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(541989226078443513091 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (363185561803 / 800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2275033423792574258343 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (363185561803 / 800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1215253784585170195443 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (363185561803 / 800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2122439182815299947461 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (363185561803 / 800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2973971066903655038759 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (363185561803 / 800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1731301202107627005709 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (363185561803 / 800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(17687769941311851423913 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (363185561803 / 800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (363185561803 / 800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (363185561803 / 800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (363185561803 / 800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (363185561803 / 800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_426_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_427_1 :
    Uω (aρ 1) (bρ 1) (28415256387 / 62500000000 : ℝ) ≤
      (-(2006340758789207906781 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8963815465228221 / 20000000000000000 : ℝ) ≤
      (-(2006340758789207906781 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8963815465228221 / 20000000000000000 : ℝ) =
            (8963815465228221 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8963815465228221 / 5000000000000000 : ℝ) ≤
            (1459395142710792093219 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4481871661393221 / 10000000000000000 : ℝ)) (q :=
      (8963815465228221 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_427_2 :
    Uω (aρ 2) (bρ 2) (28415256387 / 62500000000 : ℝ) ≤
      (-(1615798066397558523171 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8915873610458937 / 20000000000000000 : ℝ) ≤
      (-(1615798066397558523171 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8915873610458937 / 20000000000000000 : ℝ) =
            (8915873610458937 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8915873610458937 / 5000000000000000 : ℝ) ≤
            (1156790654802441476829 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4457698819133937 / 10000000000000000 : ℝ)) (q :=
      (8915873610458937 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_427_3 :
    Uω (aρ 3) (bρ 3) (28415256387 / 62500000000 : ℝ) ≤
      (-(818724033738776100043 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4409939888919593 / 10000000000000000 : ℝ) ≤
      (-(818724033738776100043 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4409939888919593 / 10000000000000000 : ℝ) =
            (4409939888919593 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4409939888919593 / 2500000000000000 : ℝ) ≤
            (567570326861223899957 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2204550546432093 / 5000000000000000 : ℝ)) (q :=
      (4409939888919593 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_427_4 :
    Uω (aρ 4) (bρ 4) (28415256387 / 62500000000 : ℝ) ≤
      (-(1046256103529695111109 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4330054851211299 / 10000000000000000 : ℝ) ≤
      (-(1046256103529695111109 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4330054851211299 / 10000000000000000 : ℝ) =
            (4330054851211299 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4330054851211299 / 2500000000000000 : ℝ) ≤
            (686611847220304888891 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2163812599256299 / 5000000000000000 : ℝ)) (q :=
      (4330054851211299 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_427_5 :
    Uω (aρ 5) (bρ 5) (28415256387 / 62500000000 : ℝ) ≤
      (-(2164013955424430799831 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4207966482862127 / 10000000000000000 : ℝ) ≤
      (-(2164013955424430799831 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4207966482862127 / 10000000000000000 : ℝ) =
            (4207966482862127 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4207966482862127 / 2500000000000000 : ℝ) ≤
            (1301721946075569200169 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2100819190574627 / 5000000000000000 : ℝ)) (q :=
      (4207966482862127 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_427_6 :
    Uω (aρ 6) (bρ 6) (28415256387 / 62500000000 : ℝ) ≤
      (-(9083634719625875003053 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4031835053215791 / 10000000000000000 : ℝ) ≤
      (-(9083634719625875003053 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4031835053215791 / 10000000000000000 : ℝ) =
            (4031835053215791 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4031835053215791 / 2500000000000000 : ℝ) ≤
            (4779308886374124996947 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2008307948498291 / 5000000000000000 : ℝ)) (q :=
      (4031835053215791 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_427_7 :
    Uω (aρ 7) (bρ 7) (28415256387 / 62500000000 : ℝ) ≤
      (-(4852190180007776394843 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1894585111256033 / 5000000000000000 : ℝ) ≤
      (-(4852190180007776394843 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1894585111256033 / 5000000000000000 : ℝ) =
            (1894585111256033 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1894585111256033 / 1250000000000000 : ℝ) ≤
            (2079281622992223605157 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (938736904087283 / 2500000000000000 : ℝ)) (q :=
      (1894585111256033 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_427_8 :
    Uω (aρ 8) (bρ 8) (28415256387 / 62500000000 : ℝ) ≤
      (-(10592668610642755392833 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (693419807050719 / 2000000000000000 : ℝ) ≤
      (-(10592668610642755392833 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (693419807050719 / 2000000000000000 : ℝ) =
            (693419807050719 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (693419807050719 / 500000000000000 : ℝ) ≤
            (3270274995357244607167 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (339434689317219 / 1000000000000000 : ℝ)) (q :=
      (693419807050719 / 2000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_427_9 :
    Uω (aρ 9) (bρ 9) (28415256387 / 62500000000 : ℝ) ≤
      (-(5936519118310741301741 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6100852096483651 / 20000000000000000 : ℝ) ≤
      (-(5936519118310741301741 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6100852096483651 / 20000000000000000 : ℝ) =
            (6100852096483651 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6100852096483651 / 5000000000000000 : ℝ) ≤
            (994952684689258698259 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2901966547508651 / 10000000000000000 : ℝ)) (q :=
      (6100852096483651 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_427_10 :
    Uω (aρ 10) (bρ 10) (28415256387 / 62500000000 : ℝ) ≤
      (-(3455101075548872166831 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5021314955928739 / 20000000000000000 : ℝ) ≤
      (-(3455101075548872166831 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5021314955928739 / 20000000000000000 : ℝ) =
            (5021314955928739 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5021314955928739 / 5000000000000000 : ℝ) ≤
            (10634825951127833169 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2210988440448739 / 10000000000000000 : ℝ)) (q :=
      (5021314955928739 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_427_11 :
    Uω (aρ 11) (bρ 11) (28415256387 / 62500000000 : ℝ) ≤
      (-(8811842877035075998573 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3432756893474963 / 20000000000000000 : ℝ) ≤
      (-(8811842877035075998573 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3432756893474963 / 20000000000000000 : ℝ) =
            (3432756893474963 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3432756893474963 / 2500000000000000 : ℝ) ≤
            (1585364827464924001427 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1040907004199963 / 10000000000000000 : ℝ)) (q :=
      (3432756893474963 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_427_12 :
    Uω (aρ 12) (bρ 12) (28415256387 / 62500000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_427_13 :
    Uω (aρ 13) (bρ 13) (28415256387 / 62500000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_427_14 :
    Uω (aρ 14) (bρ 14) (28415256387 / 62500000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_427_15 :
    Uω (aρ 15) (bρ 15) (28415256387 / 62500000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_427_16 :
    Uω (aρ 16) (bρ 16) (28415256387 / 62500000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_427 :
    Uρ (28415256387 / 62500000000 : ℝ) ≤
      (-(11839246909114969195289 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (28415256387 / 62500000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2006340758789207906781 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (28415256387 / 62500000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1615798066397558523171 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (28415256387 / 62500000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(818724033738776100043 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (28415256387 / 62500000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1046256103529695111109 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (28415256387 / 62500000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2164013955424430799831 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (28415256387 / 62500000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9083634719625875003053 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (28415256387 / 62500000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4852190180007776394843 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (28415256387 / 62500000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(10592668610642755392833 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (28415256387 / 62500000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5936519118310741301741 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (28415256387 / 62500000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3455101075548872166831 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (28415256387 / 62500000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(8811842877035075998573 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (28415256387 / 62500000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (28415256387 / 62500000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (28415256387 / 62500000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (28415256387 / 62500000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (28415256387 / 62500000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_427_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_428_1 :
    Uω (aρ 1) (bρ 1) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(8010599977827891867547 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8977058570418943 / 20000000000000000 : ℝ) ≤
      (-(8010599977827891867547 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8977058570418943 / 20000000000000000 : ℝ) =
            (8977058570418943 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8977058570418943 / 5000000000000000 : ℝ) ≤
            (5852343628172108132453 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4488493267201443 / 10000000000000000 : ℝ)) (q :=
      (8977058570418943 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_428_2 :
    Uω (aρ 2) (bρ 2) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(1612829455829885220953 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1116139664398489 / 2500000000000000 : ℝ) ≤
      (-(1612829455829885220953 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1116139664398489 / 2500000000000000 : ℝ) =
            (1116139664398489 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1116139664398489 / 625000000000000 : ℝ) ≤
            (1159759265370114779047 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1116080256120103 / 2500000000000000 : ℝ)) (q :=
      (1116139664398489 / 2500000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_428_3 :
    Uω (aρ 3) (bρ 3) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(2043058452034576909719 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1104140661524963 / 2500000000000000 : ℝ) ≤
      (-(2043058452034576909719 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1104140661524963 / 2500000000000000 : ℝ) =
            (1104140661524963 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1104140661524963 / 625000000000000 : ℝ) ≤
            (1422677449465423090281 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1103931276960551 / 2500000000000000 : ℝ)) (q :=
      (1104140661524963 / 2500000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_428_4 :
    Uω (aρ 4) (bρ 4) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(4177379998365973504417 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8673360124821363 / 20000000000000000 : ℝ) ≤
      (-(4177379998365973504417 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8673360124821363 / 20000000000000000 : ℝ) =
            (8673360124821363 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8673360124821363 / 5000000000000000 : ℝ) ≤
            (2754091804634026495583 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4334254121528863 / 10000000000000000 : ℝ)) (q :=
      (8673360124821363 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_428_5 :
    Uω (aρ 5) (bρ 5) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(8640308936621060834287 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8429195878384133 / 20000000000000000 : ℝ) ≤
      (-(8640308936621060834287 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8429195878384133 / 20000000000000000 : ℝ) =
            (8429195878384133 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8429195878384133 / 5000000000000000 : ℝ) ≤
            (5222634669378939165713 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4208279794426633 / 10000000000000000 : ℝ)) (q :=
      (8429195878384133 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_428_6 :
    Uω (aρ 6) (bρ 6) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(9067163126475235429003 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1615392640135501 / 4000000000000000 : ℝ) ≤
      (-(9067163126475235429003 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1615392640135501 / 4000000000000000 : ℝ) =
            (1615392640135501 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1615392640135501 / 1000000000000000 : ℝ) ≤
            (4795780479524764570997 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (804657498372001 / 2000000000000000 : ℝ)) (q :=
      (1615392640135501 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_428_7 :
    Uω (aρ 7) (bρ 7) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(9686762106250244520731 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7591703926135517 / 20000000000000000 : ℝ) ≤
      (-(9686762106250244520731 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7591703926135517 / 20000000000000000 : ℝ) =
            (7591703926135517 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7591703926135517 / 5000000000000000 : ℝ) ≤
            (4176181499749755479269 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3761689598078017 / 10000000000000000 : ℝ)) (q :=
      (7591703926135517 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_428_8 :
    Uω (aρ 8) (bρ 8) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(10573180992541647374207 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27139548227949 / 78125000000000 : ℝ) ≤
      (-(10573180992541647374207 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27139548227949 / 78125000000000 : ℝ) = (27139548227949 / 19531250000000 : ℝ) / 2 ^ 2 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27139548227949 / 19531250000000 : ℝ) ≤
            (3289762613458352625793 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (850312917409361 / 2500000000000000 : ℝ)) (q :=
      (27139548227949 / 78125000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_428_9 :
    Uω (aρ 9) (bρ 9) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(11850249595588193161761 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1528692740726231 / 5000000000000000 : ℝ) ≤
      (-(11850249595588193161761 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1528692740726231 / 5000000000000000 : ℝ) =
            (1528692740726231 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1528692740726231 / 1250000000000000 : ℝ) ≤
            (2012694010411806838239 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (90914497329607 / 312500000000000 : ℝ)) (q :=
      (1528692740726231 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_428_10 :
    Uω (aρ 10) (bρ 10) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(6895256495096437908121 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (251817338999233 / 1000000000000000 : ℝ) ≤
      (-(6895256495096437908121 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (251817338999233 / 1000000000000000 : ℝ) =
            (251817338999233 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (251817338999233 / 250000000000000 : ℝ) ≤
            (36215307903562091879 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (27742484564027 / 125000000000000 : ℝ)) (q :=
      (251817338999233 / 1000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_428_11 :
    Uω (aρ 11) (bρ 11) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(3512106326516641677623 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3454504769179323 / 20000000000000000 : ℝ) ≤
      (-(3512106326516641677623 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3454504769179323 / 20000000000000000 : ℝ) =
            (3454504769179323 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3454504769179323 / 2500000000000000 : ℝ) ≤
            (646776755283358322377 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1056033380521823 / 10000000000000000 : ℝ)) (q :=
      (3454504769179323 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_428_12 :
    Uω (aρ 12) (bρ 12) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_428_13 :
    Uω (aρ 13) (bρ 13) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_428_14 :
    Uω (aρ 14) (bρ 14) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_428_15 :
    Uω (aρ 15) (bρ 15) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_428_16 :
    Uω (aρ 16) (bρ 16) (1821225008521 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_428 :
    Uρ (1821225008521 / 4000000000000 : ℝ) ≤
      (-(2364393220857954377449 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1821225008521 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(8010599977827891867547 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1821225008521 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1612829455829885220953 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1821225008521 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2043058452034576909719 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1821225008521 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4177379998365973504417 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1821225008521 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8640308936621060834287 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1821225008521 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9067163126475235429003 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1821225008521 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(9686762106250244520731 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1821225008521 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(10573180992541647374207 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1821225008521 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(11850249595588193161761 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1821225008521 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6895256495096437908121 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1821225008521 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3512106326516641677623 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1821225008521 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1821225008521 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1821225008521 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1821225008521 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1821225008521 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_428_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_429_1 :
    Uω (aρ 1) (bρ 1) (911936804137 / 2000000000000 : ℝ) ≤
      (-(7995858683509481005467 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2247575418824031 / 5000000000000000 : ℝ) ≤
      (-(7995858683509481005467 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2247575418824031 / 5000000000000000 : ℝ) =
            (2247575418824031 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2247575418824031 / 1250000000000000 : ℝ) ≤
            (5867084922490518994533 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1123778718174031 / 2500000000000000 : ℝ)) (q :=
      (2247575418824031 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_429_2 :
    Uω (aρ 2) (bρ 2) (911936804137 / 2000000000000 : ℝ) ≤
      (-(251541444613192942879 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8942361017825701 / 20000000000000000 : ℝ) ≤
      (-(251541444613192942879 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8942361017825701 / 20000000000000000 : ℝ) =
            (8942361017825701 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8942361017825701 / 5000000000000000 : ℝ) ≤
            (181675543074307057121 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4470943227735701 / 10000000000000000 : ℝ)) (q :=
      (8942361017825701 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_429_3 :
    Uω (aρ 3) (bρ 3) (911936804137 / 2000000000000 : ℝ) ≤
      (-(4078624886629356679157 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2211592699756421 / 5000000000000000 : ℝ) ≤
      (-(4078624886629356679157 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2211592699756421 / 5000000000000000 : ℝ) =
            (2211592699756421 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2211592699756421 / 1250000000000000 : ℝ) ≤
            (2852846916370643320843 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1105587278821421 / 2500000000000000 : ℝ)) (q :=
      (2211592699756421 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_429_4 :
    Uω (aρ 4) (bρ 4) (911936804137 / 2000000000000 : ℝ) ≤
      (-(8339494530471527057847 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8686610524559697 / 20000000000000000 : ℝ) ≤
      (-(8339494530471527057847 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8686610524559697 / 20000000000000000 : ℝ) =
            (8686610524559697 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8686610524559697 / 5000000000000000 : ℝ) ≤
            (5523449075528472942153 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4340883021884697 / 10000000000000000 : ℝ)) (q :=
      (8686610524559697 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_429_5 :
    Uω (aρ 5) (bρ 5) (911936804137 / 2000000000000 : ℝ) ≤
      (-(8624586883225874612507 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (844245872838181 / 2000000000000000 : ℝ) ≤
      (-(8624586883225874612507 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (844245872838181 / 2000000000000000 : ℝ) =
            (844245872838181 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (844245872838181 / 500000000000000 : ℝ) ≤
            (5238356722774125387493 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (421492114504181 / 1000000000000000 : ℝ)) (q :=
      (844245872838181 / 2000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_429_6 :
    Uω (aρ 6) (bρ 6) (911936804137 / 2000000000000 : ℝ) ≤
      (-(4525359412151244814811 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8090256129680071 / 20000000000000000 : ℝ) ≤
      (-(4525359412151244814811 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8090256129680071 / 20000000000000000 : ℝ) =
            (8090256129680071 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8090256129680071 / 5000000000000000 : ℝ) ≤
            (2406112390848755185189 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4029958921480071 / 10000000000000000 : ℝ)) (q :=
      (8090256129680071 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_429_7 :
    Uω (aρ 7) (bρ 7) (911936804137 / 2000000000000 : ℝ) ≤
      (-(1933835079997006956291 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (950633372499571 / 2500000000000000 : ℝ) ≤
      (-(1933835079997006956291 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (950633372499571 / 2500000000000000 : ℝ) =
            (950633372499571 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (950633372499571 / 625000000000000 : ℝ) ≤
            (838753641202993043709 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (471053894069571 / 1250000000000000 : ℝ)) (q :=
      (950633372499571 / 2500000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_429_8 :
    Uω (aρ 8) (bρ 8) (911936804137 / 2000000000000 : ℝ) ≤
      (-(5276866446176848011757 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6961249497933711 / 20000000000000000 : ℝ) ≤
      (-(5276866446176848011757 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6961249497933711 / 20000000000000000 : ℝ) =
            (6961249497933711 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6961249497933711 / 5000000000000000 : ℝ) ≤
            (1654605356823151988243 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3408155321833711 / 10000000000000000 : ℝ)) (q :=
      (6961249497933711 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_429_9 :
    Uω (aρ 9) (bρ 9) (911936804137 / 2000000000000 : ℝ) ≤
      (-(5913759015820159389253 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1225737320768777 / 4000000000000000 : ℝ) ≤
      (-(5913759015820159389253 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1225737320768777 / 4000000000000000 : ℝ) =
            (1225737320768777 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1225737320768777 / 1000000000000000 : ℝ) ≤
            (1017712787179840610747 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (583311611220777 / 2000000000000000 : ℝ)) (q :=
      (1225737320768777 / 4000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_429_10 :
    Uω (aρ 10) (bρ 10) (911936804137 / 2000000000000 : ℝ) ≤
      (-(1720091831909998787893 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2525683267082197 / 10000000000000000 : ℝ) ≤
      (-(1720091831909998787893 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2525683267082197 / 10000000000000000 : ℝ) =
            (2525683267082197 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2525683267082197 / 2500000000000000 : ℝ) ≤
            (12776118840001212107 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1113898509959697 / 5000000000000000 : ℝ)) (q :=
      (2525683267082197 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_429_11 :
    Uω (aρ 11) (bρ 11) (911936804137 / 2000000000000 : ℝ) ≤
      (-(17498270634776701115959 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (434509994437601 / 2500000000000000 : ℝ) ≤
      (-(17498270634776701115959 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (434509994437601 / 2500000000000000 : ℝ) =
            (434509994437601 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (434509994437601 / 312500000000000 : ℝ) ≤
            (3296144774223298884041 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (133873383432601 / 1250000000000000 : ℝ)) (q :=
      (434509994437601 / 2500000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_429_12 :
    Uω (aρ 12) (bρ 12) (911936804137 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_429_13 :
    Uω (aρ 13) (bρ 13) (911936804137 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_429_14 :
    Uω (aρ 14) (bρ 14) (911936804137 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_429_15 :
    Uω (aρ 15) (bρ 15) (911936804137 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_429_16 :
    Uω (aρ 16) (bρ 16) (911936804137 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_429 :
    Uρ (911936804137 / 2000000000000 : ℝ) ≤
      (-(11804783702785120325837 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (911936804137 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7995858683509481005467 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (911936804137 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(251541444613192942879 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (911936804137 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4078624886629356679157 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (911936804137 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8339494530471527057847 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (911936804137 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8624586883225874612507 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (911936804137 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4525359412151244814811 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (911936804137 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1933835079997006956291 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (911936804137 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(5276866446176848011757 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (911936804137 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5913759015820159389253 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (911936804137 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1720091831909998787893 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (911936804137 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(17498270634776701115959 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (911936804137 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (911936804137 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (911936804137 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (911936804137 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (911936804137 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_429_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_430_1 :
    Uω (aρ 1) (bρ 1) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(3990569544065491910013 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4501772389930573 / 10000000000000000 : ℝ) ≤
      (-(3990569544065491910013 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4501772389930573 / 10000000000000000 : ℝ) =
            (4501772389930573 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4501772389930573 / 2500000000000000 : ℝ) ≤
            (2940902258934508089987 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2250868238939323 / 5000000000000000 : ℝ)) (q :=
      (4501772389930573 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_430_2 :
    Uω (aρ 2) (bρ 2) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(1004315889034024038327 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8955604718381581 / 20000000000000000 : ℝ) ≤
      (-(1004315889034024038327 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8955604718381581 / 20000000000000000 : ℝ) =
            (8955604718381581 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8955604718381581 / 5000000000000000 : ℝ) ≤
            (728552061715975961673 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4477565428909081 / 10000000000000000 : ℝ)) (q :=
      (8955604718381581 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_430_3 :
    Uω (aρ 3) (bρ 3) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(8142288165387616772923 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2214904074587733 / 5000000000000000 : ℝ) ≤
      (-(8142288165387616772923 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2214904074587733 / 5000000000000000 : ℝ) =
            (2214904074587733 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2214904074587733 / 1250000000000000 : ℝ) ≤
            (5720655440612383227077 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (276810819701777 / 625000000000000 : ℝ)) (q :=
      (2214904074587733 / 5000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_430_4 :
    Uω (aρ 4) (bρ 4) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(4162126179034898229433 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4349930450870627 / 10000000000000000 : ℝ) ≤
      (-(4162126179034898229433 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4349930450870627 / 10000000000000000 : ℝ) =
            (4349930450870627 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4349930450870627 / 2500000000000000 : ℝ) ≤
            (2769345623965101770567 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2173755949841877 / 5000000000000000 : ℝ)) (q :=
      (4349930450870627 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_430_5 :
    Uω (aρ 5) (bρ 5) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(2152222395771836180129 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4227860758006511 / 10000000000000000 : ℝ) ≤
      (-(2152222395771836180129 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4227860758006511 / 10000000000000000 : ℝ) =
            (4227860758006511 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4227860758006511 / 2500000000000000 : ℝ) ≤
            (1313513505728163819871 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2110781216645261 / 5000000000000000 : ℝ)) (q :=
      (4227860758006511 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_430_6 :
    Uω (aρ 6) (bρ 6) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(9034301722152087805031 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8103548894258587 / 20000000000000000 : ℝ) ≤
      (-(9034301722152087805031 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8103548894258587 / 20000000000000000 : ℝ) =
            (8103548894258587 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8103548894258587 / 5000000000000000 : ℝ) ≤
            (4828641883847912194969 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4036630186676087 / 10000000000000000 : ℝ)) (q :=
      (8103548894258587 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_430_7 :
    Uω (aρ 7) (bρ 7) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(2412905031614942433679 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1523685921779237 / 4000000000000000 : ℝ) ≤
      (-(2412905031614942433679 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1523685921779237 / 4000000000000000 : ℝ) =
            (1523685921779237 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1523685921779237 / 1000000000000000 : ℝ) ≤
            (1052830869885057566321 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (755034456414737 / 2000000000000000 : ℝ)) (q :=
      (1523685921779237 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_430_8 :
    Uω (aρ 8) (bρ 8) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(2633581035938500616407 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6974773532061733 / 20000000000000000 : ℝ) ≤
      (-(2633581035938500616407 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6974773532061733 / 20000000000000000 : ℝ) =
            (6974773532061733 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6974773532061733 / 5000000000000000 : ℝ) ≤
            (832154865561499383593 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3415057856579233 / 10000000000000000 : ℝ)) (q :=
      (6974773532061733 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_430_9 :
    Uω (aρ 9) (bρ 9) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(11804843234626741708411 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (191956220107513 / 625000000000000 : ℝ) ≤
      (-(11804843234626741708411 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (191956220107513 / 625000000000000 : ℝ) =
            (191956220107513 / 156250000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (191956220107513 / 156250000000000 : ℝ) ≤
            (2058100371373258291589 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (730962249079479 / 2500000000000000 : ℝ)) (q :=
      (191956220107513 / 625000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_430_10 :
    Uω (aρ 10) (bρ 10) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(13731068287134637534901 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (101327487089151 / 400000000000000 : ℝ) ≤
      (-(13731068287134637534901 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (101327487089151 / 400000000000000 : ℝ) =
            (101327487089151 / 100000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (101327487089151 / 100000000000000 : ℝ) ≤
            (131875318865362465099 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (44723666816601 / 200000000000000 : ℝ)) (q :=
      (101327487089151 / 400000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_430_11 :
    Uω (aρ 11) (bρ 11) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(17436868223522066249077 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3497489587483911 / 20000000000000000 : ℝ) ≤
      (-(17436868223522066249077 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3497489587483911 / 20000000000000000 : ℝ) =
            (3497489587483911 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3497489587483911 / 2500000000000000 : ℝ) ≤
            (3357547185477933750923 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1085775200061411 / 10000000000000000 : ℝ)) (q :=
      (3497489587483911 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_430_12 :
    Uω (aρ 12) (bρ 12) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_430_13 :
    Uω (aρ 13) (bρ 13) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_430_14 :
    Uω (aρ 14) (bρ 14) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_430_15 :
    Uω (aρ 15) (bρ 15) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_430_16 :
    Uω (aρ 16) (bρ 16) (1826522208027 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_430 :
    Uρ (1826522208027 / 4000000000000 : ℝ) ≤
      (-(5893848409619263390529 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1826522208027 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3990569544065491910013 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1826522208027 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1004315889034024038327 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1826522208027 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8142288165387616772923 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1826522208027 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4162126179034898229433 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1826522208027 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2152222395771836180129 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1826522208027 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9034301722152087805031 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1826522208027 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2412905031614942433679 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1826522208027 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2633581035938500616407 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1826522208027 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(11804843234626741708411 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1826522208027 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(13731068287134637534901 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1826522208027 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(17436868223522066249077 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1826522208027 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1826522208027 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1826522208027 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1826522208027 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1826522208027 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_430_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_431_1 :
    Uω (aρ 1) (bρ 1) (91458540389 / 200000000000 : ℝ) ≤
      (-(7966441127904307519531 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4508393942057693 / 10000000000000000 : ℝ) ≤
      (-(7966441127904307519531 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4508393942057693 / 10000000000000000 : ℝ) =
            (4508393942057693 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4508393942057693 / 2500000000000000 : ℝ) ≤
            (5896502478095692480469 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2254179041375193 / 5000000000000000 : ℝ)) (q :=
      (4508393942057693 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_431_2 :
    Uω (aρ 2) (bρ 2) (91458540389 / 200000000000 : ℝ) ≤
      (-(4009874934127237774067 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1121106052108097 / 2500000000000000 : ℝ) ≤
      (-(4009874934127237774067 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1121106052108097 / 2500000000000000 : ℝ) =
            (1121106052108097 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1121106052108097 / 625000000000000 : ℝ) ≤
            (2921596868872762225933 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (280261726750611 / 625000000000000 : ℝ)) (q :=
      (1121106052108097 / 2500000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_431_3 :
    Uω (aρ 3) (bρ 3) (91458540389 / 200000000000 : ℝ) ≤
      (-(4063674458732947917093 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8872861790209053 / 20000000000000000 : ℝ) ≤
      (-(4063674458732947917093 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8872861790209053 / 20000000000000000 : ℝ) =
            (8872861790209053 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8872861790209053 / 5000000000000000 : ℝ) ≤
            (2867797344267052082907 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4435597107704053 / 10000000000000000 : ℝ)) (q :=
      (8872861790209053 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_431_4 :
    Uω (aρ 4) (bρ 4) (91458540389 / 200000000000 : ℝ) ≤
      (-(1661806681693453128021 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4356555628234529 / 10000000000000000 : ℝ) ≤
      (-(1661806681693453128021 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4356555628234529 / 10000000000000000 : ℝ) =
            (4356555628234529 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4356555628234529 / 2500000000000000 : ℝ) ≤
            (1110782039506546871979 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2177070377514529 / 5000000000000000 : ℝ)) (q :=
      (4356555628234529 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_431_5 :
    Uω (aρ 5) (bρ 5) (91458540389 / 200000000000 : ℝ) ≤
      (-(8593216958152678828791 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (169379684831433 / 400000000000000 : ℝ) ≤
      (-(8593216958152678828791 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (169379684831433 / 400000000000000 : ℝ) =
            (169379684831433 / 100000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (169379684831433 / 100000000000000 : ℝ) ≤
            (5269726647847321171209 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (84564073189333 / 200000000000000 : ℝ)) (q :=
      (169379684831433 / 400000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_431_6 :
    Uω (aρ 6) (bρ 6) (91458540389 / 200000000000 : ℝ) ≤
      (-(9017911729525724670809 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8116841495226927 / 20000000000000000 : ℝ) ≤
      (-(9017911729525724670809 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8116841495226927 / 20000000000000000 : ℝ) =
            (8116841495226927 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8116841495226927 / 5000000000000000 : ℝ) ≤
            (4845031876474275329191 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4043301288261927 / 10000000000000000 : ℝ)) (q :=
      (8116841495226927 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_431_7 :
    Uω (aρ 7) (bρ 7) (91458540389 / 200000000000 : ℝ) ≤
      (-(38536384686198961727 / 40000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3815895907553403 / 10000000000000000 : ℝ) ≤
      (-(38536384686198961727 / 40000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3815895907553403 / 10000000000000000 : ℝ) =
            (3815895907553403 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3815895907553403 / 2500000000000000 : ℝ) ≤
            (16915389737801038273 / 40000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1890956494450903 / 5000000000000000 : ℝ)) (q :=
      (3815895907553403 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_431_8 :
    Uω (aρ 8) (bρ 8) (91458540389 / 200000000000 : ℝ) ≤
      (-(10514954581502450073807 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (436768528468821 / 1250000000000000 : ℝ) ≤
      (-(10514954581502450073807 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (436768528468821 / 1250000000000000 : ℝ) =
            (436768528468821 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (436768528468821 / 312500000000000 : ℝ) ≤
            (3347989024497549926193 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (427744910079517 / 1250000000000000 : ℝ)) (q :=
      (436768528468821 / 1250000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_431_9 :
    Uω (aρ 9) (bρ 9) (91458540389 / 200000000000 : ℝ) ≤
      (-(5891112448543313736457 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1539127076395919 / 5000000000000000 : ℝ) ≤
      (-(5891112448543313736457 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1539127076395919 / 5000000000000000 : ℝ) =
            (1539127076395919 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1539127076395919 / 1250000000000000 : ℝ) ≤
            (1040359354456686263543 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (732784189769669 / 2500000000000000 : ℝ)) (q :=
      (1539127076395919 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_431_10 :
    Uω (aρ 10) (bρ 10) (91458540389 / 200000000000 : ℝ) ≤
      (-(13701512890367255710259 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (635171296828693 / 2500000000000000 : ℝ) ≤
      (-(13701512890367255710259 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (635171296828693 / 2500000000000000 : ℝ) =
            (635171296828693 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (635171296828693 / 625000000000000 : ℝ) ≤
            (161430715632744289741 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (280569732702443 / 1250000000000000 : ℝ)) (q :=
      (635171296828693 / 2500000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_431_11 :
    Uω (aρ 11) (bρ 11) (91458540389 / 200000000000 : ℝ) ≤
      (-(17376292052470984479999 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (109960635615987 / 625000000000000 : ℝ) ≤
      (-(17376292052470984479999 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (109960635615987 / 625000000000000 : ℝ) = (109960635615987 / 78125000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (109960635615987 / 78125000000000 : ℝ) ≤
            (3418123356529015520001 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (137550556613323 / 1250000000000000 : ℝ)) (q :=
      (109960635615987 / 625000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_431_12 :
    Uω (aρ 12) (bρ 12) (91458540389 / 200000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_431_13 :
    Uω (aρ 13) (bρ 13) (91458540389 / 200000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_431_14 :
    Uω (aρ 14) (bρ 14) (91458540389 / 200000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_431_15 :
    Uω (aρ 15) (bρ 15) (91458540389 / 200000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_431_16 :
    Uω (aρ 16) (bρ 16) (91458540389 / 200000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_431 :
    Uρ (91458540389 / 200000000000 : ℝ) ≤
      (-(2942675685726804811747 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (91458540389 / 200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7966441127904307519531 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (91458540389 / 200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4009874934127237774067 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (91458540389 / 200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4063674458732947917093 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (91458540389 / 200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1661806681693453128021 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (91458540389 / 200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8593216958152678828791 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (91458540389 / 200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(9017911729525724670809 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (91458540389 / 200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(38536384686198961727 / 40000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (91458540389 / 200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(10514954581502450073807 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (91458540389 / 200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5891112448543313736457 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (91458540389 / 200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(13701512890367255710259 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (91458540389 / 200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(17376292052470984479999 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (91458540389 / 200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (91458540389 / 200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (91458540389 / 200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (91458540389 / 200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (91458540389 / 200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_431_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_432_1 :
    Uω (aρ 1) (bρ 1) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(7951764739322229786499 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (903003098806021 / 2000000000000000 : ℝ) ≤
      (-(7951764739322229786499 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (903003098806021 / 2000000000000000 : ℝ) =
            (903003098806021 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (903003098806021 / 500000000000000 : ℝ) ≤
            (5911178866677770213501 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (451497968731271 / 1000000000000000 : ℝ)) (q :=
      (903003098806021 / 2000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_432_2 :
    Uω (aρ 2) (bρ 2) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(1000624303876394457959 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1796418422656891 / 4000000000000000 : ℝ) ≤
      (-(1000624303876394457959 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1796418422656891 / 4000000000000000 : ℝ) =
            (1796418422656891 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1796418422656891 / 1000000000000000 : ℝ) ≤
            (732243646873605542041 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (898161965009391 / 2000000000000000 : ℝ)) (q :=
      (1796418422656891 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_432_3 :
    Uω (aρ 3) (bρ 3) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(31689187354433060421 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (8886107274633451 / 20000000000000000 : ℝ) ≤
      (-(31689187354433060421 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8886107274633451 / 20000000000000000 : ℝ) =
            (8886107274633451 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8886107274633451 / 5000000000000000 : ℝ) ≤
            (22462936106504439579 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4442221092745951 / 10000000000000000 : ℝ)) (q :=
      (8886107274633451 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_432_4 :
    Uω (aρ 4) (bρ 4) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(8293837610929466732469 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1745272317769101 / 4000000000000000 : ℝ) ≤
      (-(8293837610929466732469 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1745272317769101 / 4000000000000000 : ℝ) =
            (1745272317769101 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1745272317769101 / 1000000000000000 : ℝ) ≤
            (5569105995070533267531 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (872153917604601 / 2000000000000000 : ℝ)) (q :=
      (1745272317769101 / 4000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_432_5 :
    Uω (aρ 5) (bρ 5) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(4288784465369381867481 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8482246905349727 / 20000000000000000 : ℝ) ≤
      (-(4288784465369381867481 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8482246905349727 / 20000000000000000 : ℝ) =
            (8482246905349727 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8482246905349727 / 5000000000000000 : ℝ) ≤
            (2642687337630618132519 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4234844823862227 / 10000000000000000 : ℝ)) (q :=
      (8482246905349727 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_432_6 :
    Uω (aρ 6) (bρ 6) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(2250387189094811231179 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2032533483348397 / 5000000000000000 : ℝ) ≤
      (-(2250387189094811231179 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2032533483348397 / 5000000000000000 : ℝ) =
            (2032533483348397 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2032533483348397 / 1250000000000000 : ℝ) ≤
            (1215348712405188768821 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (506246528380761 / 1250000000000000 : ℝ)) (q :=
      (2032533483348397 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_432_7 :
    Uω (aρ 7) (bρ 7) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(4808301710880464751429 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1529030720176911 / 4000000000000000 : ℝ) ≤
      (-(4808301710880464751429 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1529030720176911 / 4000000000000000 : ℝ) =
            (1529030720176911 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1529030720176911 / 1000000000000000 : ℝ) ≤
            (2123170092119535248571 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (757730655059411 / 2000000000000000 : ℝ)) (q :=
      (1529030720176911 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_432_8 :
    Uω (aρ 8) (bρ 8) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(10495624041434001507059 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1750454568739631 / 5000000000000000 : ℝ) ≤
      (-(10495624041434001507059 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1750454568739631 / 5000000000000000 : ℝ) =
            (1750454568739631 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1750454568739631 / 1250000000000000 : ℝ) ≤
            (3367319564565998492941 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (214303725044439 / 625000000000000 : ℝ)) (q :=
      (1750454568739631 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_432_9 :
    Uω (aρ 9) (bρ 9) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(2939915678554231113423 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6170414413915467 / 20000000000000000 : ℝ) ≤
      (-(2939915678554231113423 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6170414413915467 / 20000000000000000 : ℝ) =
            (6170414413915467 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6170414413915467 / 5000000000000000 : ℝ) ≤
            (525820222945768886577 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2938421368027967 / 10000000000000000 : ℝ)) (q :=
      (6170414413915467 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_432_10 :
    Uω (aρ 10) (bρ 10) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(13672067484211088375381 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5096354726270043 / 20000000000000000 : ℝ) ≤
      (-(13672067484211088375381 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5096354726270043 / 20000000000000000 : ℝ) =
            (5096354726270043 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5096354726270043 / 5000000000000000 : ℝ) ≤
            (190876121788911624619 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2252920713877543 / 10000000000000000 : ℝ)) (q :=
      (5096354726270043 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_432_11 :
    Uω (aρ 11) (bρ 11) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(8658255887911272410519 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3539838466569181 / 20000000000000000 : ℝ) ≤
      (-(8658255887911272410519 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3539838466569181 / 20000000000000000 : ℝ) =
            (3539838466569181 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3539838466569181 / 2500000000000000 : ℝ) ≤
            (1738951816588727589481 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1114881080381681 / 10000000000000000 : ℝ)) (q :=
      (3539838466569181 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_432_12 :
    Uω (aρ 12) (bρ 12) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_432_13 :
    Uω (aρ 13) (bρ 13) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_432_14 :
    Uω (aρ 14) (bρ 14) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_432_15 :
    Uω (aρ 15) (bρ 15) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_432_16 :
    Uω (aρ 16) (bρ 16) (1831819407533 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_432 :
    Uρ (1831819407533 / 4000000000000 : ℝ) ≤
      (-(2938449730656911494861 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1831819407533 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(7951764739322229786499 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1831819407533 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1000624303876394457959 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1831819407533 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) * (-(31689187354433060421 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1831819407533 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8293837610929466732469 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1831819407533 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4288784465369381867481 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1831819407533 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2250387189094811231179 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1831819407533 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4808301710880464751429 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1831819407533 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(10495624041434001507059 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1831819407533 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2939915678554231113423 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1831819407533 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(13672067484211088375381 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1831819407533 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(8658255887911272410519 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1831819407533 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1831819407533 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1831819407533 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1831819407533 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1831819407533 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_432_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_433_1 :
    Uω (aρ 1) (bρ 1) (917234003643 / 2000000000000 : ℝ) ≤
      (-(1587421971831349571987 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9043274091696977 / 20000000000000000 : ℝ) ≤
      (-(1587421971831349571987 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9043274091696977 / 20000000000000000 : ℝ) =
            (9043274091696977 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9043274091696977 / 5000000000000000 : ℝ) ≤
            (1185166749368650428013 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4521601291566977 / 10000000000000000 : ℝ)) (q :=
      (9043274091696977 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_433_2 :
    Uω (aρ 2) (bρ 2) (917234003643 / 2000000000000 : ℝ) ≤
      (-(998782592033725802447 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4497667903824867 / 10000000000000000 : ℝ) ≤
      (-(998782592033725802447 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4497667903824867 / 10000000000000000 : ℝ) =
            (4497667903824867 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4497667903824867 / 2500000000000000 : ℝ) ≤
            (734085358716274197553 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2248716010014867 / 5000000000000000 : ℝ)) (q :=
      (4497667903824867 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_433_3 :
    Uω (aρ 3) (bρ 3) (917234003643 / 2000000000000 : ℝ) ≤
      (-(8097537234734476602597 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8899352751657329 / 20000000000000000 : ℝ) ≤
      (-(8097537234734476602597 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8899352751657329 / 20000000000000000 : ℝ) =
            (8899352751657329 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8899352751657329 / 5000000000000000 : ℝ) ≤
            (5765406371265523397403 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4448845070387329 / 10000000000000000 : ℝ)) (q :=
      (8899352751657329 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_433_4 :
    Uω (aρ 4) (bρ 4) (917234003643 / 2000000000000 : ℝ) ≤
      (-(8278664895044969696437 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (873961189897237 / 2000000000000000 : ℝ) ≤
      (-(8278664895044969696437 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (873961189897237 / 2000000000000000 : ℝ) =
            (873961189897237 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (873961189897237 / 500000000000000 : ℝ) ≤
            (5584278710955030303563 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (436739839876737 / 1000000000000000 : ℝ)) (q :=
      (873961189897237 / 2000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_433_5 :
    Uω (aρ 5) (bρ 5) (917234003643 / 2000000000000 : ℝ) ≤
      (-(4280972711764913015427 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4247754753818727 / 10000000000000000 : ℝ) ≤
      (-(4280972711764913015427 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4247754753818727 / 10000000000000000 : ℝ) =
            (4247754753818727 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4247754753818727 / 2500000000000000 : ℝ) ≤
            (2650499091235086984573 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2120742963383727 / 5000000000000000 : ℝ)) (q :=
      (4247754753818727 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_433_6 :
    Uω (aρ 6) (bρ 6) (917234003643 / 2000000000000 : ℝ) ≤
      (-(8985212713119600161899 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (325737048382469 / 800000000000000 : ℝ) ≤
      (-(8985212713119600161899 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (325737048382469 / 800000000000000 : ℝ) =
            (325737048382469 / 200000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (325737048382469 / 200000000000000 : ℝ) ≤
            (4877730892880399838101 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (162265720153269 / 400000000000000 : ℝ)) (q :=
      (325737048382469 / 800000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_433_7 :
    Uω (aρ 7) (bρ 7) (917234003643 / 2000000000000 : ℝ) ≤
      (-(2399785441056326483251 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3829257484234693 / 10000000000000000 : ℝ) ≤
      (-(2399785441056326483251 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3829257484234693 / 10000000000000000 : ℝ) =
            (3829257484234693 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3829257484234693 / 2500000000000000 : ℝ) ≤
            (1065950460443673516749 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1897696571749693 / 5000000000000000 : ℝ)) (q :=
      (3829257484234693 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_433_8 :
    Uω (aρ 8) (bρ 8) (917234003643 / 2000000000000 : ℝ) ≤
      (-(1309541545056140365681 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3507669498542777 / 10000000000000000 : ℝ) ≤
      (-(1309541545056140365681 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3507669498542777 / 10000000000000000 : ℝ) =
            (3507669498542777 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3507669498542777 / 2500000000000000 : ℝ) ≤
            (423326405693859634319 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1717879411727777 / 5000000000000000 : ℝ)) (q :=
      (3507669498542777 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_433_9 :
    Uω (aρ 9) (bρ 9) (917234003643 / 2000000000000 : ℝ) ≤
      (-(11737156383840359370543 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (123686347836671 / 400000000000000 : ℝ) ≤
      (-(11737156383840359370543 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (123686347836671 / 400000000000000 : ℝ) =
            (123686347836671 / 100000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (123686347836671 / 100000000000000 : ℝ) ≤
            (2125787222159640629457 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (58914056931271 / 200000000000000 : ℝ)) (q :=
      (123686347836671 / 400000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_433_10 :
    Uω (aρ 10) (bρ 10) (917234003643 / 2000000000000 : ℝ) ≤
      (-(6821365551110305732887 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2555663769420043 / 10000000000000000 : ℝ) ≤
      (-(6821365551110305732887 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2555663769420043 / 10000000000000000 : ℝ) =
            (2555663769420043 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2555663769420043 / 2500000000000000 : ℝ) ≤
            (110106251889694267113 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1130636013532543 / 5000000000000000 : ℝ)) (q :=
      (2555663769420043 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_433_11 :
    Uω (aρ 11) (bρ 11) (917234003643 / 2000000000000 : ℝ) ≤
      (-(8628749439416123003623 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3560789838101703 / 20000000000000000 : ℝ) ≤
      (-(8628749439416123003623 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3560789838101703 / 20000000000000000 : ℝ) =
            (3560789838101703 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3560789838101703 / 2500000000000000 : ℝ) ≤
            (1768458265083876996377 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1129210952531703 / 10000000000000000 : ℝ)) (q :=
      (3560789838101703 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_433_12 :
    Uω (aρ 12) (bρ 12) (917234003643 / 2000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_433_13 :
    Uω (aρ 13) (bρ 13) (917234003643 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_433_14 :
    Uω (aρ 14) (bρ 14) (917234003643 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_433_15 :
    Uω (aρ 15) (bρ 15) (917234003643 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_433_16 :
    Uω (aρ 16) (bρ 16) (917234003643 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_433 :
    Uρ (917234003643 / 2000000000000 : ℝ) ≤
      (-(2934245738353066200817 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (917234003643 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1587421971831349571987 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (917234003643 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(998782592033725802447 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (917234003643 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(8097537234734476602597 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (917234003643 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(8278664895044969696437 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (917234003643 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4280972711764913015427 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (917234003643 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(8985212713119600161899 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (917234003643 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2399785441056326483251 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (917234003643 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1309541545056140365681 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (917234003643 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(11737156383840359370543 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (917234003643 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6821365551110305732887 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (917234003643 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(8628749439416123003623 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (917234003643 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (917234003643 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (917234003643 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (917234003643 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (917234003643 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_433_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_434_1 :
    Uω (aρ 1) (bρ 1) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(3961238212228721508109 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56603232468919 / 125000000000000 : ℝ) ≤
      (-(3961238212228721508109 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56603232468919 / 125000000000000 : ℝ) = (56603232468919 / 31250000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56603232468919 / 31250000000000 : ℝ) ≤
            (2970233590771278491891 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (226411144775727 / 500000000000000 : ℝ)) (q :=
      (56603232468919 / 125000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_434_2 :
    Uω (aρ 2) (bρ 2) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(7975548720041766875749 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9008579499969673 / 20000000000000000 : ℝ) ≤
      (-(7975548720041766875749 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9008579499969673 / 20000000000000000 : ℝ) =
            (9008579499969673 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9008579499969673 / 5000000000000000 : ℝ) ≤
            (5887394885958233124251 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4504054212967173 / 10000000000000000 : ℝ)) (q :=
      (9008579499969673 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_434_3 :
    Uω (aρ 3) (bρ 3) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(4041332333650775896749 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1782519644262739 / 4000000000000000 : ℝ) ≤
      (-(4041332333650775896749 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1782519644262739 / 4000000000000000 : ℝ) =
            (1782519644262739 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1782519644262739 / 1000000000000000 : ℝ) ≤
            (2890139469349224103251 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (891093808132239 / 2000000000000000 : ℝ)) (q :=
      (1782519644262739 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_434_4 :
    Uω (aρ 4) (bρ 4) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(4131757595361709041687 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (875286218695081 / 2000000000000000 : ℝ) ≤
      (-(4131757595361709041687 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (875286218695081 / 2000000000000000 : ℝ) =
            (875286218695081 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (875286218695081 / 500000000000000 : ℝ) ≤
            (2799714207638290958313 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (437402718736331 / 1000000000000000 : ℝ)) (q :=
      (875286218695081 / 2000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_434_5 :
    Uω (aρ 5) (bρ 5) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(1709269271915022459983 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1701754409744643 / 4000000000000000 : ℝ) ≤
      (-(1709269271915022459983 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1701754409744643 / 4000000000000000 : ℝ) =
            (1701754409744643 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1701754409744643 / 1000000000000000 : ℝ) ≤
            (1063319449284977540017 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (849625393694143 / 2000000000000000 : ℝ)) (q :=
      (1701754409744643 / 4000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_434_6 :
    Uω (aρ 6) (bρ 6) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(8968903510601811328087 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4078359162264601 / 10000000000000000 : ℝ) ≤
      (-(8968903510601811328087 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4078359162264601 / 10000000000000000 : ℝ) =
            (4078359162264601 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4078359162264601 / 2500000000000000 : ℝ) ≤
            (4894040095398188671913 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2031656809708351 / 5000000000000000 : ℝ)) (q :=
      (4078359162264601 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_434_7 :
    Uω (aρ 7) (bρ 7) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(4790855543348075876977 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1534375184017047 / 4000000000000000 : ℝ) ≤
      (-(4790855543348075876977 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1534375184017047 / 4000000000000000 : ℝ) =
            (1534375184017047 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1534375184017047 / 1000000000000000 : ℝ) ≤
            (2140616259651924123023 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (760426519146547 / 2000000000000000 : ℝ)) (q :=
      (1534375184017047 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_434_8 :
    Uω (aρ 8) (bρ 8) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(10457079376504312439157 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7028858628479507 / 20000000000000000 : ℝ) ≤
      (-(10457079376504312439157 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7028858628479507 / 20000000000000000 : ℝ) =
            (7028858628479507 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7028858628479507 / 5000000000000000 : ℝ) ≤
            (3405864229495687560843 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3442656955467007 / 10000000000000000 : ℝ)) (q :=
      (7028858628479507 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_434_9 :
    Uω (aρ 9) (bρ 9) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(2928676401593483871823 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3099108631247451 / 10000000000000000 : ℝ) ≤
      (-(2928676401593483871823 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3099108631247451 / 10000000000000000 : ℝ) =
            (3099108631247451 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3099108631247451 / 2500000000000000 : ℝ) ≤
            (537059499906516128177 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1476490608921201 / 5000000000000000 : ℝ)) (q :=
      (3099108631247451 / 10000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_434_10 :
    Uω (aρ 10) (bρ 10) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(13613502791977963723017 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5126288939717917 / 20000000000000000 : ℝ) ≤
      (-(13613502791977963723017 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5126288939717917 / 20000000000000000 : ℝ) =
            (5126288939717917 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5126288939717917 / 5000000000000000 : ℝ) ≤
            (249440814022036276983 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2269611928560417 / 10000000000000000 : ℝ)) (q :=
      (5126288939717917 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_434_11 :
    Uω (aρ 11) (bρ 11) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(3439845305272605237621 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1790799986019643 / 10000000000000000 : ℝ) ≤
      (-(3439845305272605237621 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1790799986019643 / 10000000000000000 : ℝ) =
            (1790799986019643 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1790799986019643 / 1250000000000000 : ℝ) ≤
            (719037776527394762379 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (571699793543393 / 5000000000000000 : ℝ)) (q :=
      (1790799986019643 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_434_12 :
    Uω (aρ 12) (bρ 12) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_434_13 :
    Uω (aρ 13) (bρ 13) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_434_14 :
    Uω (aρ 14) (bρ 14) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_434_15 :
    Uω (aρ 15) (bρ 15) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_434_16 :
    Uω (aρ 16) (bρ 16) (1837116607039 / 4000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_434 :
    Uρ (1837116607039 / 4000000000000 : ℝ) ≤
      (-(1172025256447057801947 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1837116607039 / 4000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3961238212228721508109 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1837116607039 / 4000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(7975548720041766875749 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1837116607039 / 4000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4041332333650775896749 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1837116607039 / 4000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4131757595361709041687 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1837116607039 / 4000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1709269271915022459983 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1837116607039 / 4000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(8968903510601811328087 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1837116607039 / 4000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4790855543348075876977 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1837116607039 / 4000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(10457079376504312439157 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1837116607039 / 4000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2928676401593483871823 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1837116607039 / 4000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(13613502791977963723017 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1837116607039 / 4000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3439845305272605237621 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1837116607039 / 4000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1837116607039 / 4000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1837116607039 / 4000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1837116607039 / 4000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1837116607039 / 4000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_434_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_435_1 :
    Uω (aρ 1) (bρ 1) (229970650849 / 500000000000 : ℝ) ≤
      (-(3953932186274931808203 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9069760298051741 / 20000000000000000 : ℝ) ≤
      (-(3953932186274931808203 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9069760298051741 / 20000000000000000 : ℝ) =
            (9069760298051741 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9069760298051741 / 5000000000000000 : ℝ) ≤
            (2977539616725068191797 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4534844499156741 / 10000000000000000 : ℝ)) (q :=
      (9069760298051741 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_435_2 :
    Uω (aρ 2) (bρ 2) (229970650849 / 500000000000 : ℝ) ≤
      (-(1592171663724093181691 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9021823190253283 / 20000000000000000 : ℝ) ≤
      (-(1592171663724093181691 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9021823190253283 / 20000000000000000 : ℝ) =
            (9021823190253283 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9021823190253283 / 5000000000000000 : ℝ) ≤
            (1180417057475906818309 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4510676403868283 / 10000000000000000 : ℝ)) (q :=
      (9021823190253283 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_435_3 :
    Uω (aρ 3) (bρ 3) (229970650849 / 500000000000 : ℝ) ≤
      (-(1008476774321000244151 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8925843683635361 / 20000000000000000 : ℝ) ≤
      (-(1008476774321000244151 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8925843683635361 / 20000000000000000 : ℝ) =
            (8925843683635361 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8925843683635361 / 5000000000000000 : ℝ) ≤
            (724391176428999755849 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4462093003600361 / 10000000000000000 : ℝ)) (q :=
      (8925843683635361 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_435_4 :
    Uω (aρ 4) (bρ 4) (229970650849 / 500000000000 : ℝ) ≤
      (-(1031048553524197032573 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (876611245288137 / 2000000000000000 : ℝ) ≤
      (-(1031048553524197032573 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (876611245288137 / 2000000000000000 : ℝ) =
            (876611245288137 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (876611245288137 / 500000000000000 : ℝ) ≤
            (701819397225802967427 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (438065595391137 / 1000000000000000 : ℝ)) (q :=
      (876611245288137 / 2000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_435_5 :
    Uω (aρ 5) (bρ 5) (229970650849 / 500000000000 : ℝ) ≤
      (-(8530771662286591006543 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8522034528893589 / 20000000000000000 : ℝ) ≤
      (-(8530771662286591006543 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8522034528893589 / 20000000000000000 : ℝ) =
            (8522034528893589 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8522034528893589 / 5000000000000000 : ℝ) ≤
            (5332171943713408993457 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4254767949258589 / 10000000000000000 : ℝ)) (q :=
      (8522034528893589 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_435_6 :
    Uω (aρ 6) (bρ 6) (229970650849 / 500000000000 : ℝ) ≤
      (-(8952621060125969732773 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1021251284886079 / 2500000000000000 : ℝ) ≤
      (-(8952621060125969732773 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1021251284886079 / 2500000000000000 : ℝ) =
            (1021251284886079 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1021251284886079 / 625000000000000 : ℝ) ≤
            (4910322545874030267227 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (127187002331051 / 312500000000000 : ℝ)) (q :=
      (1021251284886079 / 2500000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_435_7 :
    Uω (aρ 7) (bρ 7) (229970650849 / 500000000000 : ℝ) ≤
      (-(9564311277543446347187 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24016363931063 / 62500000000000 : ℝ) ≤
      (-(9564311277543446347187 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24016363931063 / 62500000000000 : ℝ) = (24016363931063 / 15625000000000 : ℝ) / 2 ^ 2 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24016363931063 / 15625000000000 : ℝ) ≤
            (4298632328456553652813 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (95221790855129 / 250000000000000 : ℝ)) (q :=
      (24016363931063 / 62500000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_435_8 :
    Uω (aρ 8) (bρ 8) (229970650849 / 500000000000 : ℝ) ≤
      (-(10437864928602727238181 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3521188587841929 / 10000000000000000 : ℝ) ≤
      (-(10437864928602727238181 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3521188587841929 / 10000000000000000 : ℝ) =
            (3521188587841929 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3521188587841929 / 2500000000000000 : ℝ) ≤
            (3425078677397272761819 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1724777001644429 / 5000000000000000 : ℝ)) (q :=
      (3521188587841929 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_435_9 :
    Uω (aρ 9) (bρ 9) (229970650849 / 500000000000 : ℝ) ≤
      (-(11692310084797909684141 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1553028512204731 / 5000000000000000 : ℝ) ≤
      (-(11692310084797909684141 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1553028512204731 / 5000000000000000 : ℝ) =
            (1553028512204731 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1553028512204731 / 1250000000000000 : ℝ) ≤
            (2170633521202090315859 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (740064126195981 / 2500000000000000 : ℝ)) (q :=
      (1553028512204731 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_435_10 :
    Uω (aρ 10) (bρ 10) (229970650849 / 500000000000 : ℝ) ≤
      (-(13584381614807102870191 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2570619527121791 / 10000000000000000 : ℝ) ≤
      (-(13584381614807102870191 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2570619527121791 / 10000000000000000 : ℝ) =
            (2570619527121791 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2570619527121791 / 2500000000000000 : ℝ) ≤
            (278561991192897129809 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1138970271851791 / 5000000000000000 : ℝ)) (q :=
      (2570619527121791 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_435_11 :
    Uω (aρ 11) (bρ 11) (229970650849 / 500000000000 : ℝ) ≤
      (-(1714166942718427090193 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (360227406247933 / 2000000000000000 : ℝ) ≤
      (-(1714166942718427090193 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (360227406247933 / 2000000000000000 : ℝ) =
            (360227406247933 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (360227406247933 / 250000000000000 : ℝ) ≤
            (365274598181572909807 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (115745217814433 / 1000000000000000 : ℝ)) (q :=
      (360227406247933 / 2000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_435_12 :
    Uω (aρ 12) (bρ 12) (229970650849 / 500000000000 : ℝ) ≤
      (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_12]) (by norm_num [bρ_12])]; exact Lmid_12

lemma U_435_13 :
    Uω (aρ 13) (bρ 13) (229970650849 / 500000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_435_14 :
    Uω (aρ 14) (bρ 14) (229970650849 / 500000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_435_15 :
    Uω (aρ 15) (bρ 15) (229970650849 / 500000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_435_16 :
    Uω (aρ 16) (bρ 16) (229970650849 / 500000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_435 :
    Uρ (229970650849 / 500000000000 : ℝ) ≤
      (-(1170360560847339253183 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (229970650849 / 500000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3953932186274931808203 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (229970650849 / 500000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1592171663724093181691 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (229970650849 / 500000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1008476774321000244151 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (229970650849 / 500000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1031048553524197032573 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (229970650849 / 500000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(8530771662286591006543 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (229970650849 / 500000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(8952621060125969732773 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (229970650849 / 500000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(9564311277543446347187 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (229970650849 / 500000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(10437864928602727238181 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (229970650849 / 500000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(11692310084797909684141 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (229970650849 / 500000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(13584381614807102870191 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (229970650849 / 500000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1714166942718427090193 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (229970650849 / 500000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(640305991230515290559 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (229970650849 / 500000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (229970650849 / 500000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (229970650849 / 500000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (229970650849 / 500000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_435_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
