/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U40) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_484_1 :
    Uω (aρ 1) (bρ 1) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(49367704558822225637 / 78125000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4252618551908039 / 8000000000000000 : ℝ) ≤
      (-(49367704558822225637 / 78125000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4252618551908039 / 8000000000000000 : ℝ) =
            (4252618551908039 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4252618551908039 / 4000000000000000 : ℝ) ≤
            (4784418902115274363 / 78125000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (265787138851083 / 500000000000000 : ℝ)) (q :=
      (4252618551908039 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_484_2 :
    Uω (aρ 2) (bρ 2) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(3182100974805846120097 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21167336425781133 / 40000000000000000 : ℝ) ≤
      (-(3182100974805846120097 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21167336425781133 / 40000000000000000 : ℝ) =
            (21167336425781133 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21167336425781133 / 20000000000000000 : ℝ) ≤
            (283634926694153879903 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5291633622652129 / 10000000000000000 : ℝ)) (q :=
      (21167336425781133 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_484_3 :
    Uω (aρ 3) (bρ 3) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(129102657264926025039 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20975732358603649 / 40000000000000000 : ℝ) ≤
      (-(129102657264926025039 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20975732358603649 / 40000000000000000 : ℝ) =
            (20975732358603649 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20975732358603649 / 20000000000000000 : ℝ) ≤
            (9526778795073974961 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5243227695413387 / 10000000000000000 : ℝ)) (q :=
      (20975732358603649 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_484_4 :
    Uω (aρ 4) (bρ 4) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(1652035360447789156013 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20657228563920487 / 40000000000000000 : ℝ) ≤
      (-(1652035360447789156013 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20657228563920487 / 40000000000000000 : ℝ) =
            (20657228563920487 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20657228563920487 / 20000000000000000 : ℝ) ≤
            (80832590302210843987 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2581134989568403 / 5000000000000000 : ℝ)) (q :=
      (20657228563920487 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_484_5 :
    Uω (aρ 5) (bρ 5) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(1369217880496384891111 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20171495895740663 / 40000000000000000 : ℝ) ≤
      (-(1369217880496384891111 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20171495895740663 / 40000000000000000 : ℝ) =
            (20171495895740663 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20171495895740663 / 20000000000000000 : ℝ) ≤
            (17076480103615108889 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2518796782190947 / 5000000000000000 : ℝ)) (q :=
      (20171495895740663 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_484_6 :
    Uω (aρ 6) (bρ 6) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(3599191382945151200059 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3894647850461749 / 8000000000000000 : ℝ) ≤
      (-(3599191382945151200059 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3894647850461749 / 8000000000000000 : ℝ) =
            (3894647850461749 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3894647850461749 / 2000000000000000 : ℝ) ≤
            (3332280420054848799941 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (971141123561187 / 2000000000000000 : ℝ)) (q :=
      (3894647850461749 / 8000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_484_7 :
    Uω (aρ 7) (bρ 7) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(3850961478539558197473 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3703392329638651 / 8000000000000000 : ℝ) ≤
      (-(3850961478539558197473 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3703392329638651 / 8000000000000000 : ℝ) =
            (3703392329638651 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3703392329638651 / 2000000000000000 : ℝ) ≤
            (3080510324460441802527 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (460122819650819 / 1000000000000000 : ℝ)) (q :=
      (3703392329638651 / 8000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_484_8 :
    Uω (aρ 8) (bρ 8) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(8404279351985589500927 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17261032743991579 / 40000000000000000 : ℝ) ≤
      (-(8404279351985589500927 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17261032743991579 / 40000000000000000 : ℝ) =
            (17261032743991579 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17261032743991579 / 10000000000000000 : ℝ) ≤
            (5458664254014410499073 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (532100674468419 / 1250000000000000 : ℝ)) (q :=
      (17261032743991579 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_484_9 :
    Uω (aρ 9) (bρ 9) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(4686124003779445722807 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15668536435040589 / 40000000000000000 : ℝ) ≤
      (-(4686124003779445722807 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15668536435040589 / 40000000000000000 : ℝ) =
            (15668536435040589 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15668536435040589 / 10000000000000000 : ℝ) ≤
            (2245347799220554277193 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3801522869631857 / 10000000000000000 : ℝ)) (q :=
      (15668536435040589 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_484_10 :
    Uω (aρ 10) (bρ 10) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(10716342206642952717589 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2739587387332633 / 8000000000000000 : ℝ) ≤
      (-(10716342206642952717589 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2739587387332633 / 8000000000000000 : ℝ) =
            (2739587387332633 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2739587387332633 / 2000000000000000 : ℝ) ≤
            (3146601399357047282411 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (640956430787629 / 2000000000000000 : ℝ)) (q :=
      (2739587387332633 / 8000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_484_11 :
    Uω (aρ 11) (bρ 11) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(6340492533616705606711 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11254645163716239 / 40000000000000000 : ℝ) ≤
      (-(6340492533616705606711 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11254645163716239 / 40000000000000000 : ℝ) =
            (11254645163716239 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11254645163716239 / 10000000000000000 : ℝ) ≤
            (590979269383294393289 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1200806446834841 / 5000000000000000 : ℝ)) (q :=
      (11254645163716239 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_484_12 :
    Uω (aρ 12) (bρ 12) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(8171995575870492649569 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1560556402166403 / 8000000000000000 : ℝ) ≤
      (-(8171995575870492649569 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1560556402166403 / 8000000000000000 : ℝ) =
            (1560556402166403 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1560556402166403 / 1000000000000000 : ℝ) ≤
            (2225212128629507350431 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (109938141391257 / 1000000000000000 : ℝ)) (q :=
      (1560556402166403 / 8000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_484_13 :
    Uω (aρ 13) (bρ 13) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_484_14 :
    Uω (aρ 14) (bρ 14) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_484_15 :
    Uω (aρ 15) (bρ 15) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_484_16 :
    Uω (aρ 16) (bρ 16) (17216962626667 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_484 :
    Uρ (17216962626667 / 32000000000000 : ℝ) ≤
      (-(9789045597887444270013 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (17216962626667 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(49367704558822225637 / 78125000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (17216962626667 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3182100974805846120097 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (17216962626667 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(129102657264926025039 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (17216962626667 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1652035360447789156013 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (17216962626667 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1369217880496384891111 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (17216962626667 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3599191382945151200059 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (17216962626667 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3850961478539558197473 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (17216962626667 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8404279351985589500927 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (17216962626667 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4686124003779445722807 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (17216962626667 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10716342206642952717589 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (17216962626667 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6340492533616705606711 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (17216962626667 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(8171995575870492649569 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (17216962626667 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (17216962626667 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (17216962626667 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (17216962626667 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_484_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_485_1 :
    Uω (aρ 1) (bρ 1) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(6307332166479452008709 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85152230211353759 / 160000000000000000 : ℝ) ≤
      (-(6307332166479452008709 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85152230211353759 / 160000000000000000 : ℝ) =
            (85152230211353759 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85152230211353759 / 80000000000000000 : ℝ) ≤
            (624139636520547991291 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2660992005505899 / 5000000000000000 : ℝ)) (q :=
      (85152230211353759 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_485_2 :
    Uω (aρ 2) (bρ 2) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(6352414503277472699569 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84769208084547807 / 160000000000000000 : ℝ) ≤
      (-(6352414503277472699569 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84769208084547807 / 160000000000000000 : ℝ) =
            (84769208084547807 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84769208084547807 / 80000000000000000 : ℝ) ≤
            (579057299722527300431 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2648937628835527 / 5000000000000000 : ℝ)) (q :=
      (84769208084547807 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_485_3 :
    Uω (aρ 3) (bρ 3) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(644323666027210507003 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84002801455396183 / 160000000000000000 : ℝ) ≤
      (-(644323666027210507003 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84002801455396183 / 160000000000000000 : ℝ) =
            (84002801455396183 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84002801455396183 / 80000000000000000 : ℝ) ≤
            (48823514272789492997 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5249470535377101 / 10000000000000000 : ℝ)) (q :=
      (84002801455396183 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_485_4 :
    Uω (aρ 4) (bρ 4) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(1319211758427744412517 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (82728812217343327 / 160000000000000000 : ℝ) ≤
      (-(1319211758427744412517 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (82728812217343327 / 160000000000000000 : ℝ) =
            (82728812217343327 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (82728812217343327 / 80000000000000000 : ℝ) ≤
            (67082602172255587483 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2584258030842747 / 5000000000000000 : ℝ)) (q :=
      (82728812217343327 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_485_5 :
    Uω (aρ 5) (bρ 5) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(3416853956054903156221 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (80785946727717703 / 160000000000000000 : ℝ) ≤
      (-(3416853956054903156221 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (80785946727717703 / 160000000000000000 : ℝ) =
            (80785946727717703 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (80785946727717703 / 80000000000000000 : ℝ) ≤
            (48881945445096843779 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5043847794817291 / 10000000000000000 : ℝ)) (q :=
      (80785946727717703 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_485_6 :
    Uω (aρ 6) (bρ 6) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(1437107561212252026653 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (77993074486092727 / 160000000000000000 : ℝ) ≤
      (-(1437107561212252026653 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (77993074486092727 / 160000000000000000 : ℝ) =
            (77993074486092727 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (77993074486092727 / 40000000000000000 : ℝ) ≤
            (1335481159987747973347 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4861979139754169 / 10000000000000000 : ℝ)) (q :=
      (77993074486092727 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_485_7 :
    Uω (aρ 7) (bρ 7) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(7688368136445735574367 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14833662460930483 / 32000000000000000 : ℝ) ≤
      (-(7688368136445735574367 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14833662460930483 / 32000000000000000 : ℝ) =
            (14833662460930483 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14833662460930483 / 8000000000000000 : ℝ) ≤
            (6174575469554264425633 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (460754524783413 / 1000000000000000 : ℝ)) (q :=
      (14833662460930483 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_485_8 :
    Uω (aρ 8) (bρ 8) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(4194814386260065118497 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (69145358762895607 / 160000000000000000 : ℝ) ≤
      (-(4194814386260065118497 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (69145358762895607 / 160000000000000000 : ℝ) =
            (69145358762895607 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (69145358762895607 / 40000000000000000 : ℝ) ≤
            (2736657416739934881503 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4263217706454529 / 10000000000000000 : ℝ)) (q :=
      (69145358762895607 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_485_9 :
    Uω (aρ 9) (bρ 9) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(9355844753686533661381 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (62777036096304591 / 160000000000000000 : ℝ) ≤
      (-(9355844753686533661381 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (62777036096304591 / 160000000000000000 : ℝ) =
            (62777036096304591 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (62777036096304591 / 40000000000000000 : ℝ) ≤
            (4507098852313466338619 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (952035750372663 / 2500000000000000 : ℝ)) (q :=
      (62777036096304591 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_485_10 :
    Uω (aρ 10) (bρ 10) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(1337111150499449144981 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (54898437886583623 / 160000000000000000 : ℝ) ≤
      (-(1337111150499449144981 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (54898437886583623 / 160000000000000000 : ℝ) =
            (54898437886583623 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (54898437886583623 / 40000000000000000 : ℝ) ≤
            (395756800250550855019 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3211877258770531 / 10000000000000000 : ℝ)) (q :=
      (54898437886583623 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_485_11 :
    Uω (aρ 11) (bρ 11) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(6327521456465553556581 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45135520169009759 / 160000000000000000 : ℝ) ≤
      (-(6327521456465553556581 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45135520169009759 / 160000000000000000 : ℝ) =
            (45135520169009759 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45135520169009759 / 40000000000000000 : ℝ) ≤
            (603950346534446443419 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1204994585139399 / 5000000000000000 : ℝ)) (q :=
      (45135520169009759 / 160000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_485_12 :
    Uω (aρ 12) (bρ 12) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(407190663593972207153 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6277509011950307 / 32000000000000000 : ℝ) ≤
      (-(407190663593972207153 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6277509011950307 / 32000000000000000 : ℝ) =
            (6277509011950307 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6277509011950307 / 4000000000000000 : ℝ) ≤
            (112669721631027792847 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (27879809457663 / 250000000000000 : ℝ)) (q :=
      (6277509011950307 / 32000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_485_13 :
    Uω (aρ 13) (bρ 13) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_485_14 :
    Uω (aρ 14) (bρ 14) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_485_15 :
    Uω (aρ 15) (bρ 15) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_485_16 :
    Uω (aρ 16) (bρ 16) (68947737388703 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_485 :
    Uρ (68947737388703 / 128000000000000 : ℝ) ≤
      (-(4886962101695595637819 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (68947737388703 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6307332166479452008709 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (68947737388703 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6352414503277472699569 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (68947737388703 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(644323666027210507003 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (68947737388703 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1319211758427744412517 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (68947737388703 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3416853956054903156221 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (68947737388703 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1437107561212252026653 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (68947737388703 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7688368136445735574367 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (68947737388703 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4194814386260065118497 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (68947737388703 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(9355844753686533661381 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (68947737388703 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1337111150499449144981 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (68947737388703 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6327521456465553556581 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (68947737388703 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(407190663593972207153 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (68947737388703 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (68947737388703 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (68947737388703 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (68947737388703 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_485_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_486_1 :
    Uω (aρ 1) (bρ 1) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(786951487770795011317 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42626044691604937 / 80000000000000000 : ℝ) ≤
      (-(786951487770795011317 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42626044691604937 / 80000000000000000 : ℝ) =
            (42626044691604937 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42626044691604937 / 40000000000000000 : ℝ) ≤
            (79482487604204988683 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1332056311208707 / 2500000000000000 : ℝ)) (q :=
      (42626044691604937 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_486_2 :
    Uω (aρ 2) (bρ 2) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(792580117002899229761 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42434535228538897 / 80000000000000000 : ℝ) ≤
      (-(792580117002899229761 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42434535228538897 / 80000000000000000 : ℝ) =
            (42434535228538897 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42434535228538897 / 40000000000000000 : ℝ) ≤
            (73853858372100770239 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2652058445789159 / 5000000000000000 : ℝ)) (q :=
      (42434535228538897 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_486_3 :
    Uω (aρ 3) (bρ 3) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(6431354596238415003153 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42051336722252341 / 80000000000000000 : ℝ) ≤
      (-(6431354596238415003153 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42051336722252341 / 80000000000000000 : ℝ) =
            (42051336722252341 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42051336722252341 / 40000000000000000 : ℝ) ≤
            (500117206761584996847 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5255713371356679 / 10000000000000000 : ℝ)) (q :=
      (42051336722252341 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_486_4 :
    Uω (aρ 4) (bρ 4) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(3291995367689427495473 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41414355042013509 / 80000000000000000 : ℝ) ≤
      (-(3291995367689427495473 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41414355042013509 / 80000000000000000 : ℝ) =
            (41414355042013509 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41414355042013509 / 40000000000000000 : ℝ) ≤
            (173740533810572504527 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5174762132361971 / 10000000000000000 : ℝ)) (q :=
      (41414355042013509 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_486_5 :
    Uω (aρ 5) (bρ 5) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(1705335441222945381761 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40442954806902749 / 80000000000000000 : ℝ) ≤
      (-(1705335441222945381761 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (40442954806902749 / 80000000000000000 : ℝ) =
            (40442954806902749 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40442954806902749 / 40000000000000000 : ℝ) ≤
            (27532509527054618239 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5050101992919281 / 10000000000000000 : ℝ)) (q :=
      (40442954806902749 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_486_6 :
    Uω (aρ 6) (bρ 6) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(1793177352395991703339 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39046595648734657 / 80000000000000000 : ℝ) ≤
      (-(1793177352395991703339 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39046595648734657 / 80000000000000000 : ℝ) =
            (39046595648734657 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39046595648734657 / 20000000000000000 : ℝ) ≤
            (1672558549104008296661 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2434126289258629 / 5000000000000000 : ℝ)) (q :=
      (39046595648734657 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_486_7 :
    Uω (aρ 7) (bρ 7) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(7674831886757274297583 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37134388182037397 / 80000000000000000 : ℝ) ≤
      (-(7674831886757274297583 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (37134388182037397 / 80000000000000000 : ℝ) =
            (37134388182037397 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37134388182037397 / 20000000000000000 : ℝ) ≤
            (6188111719242725702417 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4613862092602943 / 10000000000000000 : ℝ)) (q :=
      (37134388182037397 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_486_8 :
    Uω (aρ 8) (bρ 8) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(837500021158687506521 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34623291246055249 / 80000000000000000 : ℝ) ≤
      (-(837500021158687506521 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (34623291246055249 / 80000000000000000 : ℝ) =
            (34623291246055249 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34623291246055249 / 20000000000000000 : ℝ) ≤
            (548794339441312493479 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2134814754973703 / 5000000000000000 : ℝ)) (q :=
      (34623291246055249 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_486_9 :
    Uω (aρ 9) (bρ 9) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(29185843712424599397 / 31250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (31439958115515213 / 80000000000000000 : ℝ) ≤
      (-(29185843712424599397 / 31250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (31439958115515213 / 80000000000000000 : ℝ) =
            (31439958115515213 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (31439958115515213 / 20000000000000000 : ℝ) ≤
            (14135855056325400603 / 31250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3814761855672397 / 10000000000000000 : ℝ)) (q :=
      (31439958115515213 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_486_10 :
    Uω (aρ 10) (bρ 10) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(10677479115380574000047 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27502549861650857 / 80000000000000000 : ℝ) ≤
      (-(10677479115380574000047 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27502549861650857 / 80000000000000000 : ℝ) =
            (27502549861650857 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27502549861650857 / 20000000000000000 : ℝ) ≤
            (3185464490619425999953 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (804742206425327 / 2500000000000000 : ℝ)) (q :=
      (27502549861650857 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_486_11 :
    Uω (aρ 11) (bρ 11) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(2525838139806847648551 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22626178219963501 / 80000000000000000 : ℝ) ≤
      (-(2525838139806847648551 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22626178219963501 / 80000000000000000 : ℝ) =
            (22626178219963501 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22626178219963501 / 20000000000000000 : ℝ) ≤
            (246750581393152351449 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2418352541484469 / 10000000000000000 : ℝ)) (q :=
      (22626178219963501 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_486_12 :
    Uω (aρ 12) (bρ 12) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(16232050823419908826121 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15781234614494777 / 80000000000000000 : ℝ) ≤
      (-(16232050823419908826121 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (15781234614494777 / 80000000000000000 : ℝ) =
            (15781234614494777 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15781234614494777 / 10000000000000000 : ℝ) ≤
            (4562364585580091173879 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (70676046050143 / 625000000000000 : ℝ)) (q :=
      (15781234614494777 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_486_13 :
    Uω (aρ 13) (bρ 13) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_486_14 :
    Uω (aρ 14) (bρ 14) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_486_15 :
    Uω (aρ 15) (bρ 15) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_486_16 :
    Uω (aρ 16) (bρ 16) (34513812135369 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_486 :
    Uρ (34513812135369 / 64000000000000 : ℝ) ≤
      (-(1951775897521726186223 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (34513812135369 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(786951487770795011317 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (34513812135369 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(792580117002899229761 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (34513812135369 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6431354596238415003153 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (34513812135369 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3291995367689427495473 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (34513812135369 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1705335441222945381761 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (34513812135369 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1793177352395991703339 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (34513812135369 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7674831886757274297583 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (34513812135369 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(837500021158687506521 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (34513812135369 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(29185843712424599397 / 31250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (34513812135369 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10677479115380574000047 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (34513812135369 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(2525838139806847648551 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (34513812135369 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(16232050823419908826121 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (34513812135369 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (34513812135369 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (34513812135369 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (34513812135369 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_486_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_487_1 :
    Uω (aρ 1) (bρ 1) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(6283905358389822733931 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85351948553733837 / 160000000000000000 : ℝ) ≤
      (-(6283905358389822733931 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85351948553733837 / 160000000000000000 : ℝ) =
            (85351948553733837 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85351948553733837 / 80000000000000000 : ℝ) ≤
            (647566444610177266069 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5334466478491339 / 10000000000000000 : ℝ)) (q :=
      (85351948553733837 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_487_2 :
    Uω (aρ 2) (bρ 2) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(6328881215201098496097 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84968932820745869 / 160000000000000000 : ℝ) ≤
      (-(6328881215201098496097 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84968932820745869 / 160000000000000000 : ℝ) =
            (84968932820745869 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84968932820745869 / 80000000000000000 : ℝ) ≤
            (602590587798901503903 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5310358524377843 / 10000000000000000 : ℝ)) (q :=
      (84968932820745869 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_487_3 :
    Uω (aρ 3) (bρ 3) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(1604871659391791879599 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84202545401853533 / 160000000000000000 : ℝ) ≤
      (-(1604871659391791879599 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84202545401853533 / 160000000000000000 : ℝ) =
            (84202545401853533 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84202545401853533 / 80000000000000000 : ℝ) ≤
            (127996291358208120401 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5261956203366301 / 10000000000000000 : ℝ)) (q :=
      (84202545401853533 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_487_4 :
    Uω (aρ 4) (bρ 4) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(3285968618138589291277 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3317144314243061 / 6400000000000000 : ℝ) ≤
      (-(3285968618138589291277 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3317144314243061 / 6400000000000000 : ℝ) =
            (3317144314243061 / 3200000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3317144314243061 / 3200000000000000 : ℝ) ≤
            (179767283361410708723 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (207240327648367 / 400000000000000 : ℝ)) (q :=
      (3317144314243061 / 6400000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_487_5 :
    Uω (aρ 5) (bρ 5) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(6808990922769527856703 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (80985872242185869 / 160000000000000000 : ℝ) ≤
      (-(6808990922769527856703 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (80985872242185869 / 160000000000000000 : ℝ) =
            (80985872242185869 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (80985872242185869 / 80000000000000000 : ℝ) ≤
            (122480880230472143297 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5056356158807843 / 10000000000000000 : ℝ)) (q :=
      (80985872242185869 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_487_6 :
    Uω (aρ 6) (bρ 6) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(7159897533578763198489 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (78193307445934141 / 160000000000000000 : ℝ) ≤
      (-(7159897533578763198489 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (78193307445934141 / 160000000000000000 : ℝ) =
            (78193307445934141 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (78193307445934141 / 40000000000000000 : ℝ) ≤
            (6703046072421236801511 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4874525934416377 / 10000000000000000 : ℝ)) (q :=
      (78193307445934141 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_487_7 :
    Uω (aρ 7) (bρ 7) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(7661314156593136158591 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (74369238777818021 / 160000000000000000 : ℝ) ≤
      (-(7661314156593136158591 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (74369238777818021 / 160000000000000000 : ℝ) =
            (74369238777818021 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (74369238777818021 / 40000000000000000 : ℝ) ≤
            (6201629449406863841409 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2310089365830931 / 5000000000000000 : ℝ)) (q :=
      (74369238777818021 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_487_8 :
    Uω (aρ 8) (bρ 8) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(8360393601371293797627 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (69347802181864277 / 160000000000000000 : ℝ) ≤
      (-(8360393601371293797627 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (69347802181864277 / 160000000000000000 : ℝ) =
            (69347802181864277 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (69347802181864277 / 40000000000000000 : ℝ) ≤
            (5502550004628706202373 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1069010202126911 / 2500000000000000 : ℝ)) (q :=
      (69347802181864277 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_487_9 :
    Uω (aρ 9) (bρ 9) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(932312360618953778177 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (62982786197452141 / 160000000000000000 : ℝ) ≤
      (-(932312360618953778177 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (62982786197452141 / 160000000000000000 : ℝ) =
            (62982786197452141 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (62982786197452141 / 40000000000000000 : ℝ) ≤
            (453981999981046221823 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3821379438816127 / 10000000000000000 : ℝ)) (q :=
      (62982786197452141 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_487_10 :
    Uω (aρ 10) (bρ 10) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(10658111730682012403533 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55111733443456581 / 160000000000000000 : ℝ) ≤
      (-(10658111730682012403533 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55111733443456581 / 160000000000000000 : ℝ) =
            (55111733443456581 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55111733443456581 / 40000000000000000 : ℝ) ≤
            (3204831875317987596467 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1613028439030841 / 5000000000000000 : ℝ)) (q :=
      (55111733443456581 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_487_11 :
    Uω (aρ 11) (bρ 11) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(6301713833760821665297 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1814763621402669 / 6400000000000000 : ℝ) ≤
      (-(6301713833760821665297 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1814763621402669 / 6400000000000000 : ℝ) =
            (1814763621402669 / 1600000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1814763621402669 / 1600000000000000 : ℝ) ≤
            (629757969239178334703 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (48534062814359 / 200000000000000 : ℝ)) (q :=
      (1814763621402669 / 6400000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_487_12 :
    Uω (aρ 12) (bρ 12) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(3235446682644510697477 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6347192319383009 / 32000000000000000 : ℝ) ≤
      (-(3235446682644510697477 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6347192319383009 / 32000000000000000 : ℝ) =
            (6347192319383009 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6347192319383009 / 4000000000000000 : ℝ) ≤
            (923436399155489302523 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (114626212013399 / 1000000000000000 : ℝ)) (q :=
      (6347192319383009 / 32000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_487_13 :
    Uω (aρ 13) (bρ 13) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_487_14 :
    Uω (aρ 14) (bρ 14) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_487_15 :
    Uω (aρ 15) (bρ 15) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_487_16 :
    Uω (aρ 16) (bρ 16) (69107511152773 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_487 :
    Uρ (69107511152773 / 128000000000000 : ℝ) ≤
      (-(974390919117488362389 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (69107511152773 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6283905358389822733931 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (69107511152773 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6328881215201098496097 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (69107511152773 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1604871659391791879599 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (69107511152773 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3285968618138589291277 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (69107511152773 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6808990922769527856703 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (69107511152773 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7159897533578763198489 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (69107511152773 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7661314156593136158591 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (69107511152773 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8360393601371293797627 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (69107511152773 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(932312360618953778177 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (69107511152773 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10658111730682012403533 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (69107511152773 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6301713833760821665297 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (69107511152773 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(3235446682644510697477 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (69107511152773 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (69107511152773 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (69107511152773 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (69107511152773 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_487_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_488_1 :
    Uω (aρ 1) (bρ 1) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(62722125030626558607 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10681475965366287 / 20000000000000000 : ℝ) ≤
      (-(62722125030626558607 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10681475965366287 / 20000000000000000 : ℝ) =
            (10681475965366287 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10681475965366287 / 10000000000000000 : ℝ) ≤
            (6592592999373441393 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (667588463997739 / 1250000000000000 : ℝ)) (q :=
      (10681475965366287 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_488_2 :
    Uω (aρ 2) (bρ 2) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(1263427061655700437097 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (166149990577311 / 312500000000000 : ℝ) ≤
      (-(1263427061655700437097 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (166149990577311 / 312500000000000 : ℝ) =
            (166149990577311 / 156250000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (166149990577311 / 156250000000000 : ℝ) ≤
            (122867298944299562903 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5316600156073529 / 10000000000000000 : ℝ)) (q :=
      (166149990577311 / 312500000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_488_3 :
    Uω (aρ 3) (bρ 3) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(6407632750799801970241 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10537802165944457 / 20000000000000000 : ℝ) ≤
      (-(6407632750799801970241 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10537802165944457 / 20000000000000000 : ℝ) =
            (10537802165944457 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10537802165944457 / 10000000000000000 : ℝ) ≤
            (523839052200198029759 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2634099515710041 / 5000000000000000 : ℝ)) (q :=
      (10537802165944457 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_488_4 :
    Uω (aρ 4) (bρ 4) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(3279949129863435104927 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10378563191729213 / 20000000000000000 : ℝ) ≤
      (-(3279949129863435104927 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10378563191729213 / 20000000000000000 : ℝ) =
            (10378563191729213 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10378563191729213 / 10000000000000000 : ℝ) ≤
            (185786771636564895073 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2593627119134919 / 5000000000000000 : ℝ)) (q :=
      (10378563191729213 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_488_5 :
    Uω (aρ 5) (bρ 5) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(6796655347826442500329 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5067864663363369 / 10000000000000000 : ℝ) ≤
      (-(6796655347826442500329 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5067864663363369 / 10000000000000000 : ℝ) =
            (5067864663363369 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5067864663363369 / 5000000000000000 : ℝ) ≤
            (134816455173557499671 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5062610292602363 / 10000000000000000 : ℝ)) (q :=
      (5067864663363369 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_488_6 :
    Uω (aρ 6) (bρ 6) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(3573551067666562741491 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4893338933377709 / 10000000000000000 : ℝ) ≤
      (-(3573551067666562741491 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4893338933377709 / 10000000000000000 : ℝ) =
            (4893338933377709 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4893338933377709 / 2500000000000000 : ℝ) ≤
            (3357920735333437258509 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4880799207771043 / 10000000000000000 : ℝ)) (q :=
      (4893338933377709 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_488_7 :
    Uω (aρ 7) (bρ 7) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(305912595789937330659 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (116358905550973 / 250000000000000 : ℝ) ≤
      (-(305912595789937330659 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (116358905550973 / 250000000000000 : ℝ) = (116358905550973 / 62500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (116358905550973 / 62500000000000 : ℝ) ≤
            (248605148450062669341 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (925299033170693 / 2000000000000000 : ℝ)) (q :=
      (116358905550973 / 250000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_488_8 :
    Uω (aρ 8) (bρ 8) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(8345808874379213789631 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8681127231287437 / 20000000000000000 : ℝ) ≤
      (-(8345808874379213789631 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8681127231287437 / 20000000000000000 : ℝ) =
            (8681127231287437 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8681127231287437 / 5000000000000000 : ℝ) ≤
            (5517134731620786210369 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2141225802201531 / 5000000000000000 : ℝ)) (q :=
      (8681127231287437 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_488_9 :
    Uω (aρ 9) (bρ 9) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(9306805504687874914537 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3942852878019037 / 10000000000000000 : ℝ) ≤
      (-(9306805504687874914537 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3942852878019037 / 10000000000000000 : ℝ) =
            (3942852878019037 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3942852878019037 / 2500000000000000 : ℝ) ≤
            (4556138101312125085463 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3827995757513699 / 10000000000000000 : ℝ)) (q :=
      (3942852878019037 / 10000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_488_10 :
    Uω (aρ 10) (bρ 10) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(531939342072332120009 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55218339231969 / 160000000000000 : ℝ) ≤
      (-(531939342072332120009 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55218339231969 / 160000000000000 : ℝ) = (55218339231969 / 40000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55218339231969 / 40000000000000 : ℝ) ≤
            (161207838227667879991 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (12932565755867 / 40000000000000 : ℝ)) (q :=
      (55218339231969 / 160000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_488_11 :
    Uω (aρ 11) (bρ 11) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(1572219133875210761649 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5685715438202167 / 20000000000000000 : ℝ) ≤
      (-(1572219133875210761649 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5685715438202167 / 20000000000000000 : ℝ) =
            (5685715438202167 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5685715438202167 / 5000000000000000 : ℝ) ≤
            (160648816874789238351 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (19023758588889 / 78125000000000 : ℝ)) (q :=
      (5685715438202167 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_488_12 :
    Uω (aρ 12) (bρ 12) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(16123145677231630302739 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3988509910166249 / 20000000000000000 : ℝ) ≤
      (-(16123145677231630302739 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3988509910166249 / 20000000000000000 : ℝ) =
            (3988509910166249 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3988509910166249 / 2500000000000000 : ℝ) ≤
            (4671269731768369697261 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (580767834013437 / 5000000000000000 : ℝ)) (q :=
      (3988509910166249 / 20000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_488_13 :
    Uω (aρ 13) (bρ 13) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_488_14 :
    Uω (aρ 14) (bρ 14) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_488_15 :
    Uω (aρ 15) (bρ 15) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_488_16 :
    Uω (aρ 16) (bρ 16) (8648424754351 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_488 :
    Uρ (8648424754351 / 16000000000000 : ℝ) ≤
      (-(194580223848825435147 / 200000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (8648424754351 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(62722125030626558607 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (8648424754351 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1263427061655700437097 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (8648424754351 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6407632750799801970241 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (8648424754351 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3279949129863435104927 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (8648424754351 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6796655347826442500329 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (8648424754351 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3573551067666562741491 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (8648424754351 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(305912595789937330659 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (8648424754351 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8345808874379213789631 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (8648424754351 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(9306805504687874914537 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (8648424754351 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(531939342072332120009 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (8648424754351 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1572219133875210761649 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (8648424754351 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(16123145677231630302739 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (8648424754351 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (8648424754351 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (8648424754351 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (8648424754351 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_488_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_489_1 :
    Uω (aρ 1) (bρ 1) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(1252106660842020123547 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17110333378160783 / 32000000000000000 : ℝ) ≤
      (-(1252106660842020123547 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (17110333378160783 / 32000000000000000 : ℝ) =
            (17110333378160783 / 16000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17110333378160783 / 16000000000000000 : ℝ) ≤
            (134187699757979876453 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (534694894530713 / 1000000000000000 : ℝ)) (q :=
      (17110333378160783 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_489_2 :
    Uω (aρ 2) (bρ 2) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(6305403182837248309091 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85168657521620947 / 160000000000000000 : ℝ) ≤
      (-(6305403182837248309091 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85168657521620947 / 160000000000000000 : ℝ) =
            (85168657521620947 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85168657521620947 / 80000000000000000 : ℝ) ≤
            (626068620162751690909 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5322841786669259 / 10000000000000000 : ℝ)) (q :=
      (85168657521620947 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_489_3 :
    Uω (aρ 3) (bρ 3) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(3197896451298350055509 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84402289221723403 / 160000000000000000 : ℝ) ≤
      (-(3197896451298350055509 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84402289221723403 / 160000000000000000 : ℝ) =
            (84402289221723403 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84402289221723403 / 80000000000000000 : ℝ) ≤
            (267839450201649944491 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2637220927766033 / 5000000000000000 : ℝ)) (q :=
      (84402289221723403 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_489_4 :
    Uω (aρ 4) (bρ 4) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(1636968442687012044419 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16625680623527751 / 32000000000000000 : ℝ) ≤
      (-(1636968442687012044419 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (16625680623527751 / 32000000000000000 : ℝ) =
            (16625680623527751 / 16000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16625680623527751 / 16000000000000000 : ℝ) ≤
            (95899508062987955581 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1038700054717297 / 2000000000000000 : ℝ)) (q :=
      (16625680623527751 / 32000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_489_5 :
    Uω (aρ 5) (bρ 5) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(1696083750571734394177 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (81185796729639979 / 160000000000000000 : ℝ) ≤
      (-(1696083750571734394177 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (81185796729639979 / 160000000000000000 : ℝ) =
            (81185796729639979 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (81185796729639979 / 80000000000000000 : ℝ) ≤
            (36784200178265605823 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2534432197210819 / 5000000000000000 : ℝ)) (q :=
      (81185796729639979 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_489_6 :
    Uω (aρ 6) (bρ 6) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(22294759913439966139 / 31250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15678707552867983 / 32000000000000000 : ℝ) ≤
      (-(22294759913439966139 / 31250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15678707552867983 / 32000000000000000 : ℝ) =
            (15678707552867983 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15678707552867983 / 8000000000000000 : ℝ) ≤
            (21026938855310033861 / 31250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (488707239889913 / 1000000000000000 : ℝ)) (q :=
      (15678707552867983 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_489_7 :
    Uω (aρ 7) (bρ 7) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(7634334050232765267451 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14914031739038511 / 32000000000000000 : ℝ) ≤
      (-(7634334050232765267451 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14914031739038511 / 32000000000000000 : ℝ) =
            (14914031739038511 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14914031739038511 / 8000000000000000 : ℝ) ≤
            (6228609555767234732549 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (463281139601571 / 1000000000000000 : ℝ)) (q :=
      (14914031739038511 / 32000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_489_8 :
    Uω (aρ 8) (bρ 8) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(4165622981717381617827 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (69550229515448811 / 160000000000000000 : ℝ) ≤
      (-(4165622981717381617827 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (69550229515448811 / 160000000000000000 : ℝ) =
            (69550229515448811 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (69550229515448811 / 40000000000000000 : ℝ) ≤
            (2765848821282618382173 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2144430949943871 / 5000000000000000 : ℝ)) (q :=
      (69550229515448811 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_489_9 :
    Uω (aρ 9) (bρ 9) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(9290515580424209657449 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (63188495835948627 / 160000000000000000 : ℝ) ≤
      (-(9290515580424209657449 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (63188495835948627 / 160000000000000000 : ℝ) =
            (63188495835948627 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (63188495835948627 / 40000000000000000 : ℝ) ≤
            (4572428025575790342551 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3834610818310219 / 10000000000000000 : ℝ)) (q :=
      (63188495835948627 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_489_10 :
    Uω (aρ 10) (bρ 10) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(10619504240865397292307 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55324917272051771 / 160000000000000000 : ℝ) ≤
      (-(10619504240865397292307 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55324917272051771 / 160000000000000000 : ℝ) =
            (55324917272051771 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55324917272051771 / 40000000000000000 : ℝ) ≤
            (3243439365134602707693 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (101256954103691 / 312500000000000 : ℝ)) (q :=
      (55324917272051771 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_489_11 :
    Uω (aρ 11) (bρ 11) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(12552166172502945745251 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9120451277367631 / 32000000000000000 : ℝ) ≤
      (-(12552166172502945745251 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9120451277367631 / 32000000000000000 : ℝ) =
            (9120451277367631 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9120451277367631 / 8000000000000000 : ℝ) ≤
            (1310777433497054254749 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (244336654687141 / 1000000000000000 : ℝ)) (q :=
      (9120451277367631 / 32000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_489_12 :
    Uω (aρ 12) (bρ 12) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(16069760752416665406813 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32078875815043427 / 160000000000000000 : ℝ) ≤
      (-(16069760752416665406813 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (32078875815043427 / 160000000000000000 : ℝ) =
            (32078875815043427 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32078875815043427 / 20000000000000000 : ℝ) ≤
            (4724654656583334593187 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1176644072082069 / 10000000000000000 : ℝ)) (q :=
      (32078875815043427 / 160000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_489_13 :
    Uω (aρ 13) (bρ 13) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_489_14 :
    Uω (aρ 14) (bρ 14) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_489_15 :
    Uω (aρ 15) (bρ 15) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_489_16 :
    Uω (aρ 16) (bρ 16) (69267284916843 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_489 :
    Uρ (69267284916843 / 128000000000000 : ℝ) ≤
      (-(1942836699118080219587 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (69267284916843 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1252106660842020123547 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (69267284916843 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6305403182837248309091 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (69267284916843 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3197896451298350055509 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (69267284916843 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1636968442687012044419 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (69267284916843 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1696083750571734394177 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (69267284916843 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(22294759913439966139 / 31250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (69267284916843 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7634334050232765267451 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (69267284916843 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4165622981717381617827 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (69267284916843 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(9290515580424209657449 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (69267284916843 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10619504240865397292307 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (69267284916843 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(12552166172502945745251 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (69267284916843 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(16069760752416665406813 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (69267284916843 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (69267284916843 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (69267284916843 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (69267284916843 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_489_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_490_1 :
    Uω (aρ 1) (bρ 1) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(3124433864984652654599 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42825763028679659 / 80000000000000000 : ℝ) ≤
      (-(3124433864984652654599 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42825763028679659 / 80000000000000000 : ℝ) =
            (42825763028679659 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42825763028679659 / 40000000000000000 : ℝ) ≤
            (341302036515347345401 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5353190178467571 / 10000000000000000 : ℝ)) (q :=
      (42825763028679659 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_490_2 :
    Uω (aρ 2) (bρ 2) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(15734212016432925827 / 25000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1705370397177799 / 3200000000000000 : ℝ) ≤
      (-(15734212016432925827 / 25000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1705370397177799 / 3200000000000000 : ℝ) =
            (1705370397177799 / 1600000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1705370397177799 / 1600000000000000 : ℝ) ≤
            (1594467491067074173 / 25000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (53290834161689 / 100000000000000 : ℝ)) (q :=
      (1705370397177799 / 3200000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_490_3 :
    Uω (aρ 3) (bρ 3) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(797995882467076955683 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42251080542234311 / 80000000000000000 : ℝ) ≤
      (-(797995882467076955683 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42251080542234311 / 80000000000000000 : ℝ) =
            (42251080542234311 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42251080542234311 / 40000000000000000 : ℝ) ≤
            (68438092907923044317 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2640342337858117 / 5000000000000000 : ℝ)) (q :=
      (42251080542234311 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_490_4 :
    Uω (aρ 4) (bρ 4) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(6535863734487156375171 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41614150303915131 / 80000000000000000 : ℝ) ≤
      (-(6535863734487156375171 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41614150303915131 / 80000000000000000 : ℝ) =
            (41614150303915131 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41614150303915131 / 40000000000000000 : ℝ) ≤
            (395608068512843624829 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5199746297201439 / 10000000000000000 : ℝ)) (q :=
      (41614150303915131 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_490_5 :
    Uω (aρ 5) (bρ 5) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(3386014924257870962009 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40642879295304887 / 80000000000000000 : ℝ) ≤
      (-(3386014924257870962009 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (40642879295304887 / 80000000000000000 : ℝ) =
            (40642879295304887 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40642879295304887 / 40000000000000000 : ℝ) ≤
            (79720977242129037991 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2537559232191939 / 5000000000000000 : ℝ)) (q :=
      (40642879295304887 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_490_6 :
    Uω (aρ 6) (bρ 6) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(7121560602100884678399 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39246825969676887 / 80000000000000000 : ℝ) ≤
      (-(7121560602100884678399 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39246825969676887 / 80000000000000000 : ℝ) =
            (39246825969676887 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39246825969676887 / 20000000000000000 : ℝ) ≤
            (6741383003899115321601 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2446672754058439 / 5000000000000000 : ℝ)) (q :=
      (39246825969676887 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_490_7 :
    Uω (aρ 7) (bρ 7) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(7620871572269016417851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37335308106097219 / 80000000000000000 : ℝ) ≤
      (-(7620871572269016417851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (37335308106097219 / 80000000000000000 : ℝ) =
            (37335308106097219 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37335308106097219 / 20000000000000000 : ℝ) ≤
            (6242072033730983582149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4639127422981961 / 10000000000000000 : ℝ)) (q :=
      (37335308106097219 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_490_8 :
    Uω (aρ 8) (bρ 8) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(2079176200419582819051 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34825718597617907 / 80000000000000000 : ℝ) ≤
      (-(2079176200419582819051 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (34825718597617907 / 80000000000000000 : ℝ) =
            (34825718597617907 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34825718597617907 / 20000000000000000 : ℝ) ≤
            (1386559701080417180949 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4295271697202133 / 10000000000000000 : ℝ)) (q :=
      (34825718597617907 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_490_9 :
    Uω (aρ 9) (bρ 9) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(4637126865470083261903 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (31645667806187247 / 80000000000000000 : ℝ) ≤
      (-(4637126865470083261903 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (31645667806187247 / 80000000000000000 : ℝ) =
            (31645667806187247 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (31645667806187247 / 20000000000000000 : ℝ) ≤
            (2294344937529916738097 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (960306156926117 / 2500000000000000 : ℝ)) (q :=
      (31645667806187247 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_490_10 :
    Uω (aρ 10) (bρ 10) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(5300131861877623017487 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1108629354904607 / 3200000000000000 : ℝ) ≤
      (-(5300131861877623017487 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1108629354904607 / 3200000000000000 : ℝ) =
            (1108629354904607 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1108629354904607 / 800000000000000 : ℝ) ≤
            (1631339941122376982513 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (64946003556129 / 200000000000000 : ℝ)) (q :=
      (1108629354904607 / 3200000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_490_11 :
    Uω (aρ 11) (bρ 11) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(12526666245270194488077 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22859345099191703 / 80000000000000000 : ℝ) ≤
      (-(12526666245270194488077 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (22859345099191703 / 80000000000000000 : ℝ) =
            (22859345099191703 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22859345099191703 / 20000000000000000 : ℝ) ≤
            (1336277360729805511923 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1225839805327791 / 5000000000000000 : ℝ)) (q :=
      (22859345099191703 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_490_12 :
    Uω (aρ 12) (bρ 12) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(16017053398384051458857 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16124200725712223 / 80000000000000000 : ℝ) ≤
      (-(16017053398384051458857 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16124200725712223 / 80000000000000000 : ℝ) =
            (16124200725712223 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16124200725712223 / 10000000000000000 : ℝ) ≤
            (4777362010615948541143 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (148949201746339 / 1250000000000000 : ℝ)) (q :=
      (16124200725712223 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_490_13 :
    Uω (aρ 13) (bρ 13) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_490_14 :
    Uω (aρ 14) (bρ 14) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_490_15 :
    Uω (aρ 15) (bρ 15) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_490_16 :
    Uω (aρ 16) (bρ 16) (34673585899439 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_490 :
    Uρ (34673585899439 / 64000000000000 : ℝ) ≤
      (-(2424856055011437979509 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (34673585899439 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3124433864984652654599 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (34673585899439 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) * (-(15734212016432925827 / 25000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (34673585899439 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(797995882467076955683 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (34673585899439 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6535863734487156375171 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (34673585899439 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3386014924257870962009 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (34673585899439 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7121560602100884678399 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (34673585899439 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7620871572269016417851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (34673585899439 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2079176200419582819051 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (34673585899439 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4637126865470083261903 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (34673585899439 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5300131861877623017487 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (34673585899439 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(12526666245270194488077 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (34673585899439 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(16017053398384051458857 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (34673585899439 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (34673585899439 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (34673585899439 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (34673585899439 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_490_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_491_1 :
    Uω (aρ 1) (bρ 1) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(249488629943552077721 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17150277044520221 / 32000000000000000 : ℝ) ≤
      (-(249488629943552077721 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (17150277044520221 / 32000000000000000 : ℝ) =
            (17150277044520221 / 16000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17150277044520221 / 16000000000000000 : ℝ) ≤
            (27770242176447922279 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (535943141146381 / 1000000000000000 : ℝ)) (q :=
      (17150277044520221 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_491_2 :
    Uω (aρ 2) (bρ 2) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(6281980147295564591557 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85368382187420993 / 160000000000000000 : ℝ) ≤
      (-(6281980147295564591557 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85368382187420993 / 160000000000000000 : ℝ) =
            (85368382187420993 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85368382187420993 / 80000000000000000 : ℝ) ≤
            (649491655704435408443 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (666915630572037 / 1250000000000000 : ℝ)) (q :=
      (85368382187420993 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_491_3 :
    Uω (aρ 3) (bρ 3) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(6372155189116117571223 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84602032915902633 / 160000000000000000 : ℝ) ≤
      (-(6372155189116117571223 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84602032915902633 / 160000000000000000 : ℝ) =
            (84602032915902633 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84602032915902633 / 80000000000000000 : ℝ) ≤
            (559316613883882428777 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5286927491986501 / 10000000000000000 : ℝ)) (q :=
      (84602032915902633 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_491_4 :
    Uω (aρ 4) (bρ 4) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(3261934058108181114563 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (83328198004745153 / 160000000000000000 : ℝ) ≤
      (-(3261934058108181114563 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (83328198004745153 / 160000000000000000 : ℝ) =
            (83328198004745153 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (83328198004745153 / 80000000000000000 : ℝ) ≤
            (203801843391818885437 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (325374519322301 / 625000000000000 : ℝ)) (q :=
      (83328198004745153 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_491_5 :
    Uω (aρ 5) (bρ 5) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(1689934962254301555617 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (81385720197664297 / 160000000000000000 : ℝ) ≤
      (-(1689934962254301555617 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (81385720197664297 / 160000000000000000 : ℝ) =
            (81385720197664297 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (81385720197664297 / 80000000000000000 : ℝ) ≤
            (42932988495698444383 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5081372502606709 / 10000000000000000 : ℝ)) (q :=
      (81385720197664297 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_491_6 :
    Uω (aρ 6) (bρ 6) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(3554407191258538788113 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (78593765461601849 / 160000000000000000 : ℝ) ≤
      (-(3554407191258538788113 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (78593765461601849 / 160000000000000000 : ℝ) =
            (78593765461601849 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (78593765461601849 / 40000000000000000 : ℝ) ≤
            (3377064611741461211887 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4899618535738903 / 10000000000000000 : ℝ)) (q :=
      (78593765461601849 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_491_7 :
    Uω (aρ 7) (bρ 7) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(7607427410292149149329 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2990842884410353 / 6400000000000000 : ℝ) ≤
      (-(7607427410292149149329 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2990842884410353 / 6400000000000000 : ℝ) =
            (2990842884410353 / 1600000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2990842884410353 / 1600000000000000 : ℝ) ≤
            (6255516195707850850671 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (185817729903241 / 400000000000000 : ℝ)) (q :=
      (2990842884410353 / 6400000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_491_8 :
    Uω (aρ 8) (bρ 8) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(4151092661282270086939 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (69752640907475889 / 160000000000000000 : ℝ) ≤
      (-(4151092661282270086939 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (69752640907475889 / 160000000000000000 : ℝ) =
            (69752640907475889 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (69752640907475889 / 40000000000000000 : ℝ) ≤
            (2780379141717729913061 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2150840499286579 / 5000000000000000 : ℝ)) (q :=
      (69752640907475889 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_491_9 :
    Uω (aρ 9) (bρ 9) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(1157252481795129172497 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (63394165429205193 / 160000000000000000 : ℝ) ≤
      (-(1157252481795129172497 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (63394165429205193 / 160000000000000000 : ℝ) =
            (63394165429205193 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (63394165429205193 / 40000000000000000 : ℝ) ≤
            (575615468954870827503 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3847837192149321 / 10000000000000000 : ℝ)) (q :=
      (63394165429205193 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_491_10 :
    Uω (aρ 10) (bρ 10) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(165329141977207929739 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11107598166272613 / 32000000000000000 : ℝ) ≤
      (-(165329141977207929739 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11107598166272613 / 32000000000000000 : ℝ) =
            (11107598166272613 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11107598166272613 / 8000000000000000 : ℝ) ≤
            (51279351866542070261 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (650874880182811 / 2000000000000000 : ℝ)) (q :=
      (11107598166272613 / 32000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_491_11 :
    Uω (aρ 11) (bρ 11) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(6250626286282757761457 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45835025944617849 / 160000000000000000 : ℝ) ≤
      (-(6250626286282757761457 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (45835025944617849 / 160000000000000000 : ℝ) =
            (45835025944617849 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45835025944617849 / 40000000000000000 : ℝ) ≤
            (680845516717242238543 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2459980416275903 / 10000000000000000 : ℝ)) (q :=
      (45835025944617849 / 160000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_491_12 :
    Uω (aρ 12) (bρ 12) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(1995624982888555183189 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32416703437324241 / 160000000000000000 : ℝ) ≤
      (-(1995624982888555183189 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (32416703437324241 / 160000000000000000 : ℝ) =
            (32416703437324241 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32416703437324241 / 20000000000000000 : ℝ) ≤
            (603676943236444816811 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (603195099774601 / 5000000000000000 : ℝ)) (q :=
      (32416703437324241 / 160000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_491_13 :
    Uω (aρ 13) (bρ 13) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_491_14 :
    Uω (aρ 14) (bρ 14) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_491_15 :
    Uω (aρ 15) (bρ 15) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_491_16 :
    Uω (aρ 16) (bρ 16) (69427058680913 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_491 :
    Uρ (69427058680913 / 128000000000000 : ℝ) ≤
      (-(484236579550365468117 / 500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (69427058680913 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(249488629943552077721 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (69427058680913 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6281980147295564591557 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (69427058680913 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6372155189116117571223 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (69427058680913 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3261934058108181114563 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (69427058680913 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1689934962254301555617 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (69427058680913 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3554407191258538788113 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (69427058680913 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7607427410292149149329 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (69427058680913 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4151092661282270086939 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (69427058680913 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1157252481795129172497 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (69427058680913 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(165329141977207929739 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (69427058680913 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6250626286282757761457 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (69427058680913 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1995624982888555183189 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (69427058680913 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (69427058680913 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (69427058680913 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (69427058680913 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_491_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_492_1 :
    Uω (aρ 1) (bρ 1) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(6225577328427986757589 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4292562219326693 / 8000000000000000 : ℝ) ≤
      (-(6225577328427986757589 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4292562219326693 / 8000000000000000 : ℝ) =
            (4292562219326693 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4292562219326693 / 4000000000000000 : ℝ) ≤
            (705894474572013242411 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (268283632214821 / 500000000000000 : ℝ)) (q :=
      (4292562219326693 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_492_2 :
    Uω (aρ 2) (bρ 2) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(3135144586463325143691 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21367061126811181 / 40000000000000000 : ℝ) ≤
      (-(3135144586463325143691 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21367061126811181 / 40000000000000000 : ℝ) =
            (21367061126811181 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21367061126811181 / 20000000000000000 : ℝ) ≤
            (330591315036674856309 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2670783335947639 / 5000000000000000 : ℝ)) (q :=
      (21367061126811181 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_492_3 :
    Uω (aρ 3) (bρ 3) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(6360357257749035855581 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21175476179034053 / 40000000000000000 : ℝ) ≤
      (-(6360357257749035855581 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21175476179034053 / 40000000000000000 : ℝ) =
            (21175476179034053 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21175476179034053 / 20000000000000000 : ℝ) ≤
            (571114545250964144419 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2646585152178357 / 5000000000000000 : ℝ)) (q :=
      (21175476179034053 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_492_4 :
    Uω (aρ 4) (bρ 4) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(3255943440666472898293 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20857023827179691 / 40000000000000000 : ℝ) ≤
      (-(3255943440666472898293 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20857023827179691 / 40000000000000000 : ℝ) =
            (20857023827179691 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20857023827179691 / 20000000000000000 : ℝ) ≤
            (209792460833527101707 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5212238309494533 / 10000000000000000 : ℝ)) (q :=
      (20857023827179691 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_492_5 :
    Uω (aρ 5) (bρ 5) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(6747464966434608471673 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4074284077586997 / 8000000000000000 : ℝ) ≤
      (-(6747464966434608471673 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4074284077586997 / 8000000000000000 : ℝ) =
            (4074284077586997 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4074284077586997 / 4000000000000000 : ℝ) ≤
            (184006836565391528327 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (254381325460359 / 500000000000000 : ℝ)) (q :=
      (4074284077586997 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_492_6 :
    Uω (aρ 6) (bρ 6) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(1419216894299342846093 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19673469583397039 / 40000000000000000 : ℝ) ≤
      (-(1419216894299342846093 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19673469583397039 / 40000000000000000 : ℝ) =
            (19673469583397039 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19673469583397039 / 10000000000000000 : ℝ) ≤
            (1353371826900657153907 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4905891482078207 / 10000000000000000 : ℝ)) (q :=
      (19673469583397039 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_492_7 :
    Uω (aρ 7) (bρ 7) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(7594001513948014470251 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18717881598994987 / 40000000000000000 : ℝ) ≤
      (-(7594001513948014470251 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (18717881598994987 / 40000000000000000 : ℝ) =
            (18717881598994987 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18717881598994987 / 10000000000000000 : ℝ) ≤
            (6268942092051985529749 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4651758870637181 / 10000000000000000 : ℝ)) (q :=
      (18717881598994987 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_492_8 :
    Uω (aρ 8) (bρ 8) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(2071921864965059653457 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17463460167469257 / 40000000000000000 : ℝ) ≤
      (-(2071921864965059653457 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17463460167469257 / 40000000000000000 : ℝ) =
            (17463460167469257 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17463460167469257 / 10000000000000000 : ℝ) ≤
            (1393814036534940346543 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1077022451553579 / 2500000000000000 : ℝ)) (q :=
      (17463460167469257 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_492_9 :
    Uω (aρ 9) (bρ 9) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(9241813849391177808397 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15874246334424941 / 40000000000000000 : ℝ) ≤
      (-(9241813849391177808397 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15874246334424941 / 40000000000000000 : ℝ) =
            (15874246334424941 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15874246334424941 / 10000000000000000 : ℝ) ≤
            (4621129756608822191603 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1927224259026079 / 5000000000000000 : ℝ)) (q :=
      (15874246334424941 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_492_10 :
    Uω (aρ 10) (bρ 10) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(2640477031809797859469 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2782224335433059 / 8000000000000000 : ℝ) ≤
      (-(2640477031809797859469 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2782224335433059 / 8000000000000000 : ℝ) =
            (2782224335433059 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2782224335433059 / 2000000000000000 : ℝ) ≤
            (825258869690202140531 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (652289044583467 / 2000000000000000 : ℝ)) (q :=
      (2782224335433059 / 8000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_492_11 :
    Uω (aρ 11) (bρ 11) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(2495184889494876055977 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2297563230746221 / 8000000000000000 : ℝ) ≤
      (-(2495184889494876055977 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2297563230746221 / 8000000000000000 : ℝ) =
            (2297563230746221 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2297563230746221 / 2000000000000000 : ℝ) ≤
            (277403831705123944023 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (61706727185131 / 250000000000000 : ℝ)) (q :=
      (2297563230746221 / 8000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_492_12 :
    Uω (aρ 12) (bρ 12) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(1591357776262880250737 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8145956564381167 / 40000000000000000 : ℝ) ≤
      (-(1591357776262880250737 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8145956564381167 / 40000000000000000 : ℝ) =
            (8145956564381167 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8145956564381167 / 5000000000000000 : ℝ) ≤
            (488083764637119749263 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1221039389415271 / 10000000000000000 : ℝ)) (q :=
      (8145956564381167 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_492_13 :
    Uω (aρ 13) (bρ 13) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_492_14 :
    Uω (aρ 14) (bρ 14) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_492_15 :
    Uω (aρ 15) (bρ 15) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_492_16 :
    Uω (aρ 16) (bρ 16) (17376736390737 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_492 :
    Uρ (17376736390737 / 32000000000000 : ℝ) ≤
      (-(9670103930970074289523 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (17376736390737 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6225577328427986757589 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (17376736390737 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3135144586463325143691 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (17376736390737 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6360357257749035855581 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (17376736390737 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3255943440666472898293 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (17376736390737 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6747464966434608471673 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (17376736390737 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1419216894299342846093 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (17376736390737 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7594001513948014470251 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (17376736390737 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2071921864965059653457 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (17376736390737 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(9241813849391177808397 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (17376736390737 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2640477031809797859469 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (17376736390737 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(2495184889494876055977 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (17376736390737 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1591357776262880250737 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (17376736390737 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (17376736390737 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (17376736390737 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (17376736390737 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_492_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_493_1 :
    Uω (aρ 1) (bρ 1) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(1553488109489150942229 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85951103549162159 / 160000000000000000 : ℝ) ≤
      (-(1553488109489150942229 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85951103549162159 / 160000000000000000 : ℝ) =
            (85951103549162159 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85951103549162159 / 80000000000000000 : ℝ) ≤
            (179379841260849057771 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5371913876965973 / 10000000000000000 : ℝ)) (q :=
      (85951103549162159 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_493_2 :
    Uω (aρ 2) (bρ 2) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(6258611851501049440367 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85568106818391623 / 160000000000000000 : ℝ) ≤
      (-(6258611851501049440367 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85568106818391623 / 160000000000000000 : ℝ) =
            (85568106818391623 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85568106818391623 / 80000000000000000 : ℝ) ≤
            (672859951498950559633 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (668476037266207 / 1250000000000000 : ℝ)) (q :=
      (85568106818391623 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_493_3 :
    Uω (aρ 3) (bρ 3) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(1587143308191476179277 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84801776485279623 / 160000000000000000 : ℝ) ≤
      (-(1587143308191476179277 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84801776485279623 / 160000000000000000 : ℝ) =
            (84801776485279623 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84801776485279623 / 80000000000000000 : ℝ) ≤
            (145724642558523820723 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (331213319552541 / 625000000000000 : ℝ)) (q :=
      (84801776485279623 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_493_4 :
    Uω (aρ 4) (bρ 4) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(6499919995358701146053 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (83527992520084831 / 160000000000000000 : ℝ) ≤
      (-(6499919995358701146053 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (83527992520084831 / 160000000000000000 : ℝ) =
            (83527992520084831 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (83527992520084831 / 80000000000000000 : ℝ) ≤
            (431551807641298853947 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5218484298256307 / 10000000000000000 : ℝ)) (q :=
      (83527992520084831 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_493_5 :
    Uω (aρ 5) (bρ 5) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(1683801290887367162087 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16317128530753699 / 32000000000000000 : ℝ) ≤
      (-(1683801290887367162087 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (16317128530753699 / 32000000000000000 : ℝ) =
            (16317128530753699 / 16000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16317128530753699 / 16000000000000000 : ℝ) ≤
            (49066659862632837913 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1018776096860353 / 2000000000000000 : ℝ)) (q :=
      (16317128530753699 / 32000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_493_6 :
    Uω (aρ 6) (bρ 6) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(7083370827149970993019 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15758798111560779 / 32000000000000000 : ℝ) ≤
      (-(7083370827149970993019 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15758798111560779 / 32000000000000000 : ℝ) =
            (15758798111560779 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15758798111560779 / 8000000000000000 : ℝ) ≤
            (6779572778850029006981 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (491216434744619 / 1000000000000000 : ℝ)) (q :=
      (15758798111560779 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_493_7 :
    Uω (aρ 7) (bρ 7) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(3790296916546084192099 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (74971979075916063 / 160000000000000000 : ℝ) ≤
      (-(3790296916546084192099 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (74971979075916063 / 160000000000000000 : ℝ) =
            (74971979075916063 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (74971979075916063 / 40000000000000000 : ℝ) ≤
            (3141174886453915807901 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4658074292970211 / 10000000000000000 : ℝ)) (q :=
      (74971979075916063 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_493_8 :
    Uω (aρ 8) (bρ 8) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(8273211147642510212537 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (69955036500040647 / 160000000000000000 : ℝ) ≤
      (-(8273211147642510212537 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (69955036500040647 / 160000000000000000 : ℝ) =
            (69955036500040647 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (69955036500040647 / 40000000000000000 : ℝ) ≤
            (5589732458357489787463 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (539312265290723 / 1250000000000000 : ℝ)) (q :=
      (69955036500040647 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_493_9 :
    Uω (aρ 9) (bρ 9) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(115320445191368720493 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12719959077751323 / 32000000000000000 : ℝ) ≤
      (-(115320445191368720493 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12719959077751323 / 32000000000000000 : ℝ) =
            (12719959077751323 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12719959077751323 / 8000000000000000 : ℝ) ≤
            (57966349883631279507 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (48263232647191 / 125000000000000 : ℝ)) (q :=
      (12719959077751323 / 32000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_493_10 :
    Uω (aρ 10) (bρ 10) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(10542792645437616091663 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55750955553708511 / 160000000000000000 : ℝ) ≤
      (-(10542792645437616091663 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55750955553708511 / 160000000000000000 : ℝ) =
            (55750955553708511 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55750955553708511 / 40000000000000000 : ℝ) ≤
            (3320150960562383908337 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3268512665889267 / 10000000000000000 : ℝ)) (q :=
      (55750955553708511 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_493_11 :
    Uω (aρ 11) (bρ 11) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(778167573294784877017 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9213481436800803 / 32000000000000000 : ℝ) ≤
      (-(778167573294784877017 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9213481436800803 / 32000000000000000 : ℝ) =
            (9213481436800803 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9213481436800803 / 8000000000000000 : ℝ) ≤
            (88266402080215122983 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (495309149176241 / 2000000000000000 : ℝ)) (q :=
      (9213481436800803 / 32000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_493_12 :
    Uω (aρ 12) (bρ 12) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(15862765972973506168137 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32749811854259119 / 160000000000000000 : ℝ) ≤
      (-(15862765972973506168137 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (32749811854259119 / 160000000000000000 : ℝ) =
            (32749811854259119 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32749811854259119 / 20000000000000000 : ℝ) ≤
            (4931649436026493831863 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1235546426348093 / 10000000000000000 : ℝ)) (q :=
      (32749811854259119 / 160000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_493_13 :
    Uω (aρ 13) (bρ 13) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_493_14 :
    Uω (aρ 14) (bρ 14) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_493_15 :
    Uω (aρ 15) (bρ 15) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_493_16 :
    Uω (aρ 16) (bρ 16) (69586832444983 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_493 :
    Uρ (69586832444983 / 128000000000000 : ℝ) ≤
      (-(1931107930420668247501 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (69586832444983 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1553488109489150942229 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (69586832444983 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6258611851501049440367 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (69586832444983 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1587143308191476179277 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (69586832444983 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6499919995358701146053 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (69586832444983 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1683801290887367162087 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (69586832444983 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7083370827149970993019 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (69586832444983 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3790296916546084192099 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (69586832444983 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8273211147642510212537 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (69586832444983 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(115320445191368720493 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (69586832444983 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10542792645437616091663 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (69586832444983 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(778167573294784877017 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (69586832444983 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(15862765972973506168137 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (69586832444983 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (69586832444983 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (69586832444983 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (69586832444983 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_493_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_494_1 :
    Uω (aρ 1) (bρ 1) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(1240468209150847565031 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43025481355245261 / 80000000000000000 : ℝ) ≤
      (-(1240468209150847565031 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43025481355245261 / 80000000000000000 : ℝ) =
            (43025481355245261 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43025481355245261 / 40000000000000000 : ℝ) ≤
            (145826151449152434969 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2689077554736517 / 5000000000000000 : ℝ)) (q :=
      (43025481355245261 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_494_2 :
    Uω (aρ 2) (bρ 2) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(1561737037791314671991 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42833984560446017 / 80000000000000000 : ℝ) ≤
      (-(1561737037791314671991 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42833984560446017 / 80000000000000000 : ℝ) =
            (42833984560446017 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42833984560446017 / 40000000000000000 : ℝ) ≤
            (171130912958685328009 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5354049923283223 / 10000000000000000 : ℝ)) (q :=
      (42833984560446017 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_494_3 :
    Uω (aρ 3) (bρ 3) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(792100385176676737587 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8490164822344261 / 16000000000000000 : ℝ) ≤
      (-(792100385176676737587 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8490164822344261 / 16000000000000000 : ℝ) =
            (8490164822344261 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8490164822344261 / 8000000000000000 : ℝ) ≤
            (74333590198323262413 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1061131183490409 / 2000000000000000 : ℝ)) (q :=
      (8490164822344261 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_494_4 :
    Uω (aρ 4) (bρ 4) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(3243983711969671616221 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41813944819587733 / 80000000000000000 : ℝ) ≤
      (-(3243983711969671616221 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41813944819587733 / 80000000000000000 : ℝ) =
            (41813944819587733 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41813944819587733 / 40000000000000000 : ℝ) ≤
            (221752189530328383779 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1306182568870913 / 2500000000000000 : ℝ)) (q :=
      (41813944819587733 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_494_5 :
    Uω (aρ 5) (bρ 5) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(1344592080656173711347 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40842801752338581 / 80000000000000000 : ℝ) ≤
      (-(1344592080656173711347 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (40842801752338581 / 80000000000000000 : ℝ) =
            (40842801752338581 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40842801752338581 / 40000000000000000 : ℝ) ≤
            (41702279943826288653 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1275033607001591 / 2500000000000000 : ℝ)) (q :=
      (40842801752338581 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_494_6 :
    Uω (aρ 6) (bρ 6) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(1767668351937252963239 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39447051068363761 / 80000000000000000 : ℝ) ≤
      (-(1767668351937252963239 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39447051068363761 / 80000000000000000 : ℝ) =
            (39447051068363761 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39447051068363761 / 20000000000000000 : ℝ) ≤
            (1698067549562747036761 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4918437132152659 / 10000000000000000 : ℝ)) (q :=
      (39447051068363761 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_494_7 :
    Uω (aρ 7) (bρ 7) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(3783602158894347139321 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37536215078294857 / 80000000000000000 : ℝ) ≤
      (-(3783602158894347139321 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (37536215078294857 / 80000000000000000 : ℝ) =
            (37536215078294857 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37536215078294857 / 20000000000000000 : ℝ) ≤
            (3147869644105652860679 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4664389515395433 / 10000000000000000 : ℝ)) (q :=
      (37536215078294857 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_494_8 :
    Uω (aρ 8) (bρ 8) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(412937816014834911931 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35028114207731197 / 80000000000000000 : ℝ) ≤
      (-(412937816014834911931 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35028114207731197 / 80000000000000000 : ℝ) =
            (35028114207731197 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35028114207731197 / 20000000000000000 : ℝ) ≤
            (280209364285165088069 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2160452974547259 / 5000000000000000 : ℝ)) (q :=
      (35028114207731197 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_494_9 :
    Uω (aρ 9) (bρ 9) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(920948505196492789883 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (31851297816458373 / 80000000000000000 : ℝ) ≤
      (-(920948505196492789883 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (31851297816458373 / 80000000000000000 : ℝ) =
            (31851297816458373 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (31851297816458373 / 20000000000000000 : ℝ) ≤
            (465345855403507210117 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (483458434954539 / 1250000000000000 : ℝ)) (q :=
      (31851297816458373 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_494_10 :
    Uω (aρ 10) (bρ 10) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(10523718442281250153947 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27928698770740433 / 80000000000000000 : ℝ) ≤
      (-(10523718442281250153947 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (27928698770740433 / 80000000000000000 : ℝ) =
            (27928698770740433 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27928698770740433 / 20000000000000000 : ℝ) ≤
            (3339225163718749846053 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3275576751701827 / 10000000000000000 : ℝ)) (q :=
      (27928698770740433 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_494_11 :
    Uω (aρ 11) (bρ 11) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(12425522060461687284879 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4618345461216777 / 16000000000000000 : ℝ) ≤
      (-(12425522060461687284879 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4618345461216777 / 16000000000000000 : ℝ) =
            (4618345461216777 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4618345461216777 / 4000000000000000 : ℝ) ≤
            (1437421545538312715121 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (248481051174269 / 1000000000000000 : ℝ)) (q :=
      (4618345461216777 / 16000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_494_12 :
    Uω (aρ 12) (bρ 12) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(7906272266414078093663 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16457349912420733 / 80000000000000000 : ℝ) ≤
      (-(7906272266414078093663 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16457349912420733 / 80000000000000000 : ℝ) =
            (16457349912420733 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16457349912420733 / 10000000000000000 : ℝ) ≤
            (2490935438085921906337 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (624958130005951 / 5000000000000000 : ℝ)) (q :=
      (16457349912420733 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_494_13 :
    Uω (aρ 13) (bρ 13) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_494_14 :
    Uω (aρ 14) (bρ 14) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_494_15 :
    Uω (aρ 15) (bρ 15) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_494_16 :
    Uω (aρ 16) (bρ 16) (34833359663509 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_494 :
    Uρ (34833359663509 / 64000000000000 : ℝ) ≤
      (-(9641037249386160701971 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (34833359663509 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1240468209150847565031 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (34833359663509 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1561737037791314671991 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (34833359663509 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(792100385176676737587 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (34833359663509 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3243983711969671616221 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (34833359663509 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1344592080656173711347 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (34833359663509 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1767668351937252963239 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (34833359663509 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3783602158894347139321 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (34833359663509 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(412937816014834911931 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (34833359663509 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(920948505196492789883 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (34833359663509 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10523718442281250153947 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (34833359663509 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(12425522060461687284879 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (34833359663509 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(7906272266414078093663 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (34833359663509 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (34833359663509 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (34833359663509 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (34833359663509 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_494_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_495_1 :
    Uω (aρ 1) (bρ 1) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(123814862410195933307 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17230164374104697 / 32000000000000000 : ℝ) ≤
      (-(123814862410195933307 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (17230164374104697 / 32000000000000000 : ℝ) =
            (17230164374104697 / 16000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17230164374104697 / 16000000000000000 : ℝ) ≤
            (14814573649804066693 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (538439634181817 / 1000000000000000 : ℝ)) (q :=
      (17230164374104697 / 32000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_495_2 :
    Uω (aρ 2) (bρ 2) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(3117649020088563942417 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17153566282955233 / 32000000000000000 : ℝ) ≤
      (-(3117649020088563942417 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (17153566282955233 / 32000000000000000 : ℝ) =
            (17153566282955233 / 16000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17153566282955233 / 16000000000000000 : ℝ) ≤
            (348086881411436057583 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1072058309471951 / 2000000000000000 : ℝ)) (q :=
      (17153566282955233 / 32000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_495_3 :
    Uω (aρ 3) (bρ 3) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(6325046771053860354781 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85001519930734413 / 160000000000000000 : ℝ) ≤
      (-(6325046771053860354781 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85001519930734413 / 160000000000000000 : ℝ) =
            (85001519930734413 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85001519930734413 / 80000000000000000 : ℝ) ≤
            (606425031946139645219 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (663987339775567 / 1250000000000000 : ℝ)) (q :=
      (85001519930734413 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_495_4 :
    Uω (aρ 4) (bρ 4) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(1619007283210977189607 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (83727786666321213 / 160000000000000000 : ℝ) ≤
      (-(1619007283210977189607 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (83727786666321213 / 160000000000000000 : ℝ) =
            (83727786666321213 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (83727786666321213 / 80000000000000000 : ℝ) ≤
            (113860667539022810393 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2615488120608943 / 5000000000000000 : ℝ)) (q :=
      (83727786666321213 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_495_5 :
    Uω (aρ 5) (bρ 5) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(6710730648684770959207 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (81785564105388597 / 160000000000000000 : ℝ) ≤
      (-(6710730648684770959207 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (81785564105388597 / 160000000000000000 : ℝ) =
            (81785564105388597 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (81785564105388597 / 80000000000000000 : ℝ) ≤
            (220741154315229040793 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5106388340436309 / 10000000000000000 : ℝ)) (q :=
      (81785564105388597 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_495_6 :
    Uω (aρ 6) (bρ 6) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(1764498042931787618447 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (78994213072824829 / 160000000000000000 : ℝ) ≤
      (-(1764498042931787618447 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (78994213072824829 / 160000000000000000 : ℝ) =
            (78994213072824829 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (78994213072824829 / 40000000000000000 : ℝ) ≤
            (1701237858568212381553 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2462354918252919 / 5000000000000000 : ℝ)) (q :=
      (78994213072824829 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_495_7 :
    Uω (aρ 7) (bρ 7) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(1888458229577260486051 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (75172879644487933 / 160000000000000000 : ℝ) ≤
      (-(1888458229577260486051 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (75172879644487933 / 160000000000000000 : ℝ) =
            (75172879644487933 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (75172879644487933 / 40000000000000000 : ℝ) ≤
            (1577277671922739513949 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2335352269361863 / 5000000000000000 : ℝ)) (q :=
      (75172879644487933 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_495_8 :
    Uω (aρ 8) (bρ 8) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(4122161456257221488253 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (70157416433532973 / 160000000000000000 : ℝ) ≤
      (-(4122161456257221488253 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (70157416433532973 / 160000000000000000 : ℝ) =
            (70157416433532973 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (70157416433532973 / 40000000000000000 : ℝ) ≤
            (2809310346742778511747 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1081828322173589 / 2500000000000000 : ℝ)) (q :=
      (70157416433532973 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_495_9 :
    Uω (aρ 9) (bρ 9) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(9193362059771989769797 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (63805386120366957 / 160000000000000000 : ℝ) ≤
      (-(9193362059771989769797 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (63805386120366957 / 160000000000000000 : ℝ) =
            (63805386120366957 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (63805386120366957 / 40000000000000000 : ℝ) ≤
            (4669581546228010230203 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (968568781977151 / 2500000000000000 : ℝ)) (q :=
      (63805386120366957 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_495_10 :
    Uω (aρ 10) (bρ 10) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(5252342660226903689753 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (55963812845365133 / 160000000000000000 : ℝ) ≤
      (-(5252342660226903689753 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (55963812845365133 / 160000000000000000 : ℝ) =
            (55963812845365133 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (55963812845365133 / 40000000000000000 : ℝ) ≤
            (1679129142773096310247 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (410329687753547 / 1250000000000000 : ℝ)) (q :=
      (55963812845365133 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_495_11 :
    Uω (aρ 11) (bρ 11) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(2480089286429880528157 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46299407845621909 / 160000000000000000 : ℝ) ≤
      (-(2480089286429880528157 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46299407845621909 / 160000000000000000 : ℝ) =
            (46299407845621909 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46299407845621909 / 40000000000000000 : ℝ) ≤
            (292499434770119471843 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2493063503265473 / 10000000000000000 : ℝ)) (q :=
      (46299407845621909 / 160000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_495_12 :
    Uω (aρ 12) (bρ 12) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(3152578911133758865109 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33078527600011461 / 160000000000000000 : ℝ) ≤
      (-(3152578911133758865109 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33078527600011461 / 160000000000000000 : ℝ) =
            (33078527600011461 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33078527600011461 / 20000000000000000 : ℝ) ≤
            (1006304170666241134891 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1264153569249167 / 10000000000000000 : ℝ)) (q :=
      (33078527600011461 / 160000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_495_13 :
    Uω (aρ 13) (bρ 13) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_495_14 :
    Uω (aρ 14) (bρ 14) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_495_15 :
    Uω (aρ 15) (bρ 15) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_495_16 :
    Uω (aρ 16) (bρ 16) (69746606209053 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_495 :
    Uρ (69746606209053 / 128000000000000 : ℝ) ≤
      (-(9626595294409110944959 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (69746606209053 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(123814862410195933307 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (69746606209053 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3117649020088563942417 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (69746606209053 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6325046771053860354781 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (69746606209053 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1619007283210977189607 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (69746606209053 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6710730648684770959207 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (69746606209053 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1764498042931787618447 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (69746606209053 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1888458229577260486051 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (69746606209053 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4122161456257221488253 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (69746606209053 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(9193362059771989769797 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (69746606209053 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5252342660226903689753 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (69746606209053 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(2480089286429880528157 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (69746606209053 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(3152578911133758865109 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (69746606209053 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (69746606209053 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (69746606209053 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (69746606209053 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_495_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
