/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U41) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_496_1 :
    Uω (aρ 1) (bρ 1) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(6179158631021010828439 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10781335128658193 / 20000000000000000 : ℝ) ≤
      (-(6179158631021010828439 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10781335128658193 / 20000000000000000 : ℝ) =
            (10781335128658193 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10781335128658193 / 10000000000000000 : ℝ) ≤
            (752313171978989171561 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5390637574001943 / 10000000000000000 : ℝ)) (q :=
      (10781335128658193 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_496_2 :
    Uω (aρ 2) (bρ 2) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(6223661486905342670339 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (536673085625463 / 1000000000000000 : ℝ) ≤
      (-(6223661486905342670339 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (536673085625463 / 1000000000000000 : ℝ) =
            (536673085625463 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (536673085625463 / 500000000000000 : ℝ) ≤
            (707810316094657329661 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (536653317036301 / 1000000000000000 : ℝ)) (q :=
      (536673085625463 / 1000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_496_3 :
    Uω (aρ 3) (bρ 3) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(1578326067291152192927 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10637673950907967 / 20000000000000000 : ℝ) ≤
      (-(1578326067291152192927 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10637673950907967 / 20000000000000000 : ℝ) =
            (10637673950907967 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10637673950907967 / 10000000000000000 : ℝ) ≤
            (154541883458847807073 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5318141515111717 / 10000000000000000 : ℝ)) (q :=
      (10637673950907967 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_496_4 :
    Uω (aρ 4) (bρ 4) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(6464105087964167300301 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10478460450231381 / 20000000000000000 : ℝ) ≤
      (-(6464105087964167300301 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10478460450231381 / 20000000000000000 : ℝ) =
            (10478460450231381 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10478460450231381 / 10000000000000000 : ℝ) ≤
            (467366715035832699699 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5237222195500131 / 10000000000000000 : ℝ)) (q :=
      (10478460450231381 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_496_5 :
    Uω (aρ 5) (bρ 5) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(6698515862953343862829 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10235690557102619 / 20000000000000000 : ℝ) ≤
      (-(6698515862953343862829 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10235690557102619 / 20000000000000000 : ℝ) =
            (10235690557102619 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10235690557102619 / 10000000000000000 : ℝ) ≤
            (232955940046656137171 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5112642221706369 / 10000000000000000 : ℝ)) (q :=
      (10235690557102619 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_496_6 :
    Uω (aρ 6) (bρ 6) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(7045327077678014554961 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9886790421068631 / 20000000000000000 : ℝ) ≤
      (-(7045327077678014554961 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9886790421068631 / 20000000000000000 : ℝ) =
            (9886790421068631 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9886790421068631 / 5000000000000000 : ℝ) ≤
            (6817616528321985445039 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4930982460812381 / 10000000000000000 : ℝ)) (q :=
      (9886790421068631 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_496_7 :
    Uω (aρ 7) (bρ 7) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(1508095917026171862497 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9409165943257819 / 20000000000000000 : ℝ) ≤
      (-(1508095917026171862497 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9409165943257819 / 20000000000000000 : ℝ) =
            (9409165943257819 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9409165943257819 / 5000000000000000 : ℝ) ≤
            (1264492804173828137503 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4677019363761569 / 10000000000000000 : ℝ)) (q :=
      (9409165943257819 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_496_8 :
    Uω (aρ 8) (bρ 8) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(514369428705734080287 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8782325071442361 / 20000000000000000 : ℝ) ≤
      (-(514369428705734080287 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8782325071442361 / 20000000000000000 : ℝ) =
            (8782325071442361 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8782325071442361 / 5000000000000000 : ℝ) ≤
            (352064546669265919713 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4333720143286111 / 10000000000000000 : ℝ)) (q :=
      (8782325071442361 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_496_9 :
    Uω (aρ 9) (bρ 9) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(9177266539706387383039 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (63908166900943 / 160000000000000 : ℝ) ≤
      (-(9177266539706387383039 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (63908166900943 / 160000000000000 : ℝ) = (63908166900943 / 40000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (63908166900943 / 40000000000000 : ℝ) ≤
            (4685677066293612616961 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (31047052502573 / 80000000000000 : ℝ)) (q :=
      (63908166900943 / 160000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_496_10 :
    Uω (aρ 10) (bρ 10) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(10485693084161377691493 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7008775204647261 / 20000000000000000 : ℝ) ≤
      (-(10485693084161377691493 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7008775204647261 / 20000000000000000 : ℝ) =
            (7008775204647261 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7008775204647261 / 5000000000000000 : ℝ) ≤
            (3377250521838622308507 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3289694938346011 / 10000000000000000 : ℝ)) (q :=
      (7008775204647261 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_496_11 :
    Uω (aρ 11) (bρ 11) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(193366462786153684599 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5801908477093199 / 20000000000000000 : ℝ) ≤
      (-(193366462786153684599 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5801908477093199 / 20000000000000000 : ℝ) =
            (5801908477093199 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5801908477093199 / 5000000000000000 : ℝ) ≤
            (23242031057596315401 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2501304836996949 / 10000000000000000 : ℝ)) (q :=
      (5801908477093199 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_496_12 :
    Uω (aρ 12) (bρ 12) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(1964224768782355217967 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (415516632565571 / 2000000000000000 : ℝ) ≤
      (-(1964224768782355217967 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (415516632565571 / 2000000000000000 : ℝ) =
            (415516632565571 / 250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (415516632565571 / 250000000000000 : ℝ) ≤
            (635077157342644782033 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (63913139112223 / 500000000000000 : ℝ)) (q :=
      (415516632565571 / 2000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12]) (by norm_num [bρ_12])
      (by norm_num) (by norm_num [aρ_12, bρ_12]) (by norm_num [aρ_12, bρ_12]) hlg

lemma U_496_13 :
    Uω (aρ 13) (bρ 13) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_496_14 :
    Uω (aρ 14) (bρ 14) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_496_15 :
    Uω (aρ 15) (bρ 15) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_496_16 :
    Uω (aρ 16) (bρ 16) (4364155818193 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_496 :
    Uρ (4364155818193 / 8000000000000 : ℝ) ≤
      (-(480610621488243035319 / 500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4364155818193 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6179158631021010828439 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4364155818193 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6223661486905342670339 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4364155818193 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1578326067291152192927 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4364155818193 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6464105087964167300301 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4364155818193 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6698515862953343862829 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4364155818193 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(7045327077678014554961 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4364155818193 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1508095917026171862497 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4364155818193 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(514369428705734080287 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4364155818193 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(9177266539706387383039 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4364155818193 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10485693084161377691493 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4364155818193 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(193366462786153684599 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4364155818193 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1964224768782355217967 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4364155818193 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4364155818193 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4364155818193 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4364155818193 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_496_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_497_1 :
    Uω (aρ 1) (bρ 1) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(6167587546193927183517 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (86350540186721179 / 160000000000000000 : ℝ) ≤
      (-(6167587546193927183517 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (86350540186721179 / 160000000000000000 : ℝ) =
            (86350540186721179 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (86350540186721179 / 80000000000000000 : ℝ) ≤
            (763884256806072816483 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5396878806024913 / 10000000000000000 : ℝ)) (q :=
      (86350540186721179 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_497_2 :
    Uω (aρ 2) (bρ 2) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(6212038459828908181177 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85967555976815707 / 160000000000000000 : ℝ) ≤
      (-(6212038459828908181177 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85967555976815707 / 160000000000000000 : ℝ) =
            (85967555976815707 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85967555976815707 / 80000000000000000 : ℝ) ≤
            (719433343171091818823 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5372774792296729 / 10000000000000000 : ℝ)) (q :=
      (85967555976815707 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_497_3 :
    Uω (aρ 3) (bρ 3) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(6153882366540572167 / 9765625000000000000 : ℝ)) := by
  have hlg :
    Real.log (17040252650627759 / 32000000000000000 : ℝ) ≤
      (-(6153882366540572167 / 9765625000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (17040252650627759 / 32000000000000000 : ℝ) =
            (17040252650627759 / 16000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17040252650627759 / 16000000000000000 : ℝ) ≤
            (615133066076615333 / 9765625000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1064876861637423 / 2000000000000000 : ℝ)) (q :=
      (17040252650627759 / 32000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_497_4 :
    Uω (aρ 4) (bρ 4) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(6452195255314039757353 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (83927580446092347 / 160000000000000000 : ℝ) ≤
      (-(6452195255314039757353 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (83927580446092347 / 160000000000000000 : ℝ) =
            (83927580446092347 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (83927580446092347 / 80000000000000000 : ℝ) ≤
            (479276547685960242647 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5243468138371309 / 10000000000000000 : ℝ)) (q :=
      (83927580446092347 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_497_5 :
    Uω (aρ 5) (bρ 5) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(668631600941429284913 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (81985484559887883 / 160000000000000000 : ℝ) ≤
      (-(668631600941429284913 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (81985484559887883 / 160000000000000000 : ℝ) =
            (81985484559887883 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (81985484559887883 / 80000000000000000 : ℝ) ≤
            (24515579358570715087 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5118896071930751 / 10000000000000000 : ℝ)) (q :=
      (81985484559887883 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_497_6 :
    Uω (aρ 6) (bρ 6) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(6867849691752660767 / 9765625000000000000 : ℝ)) := by
  have hlg :
    Real.log (79194433026340883 / 160000000000000000 : ℝ) ≤
      (-(6867849691752660767 / 9765625000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (79194433026340883 / 160000000000000000 : ℝ) =
            (79194433026340883 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (79194433026340883 / 40000000000000000 : ℝ) ≤
            (6670181173481714233 / 9765625000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (154289218918043 / 312500000000000 : ℝ)) (q :=
      (79194433026340883 / 160000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_497_7 :
    Uω (aρ 7) (bρ 7) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(7527144268936852965187 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (75373773867730363 / 160000000000000000 : ℝ) ≤
      (-(7527144268936852965187 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (75373773867730363 / 160000000000000000 : ℝ) =
            (75373773867730363 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (75373773867730363 / 40000000000000000 : ℝ) ≤
            (6335799337063147034813 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4683333991311061 / 10000000000000000 : ℝ)) (q :=
      (75373773867730363 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_497_8 :
    Uω (aρ 8) (bρ 8) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(513470005995439371749 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (70359780846663291 / 160000000000000000 : ℝ) ≤
      (-(513470005995439371749 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (70359780846663291 / 160000000000000000 : ℝ) =
            (70359780846663291 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (70359780846663291 / 40000000000000000 : ℝ) ≤
            (352963969379560628251 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4340126515017677 / 10000000000000000 : ℝ)) (q :=
      (70359780846663291 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_497_9 :
    Uω (aρ 9) (bρ 9) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(366447935732025427061 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (64010938024132779 / 160000000000000000 : ℝ) ≤
      (-(366447935732025427061 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (64010938024132779 / 160000000000000000 : ℝ) =
            (64010938024132779 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (64010938024132779 / 40000000000000000 : ℝ) ≤
            (188069808507974572939 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3887486790561363 / 10000000000000000 : ℝ)) (q :=
      (64010938024132779 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_497_10 :
    Uω (aρ 10) (bρ 10) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(1308342692389497524921 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56176564087184987 / 160000000000000000 : ℝ) ≤
      (-(1308342692389497524921 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56176564087184987 / 160000000000000000 : ℝ) =
            (56176564087184987 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56176564087184987 / 40000000000000000 : ℝ) ≤
            (424525258360502475079 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3296749081937889 / 10000000000000000 : ℝ)) (q :=
      (56176564087184987 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_497_11 :
    Uω (aρ 11) (bρ 11) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(3087635739603101573631 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46531035444361763 / 160000000000000000 : ℝ) ≤
      (-(3087635739603101573631 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46531035444361763 / 160000000000000000 : ℝ) =
            (46531035444361763 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46531035444361763 / 40000000000000000 : ℝ) ≤
            (378100161896898426369 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1254767313894993 / 5000000000000000 : ℝ)) (q :=
      (46531035444361763 / 160000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_497_12 :
    Uω (aρ 12) (bρ 12) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(3133047669711312742019 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (33403142406979611 / 160000000000000000 : ℝ) ≤
      (-(3133047669711312742019 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (33403142406979611 / 160000000000000000 : ℝ) =
            (33403142406979611 / 20000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (33403142406979611 / 20000000000000000 : ℝ) ≤
            (1025835412088687257981 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1292248094802217 / 10000000000000000 : ℝ)) (q :=
      (33403142406979611 / 160000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_497_13 :
    Uω (aρ 13) (bρ 13) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_497_14 :
    Uω (aρ 14) (bρ 14) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_497_15 :
    Uω (aρ 15) (bρ 15) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_497_16 :
    Uω (aρ 16) (bρ 16) (69906379973123 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_497 :
    Uρ (69906379973123 / 128000000000000 : ℝ) ≤
      (-(2399471840990113090949 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (69906379973123 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6167587546193927183517 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (69906379973123 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6212038459828908181177 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (69906379973123 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) * (-(6153882366540572167 / 9765625000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (69906379973123 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6452195255314039757353 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (69906379973123 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(668631600941429284913 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (69906379973123 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(6867849691752660767 / 9765625000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (69906379973123 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7527144268936852965187 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (69906379973123 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(513470005995439371749 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (69906379973123 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(366447935732025427061 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (69906379973123 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1308342692389497524921 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (69906379973123 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3087635739603101573631 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (69906379973123 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(3133047669711312742019 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (69906379973123 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (69906379973123 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (69906379973123 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (69906379973123 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_497_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_498_1 :
    Uω (aρ 1) (bρ 1) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(6156029835042409091741 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43225199671447423 / 80000000000000000 : ℝ) ≤
      (-(6156029835042409091741 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43225199671447423 / 80000000000000000 : ℝ) =
            (43225199671447423 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43225199671447423 / 40000000000000000 : ℝ) ≤
            (775441967957590908259 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5403120037887637 / 10000000000000000 : ℝ)) (q :=
      (43225199671447423 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_498_2 :
    Uω (aρ 2) (bρ 2) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(1550107231884159405343 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8606741824503083 / 16000000000000000 : ℝ) ≤
      (-(1550107231884159405343 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8606741824503083 / 16000000000000000 : ℝ) =
            (8606741824503083 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8606741824503083 / 8000000000000000 : ℝ) ≤
            (182760718865840594657 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1075803282632927 / 2000000000000000 : ℝ)) (q :=
      (8606741824503083 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_498_3 :
    Uω (aρ 3) (bρ 3) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(1257972112255709486683 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42650567434233643 / 80000000000000000 : ℝ) ≤
      (-(1257972112255709486683 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42650567434233643 / 80000000000000000 : ℝ) =
            (42650567434233643 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42650567434233643 / 40000000000000000 : ℝ) ≤
            (128322248344290513317 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (166582096795131 / 312500000000000 : ℝ)) (q :=
      (42650567434233643 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_498_4 :
    Uω (aρ 4) (bρ 4) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(6440299601029007882821 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42013738599685479 / 80000000000000000 : ℝ) ≤
      (-(6440299601029007882821 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42013738599685479 / 80000000000000000 : ℝ) =
            (42013738599685479 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42013738599685479 / 40000000000000000 : ℝ) ≤
            (491172201970992117179 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5249714069872151 / 10000000000000000 : ℝ)) (q :=
      (42013738599685479 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_498_5 :
    Uω (aρ 5) (bρ 5) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(6674131051530196510577 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41042722207749283 / 80000000000000000 : ℝ) ≤
      (-(6674131051530196510577 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41042722207749283 / 80000000000000000 : ℝ) =
            (41042722207749283 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41042722207749283 / 40000000000000000 : ℝ) ≤
            (257340751469803489423 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2562574945611551 / 5000000000000000 : ℝ)) (q :=
      (41042722207749283 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_498_6 :
    Uω (aρ 6) (bρ 6) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(438752821916816559511 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39647271024314323 / 80000000000000000 : ℝ) ≤
      (-(438752821916816559511 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39647271024314323 / 80000000000000000 : ℝ) =
            (39647271024314323 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39647271024314323 / 20000000000000000 : ℝ) ≤
            (427681153458183440489 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2471763735252181 / 5000000000000000 : ℝ)) (q :=
      (39647271024314323 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_498_7 :
    Uω (aρ 7) (bρ 7) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(7513826920613636684123 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37737109307936711 / 80000000000000000 : ℝ) ≤
      (-(7513826920613636684123 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (37737109307936711 / 80000000000000000 : ℝ) =
            (37737109307936711 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37737109307936711 / 20000000000000000 : ℝ) ≤
            (6349116685386363315877 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4689648422169959 / 10000000000000000 : ℝ)) (q :=
      (37737109307936711 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_498_8 :
    Uω (aρ 8) (bρ 8) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(2050287639504809022989 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35230478637993371 / 80000000000000000 : ℝ) ≤
      (-(2050287639504809022989 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35230478637993371 / 80000000000000000 : ℝ) =
            (35230478637993371 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35230478637993371 / 20000000000000000 : ℝ) ≤
            (1415448261995190977011 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1086633101506031 / 2500000000000000 : ℝ)) (q :=
      (35230478637993371 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_498_9 :
    Uω (aρ 9) (bρ 9) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(9145157522639751445491 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6411369953907939 / 16000000000000000 : ℝ) ≤
      (-(9145157522639751445491 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6411369953907939 / 16000000000000000 : ℝ) =
            (6411369953907939 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6411369953907939 / 4000000000000000 : ℝ) ≤
            (4717786083360248554509 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (778818163454141 / 2000000000000000 : ℝ)) (q :=
      (6411369953907939 / 16000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_498_10 :
    Uω (aρ 10) (bρ 10) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(10447830492519363594599 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28141450182058891 / 80000000000000000 : ℝ) ≤
      (-(10447830492519363594599 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28141450182058891 / 80000000000000000 : ℝ) =
            (28141450182058891 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28141450182058891 / 20000000000000000 : ℝ) ≤
            (3415113113480636405401 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (206487497118469 / 625000000000000 : ℝ)) (q :=
      (28141450182058891 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_498_11 :
    Uω (aρ 11) (bρ 11) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(12325713800658735169931 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4664671163400139 / 16000000000000000 : ℝ) ≤
      (-(12325713800658735169931 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4664671163400139 / 16000000000000000 : ℝ) =
            (4664671163400139 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4664671163400139 / 4000000000000000 : ℝ) ≤
            (1537229805341264830069 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (503550597767191 / 2000000000000000 : ℝ)) (q :=
      (4664671163400139 / 16000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_498_12 :
    Uω (aρ 12) (bρ 12) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(7808599520102826369753 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16781997422714663 / 80000000000000000 : ℝ) ≤
      (-(7808599520102826369753 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (16781997422714663 / 80000000000000000 : ℝ) =
            (16781997422714663 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16781997422714663 / 10000000000000000 : ℝ) ≤
            (2588608184397173630247 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1306113486949447 / 10000000000000000 : ℝ)) (q :=
      (16781997422714663 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_498_13 :
    Uω (aρ 13) (bρ 13) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_498_14 :
    Uω (aρ 14) (bρ 14) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_498_15 :
    Uω (aρ 15) (bρ 15) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_498_16 :
    Uω (aρ 16) (bρ 16) (34993133427579 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_498 :
    Uρ (34993133427579 / 64000000000000 : ℝ) ≤
      (-(383344754671723342871 / 400000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (34993133427579 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6156029835042409091741 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (34993133427579 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1550107231884159405343 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (34993133427579 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1257972112255709486683 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (34993133427579 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6440299601029007882821 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (34993133427579 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6674131051530196510577 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (34993133427579 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(438752821916816559511 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (34993133427579 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7513826920613636684123 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (34993133427579 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2050287639504809022989 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (34993133427579 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(9145157522639751445491 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (34993133427579 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10447830492519363594599 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (34993133427579 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(12325713800658735169931 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (34993133427579 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(7808599520102826369753 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (34993133427579 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (34993133427579 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (34993133427579 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (34993133427579 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_498_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_499_1 :
    Uω (aρ 1) (bρ 1) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(3072242733343819264019 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (86550258497790977 / 160000000000000000 : ℝ) ≤
      (-(3072242733343819264019 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (86550258497790977 / 160000000000000000 : ℝ) =
            (86550258497790977 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (86550258497790977 / 80000000000000000 : ℝ) ≤
            (393493168156180735981 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5409361269590669 / 10000000000000000 : ℝ)) (q :=
      (86550258497790977 / 160000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_499_2 :
    Uω (aρ 2) (bρ 2) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(6188832858726643796807 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (86167280504749081 / 160000000000000000 : ℝ) ≤
      (-(6188832858726643796807 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (86167280504749081 / 160000000000000000 : ℝ) =
            (86167280504749081 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (86167280504749081 / 80000000000000000 : ℝ) ≤
            (742638944273356203193 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (84144656765163 / 156250000000000 : ℝ)) (q :=
      (86167280504749081 / 160000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_499_3 :
    Uω (aρ 3) (bρ 3) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(6278159290806943346951 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85401006453356393 / 160000000000000000 : ℝ) ≤
      (-(6278159290806943346951 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (85401006453356393 / 160000000000000000 : ℝ) =
            (85401006453356393 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85401006453356393 / 80000000000000000 : ℝ) ≤
            (653312512193056653049 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2668434941448173 / 5000000000000000 : ℝ)) (q :=
      (85401006453356393 / 160000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_499_4 :
    Uω (aρ 4) (bρ 4) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(6428418091365539699 / 10000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (84127373862011169 / 160000000000000000 : ℝ) ≤
      (-(6428418091365539699 / 10000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (84127373862011169 / 160000000000000000 : ℝ) =
            (84127373862011169 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (84127373862011169 / 80000000000000000 : ℝ) ≤
            (503053711634460301 / 10000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5255959990043193 / 10000000000000000 : ℝ)) (q :=
      (84127373862011169 / 160000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_499_5 :
    Uω (aρ 5) (bρ 5) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(832745119112230134817 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (82185404024557753 / 160000000000000000 : ℝ) ≤
      (-(832745119112230134817 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (82185404024557753 / 160000000000000000 : ℝ) =
            (82185404024557753 / 80000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (82185404024557753 / 80000000000000000 : ℝ) ≤
            (33688856262769865183 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1282850919924129 / 2500000000000000 : ℝ)) (q :=
      (82185404024557753 / 160000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_499_6 :
    Uω (aρ 6) (bρ 6) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(3503714117845335411479 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15878930087565661 / 32000000000000000 : ℝ) ≤
      (-(3503714117845335411479 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15878930087565661 / 32000000000000000 : ℝ) =
            (15878930087565661 / 8000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15878930087565661 / 8000000000000000 : ℝ) ≤
            (3427757685154664588521 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (989959971299067 / 2000000000000000 : ℝ)) (q :=
      (15878930087565661 / 32000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_499_7 :
    Uω (aρ 7) (bρ 7) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(937565936406325238339 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (75574661796839249 / 160000000000000000 : ℝ) ≤
      (-(937565936406325238339 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (75574661796839249 / 160000000000000000 : ℝ) =
            (75574661796839249 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (75574661796839249 / 40000000000000000 : ℝ) ≤
            (795302014343674761661 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4695962657131703 / 10000000000000000 : ℝ)) (q :=
      (75574661796839249 / 160000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_499_8 :
    Uω (aρ 8) (bρ 8) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(1637360436293184612359 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (70562129876487961 / 160000000000000000 : ℝ) ≤
      (-(1637360436293184612359 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (70562129876487961 / 160000000000000000 : ℝ) =
            (70562129876487961 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (70562129876487961 / 40000000000000000 : ℝ) ≤
            (1135228284906815387641 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (272058613651737 / 625000000000000 : ℝ)) (q :=
      (70562129876487961 / 160000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_499_9 :
    Uω (aρ 9) (bρ 9) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(4564571915178486632409 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (64216451494584217 / 160000000000000000 : ℝ) ≤
      (-(4564571915178486632409 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (64216451494584217 / 160000000000000000 : ℝ) =
            (64216451494584217 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (64216451494584217 / 40000000000000000 : ℝ) ≤
            (2366899887821513367591 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (121896676532807 / 312500000000000 : ℝ)) (q :=
      (64216451494584217 / 160000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_499_10 :
    Uω (aρ 10) (bρ 10) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(2607239938261753790789 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (56389210635193161 / 160000000000000000 : ℝ) ≤
      (-(2607239938261753790789 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (56389210635193161 / 160000000000000000 : ℝ) =
            (56389210635193161 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (56389210635193161 / 40000000000000000 : ℝ) ≤
            (858495963238246209211 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1655423787560471 / 5000000000000000 : ℝ)) (q :=
      (56389210635193161 / 160000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_499_11 :
    Uω (aρ 11) (bρ 11) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(6150482750929794706883 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46762297278161161 / 160000000000000000 : ℝ) ≤
      (-(6150482750929794706883 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (46762297278161161 / 160000000000000000 : ℝ) =
            (46762297278161161 / 40000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46762297278161161 / 40000000000000000 : ℝ) ≤
            (780989052070205293117 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1262980015848471 / 5000000000000000 : ℝ)) (q :=
      (46762297278161161 / 160000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_499_12 :
    Uω (aρ 12) (bρ 12) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(15569664912888544190381 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6744783631096493 / 32000000000000000 : ℝ) ≤
      (-(15569664912888544190381 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (6744783631096493 / 32000000000000000 : ℝ) =
            (6744783631096493 / 4000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6744783631096493 / 4000000000000000 : ℝ) ≤
            (5224750496111455809619 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (263972547609421 / 2000000000000000 : ℝ)) (q :=
      (6744783631096493 / 32000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_499_13 :
    Uω (aρ 13) (bρ 13) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_499_14 :
    Uω (aρ 14) (bρ 14) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_499_15 :
    Uω (aρ 15) (bρ 15) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_499_16 :
    Uω (aρ 16) (bρ 16) (70066153737193 / 128000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_499 :
    Uρ (70066153737193 / 128000000000000 : ℝ) ≤
      (-(9569405765138696291859 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (70066153737193 / 128000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3072242733343819264019 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (70066153737193 / 128000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6188832858726643796807 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (70066153737193 / 128000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6278159290806943346951 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (70066153737193 / 128000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(6428418091365539699 / 10000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (70066153737193 / 128000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(832745119112230134817 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (70066153737193 / 128000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3503714117845335411479 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (70066153737193 / 128000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(937565936406325238339 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (70066153737193 / 128000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1637360436293184612359 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (70066153737193 / 128000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4564571915178486632409 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (70066153737193 / 128000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2607239938261753790789 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (70066153737193 / 128000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6150482750929794706883 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (70066153737193 / 128000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(15569664912888544190381 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (70066153737193 / 128000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (70066153737193 / 128000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (70066153737193 / 128000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (70066153737193 / 128000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_499_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_500_1 :
    Uω (aρ 1) (bρ 1) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(6132954410357619226903 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21662529412853499 / 40000000000000000 : ℝ) ≤
      (-(6132954410357619226903 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21662529412853499 / 40000000000000000 : ℝ) =
            (21662529412853499 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21662529412853499 / 20000000000000000 : ℝ) ≤
            (798517392642380773097 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2707801250567281 / 5000000000000000 : ℝ)) (q :=
      (21662529412853499 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_500_2 :
    Uω (aρ 2) (bρ 2) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(6177250222205826174879 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21566785688999999 / 40000000000000000 : ℝ) ≤
      (-(6177250222205826174879 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21566785688999999 / 40000000000000000 : ℝ) =
            (21566785688999999 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21566785688999999 / 20000000000000000 : ℝ) ≤
            (754221580794173825121 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1347874912929453 / 2500000000000000 : ℝ)) (q :=
      (21566785688999999 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_500_3 :
    Uω (aρ 3) (bρ 3) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(195827240620468206163 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21375219501978207 / 40000000000000000 : ℝ) ≤
      (-(195827240620468206163 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21375219501978207 / 40000000000000000 : ℝ) =
            (21375219501978207 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21375219501978207 / 20000000000000000 : ℝ) ≤
            (20781253223281793837 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1335778166139229 / 2500000000000000 : ℝ)) (q :=
      (21375219501978207 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_500_4 :
    Uω (aρ 4) (bρ 4) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(3208275346350256311827 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21056817608583931 / 40000000000000000 : ℝ) ≤
      (-(3208275346350256311827 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21056817608583931 / 40000000000000000 : ℝ) =
            (21056817608583931 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21056817608583931 / 20000000000000000 : ℝ) ≤
            (257460555149743688173 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2631102949462389 / 5000000000000000 : ℝ)) (q :=
      (21056817608583931 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_500_5 :
    Uω (aρ 5) (bρ 5) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(831225709655945375553 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20571340846991449 / 40000000000000000 : ℝ) ≤
      (-(831225709655945375553 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20571340846991449 / 40000000000000000 : ℝ) =
            (20571340846991449 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20571340846991449 / 20000000000000000 : ℝ) ≤
            (35208265719054624447 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5137657437463537 / 10000000000000000 : ℝ)) (q :=
      (20571340846991449 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_500_6 :
    Uω (aρ 6) (bρ 6) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(6994827298646218981741 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19873689549085887 / 40000000000000000 : ℝ) ≤
      (-(6994827298646218981741 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19873689549085887 / 40000000000000000 : ℝ) =
            (19873689549085887 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19873689549085887 / 10000000000000000 : ℝ) ≤
            (6868116307353781018259 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1239018040912689 / 2500000000000000 : ℝ)) (q :=
      (19873689549085887 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_500_7 :
    Uω (aρ 7) (bρ 7) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(7487245932138787324571 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18918775854235273 / 40000000000000000 : ℝ) ≤
      (-(7487245932138787324571 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (18918775854235273 / 40000000000000000 : ℝ) =
            (18918775854235273 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18918775854235273 / 10000000000000000 : ℝ) ≤
            (6375697673861212675429 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4702276696985449 / 10000000000000000 : ℝ)) (q :=
      (18918775854235273 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_500_8 :
    Uω (aρ 8) (bρ 8) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(4086237451230692446593 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3533164933252231 / 8000000000000000 : ℝ) ≤
      (-(4086237451230692446593 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3533164933252231 / 8000000000000000 : ℝ) =
            (3533164933252231 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3533164933252231 / 2000000000000000 : ℝ) ≤
            (2845234351769307553407 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (435934275433839 / 1000000000000000 : ℝ)) (q :=
      (3533164933252231 / 8000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_500_9 :
    Uω (aρ 9) (bρ 9) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(2278289304907380917197 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16079798484777499 / 40000000000000000 : ℝ) ≤
      (-(2278289304907380917197 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (16079798484777499 / 40000000000000000 : ℝ) =
            (16079798484777499 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16079798484777499 / 10000000000000000 : ℝ) ≤
            (1187446596592619082803 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1953647645978281 / 5000000000000000 : ℝ)) (q :=
      (16079798484777499 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_500_10 :
    Uω (aρ 10) (bρ 10) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(10410129130832395465343 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (564954950661303 / 1600000000000000 : ℝ) ≤
      (-(10410129130832395465343 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (564954950661303 / 1600000000000000 : ℝ) =
            (564954950661303 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (564954950661303 / 400000000000000 : ℝ) ≤
            (3452814475167604534657 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33178919663291 / 100000000000000 : ℝ)) (q :=
      (564954950661303 / 1600000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_500_11 :
    Uω (aρ 11) (bρ 11) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(12276297427255723426533 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (468777932565549 / 1600000000000000 : ℝ) ≤
      (-(12276297427255723426533 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (468777932565549 / 1600000000000000 : ℝ) =
            (468777932565549 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (468777932565549 / 400000000000000 : ℝ) ≤
            (1586646178744276573467 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (101366234653487 / 400000000000000 : ℝ)) (q :=
      (468777932565549 / 1600000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_500_12 :
    Uω (aρ 12) (bρ 12) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(3880655349478368086291 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8470735269235369 / 40000000000000000 : ℝ) ≤
      (-(3880655349478368086291 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8470735269235369 / 40000000000000000 : ℝ) =
            (8470735269235369 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8470735269235369 / 5000000000000000 : ℝ) ≤
            (1317948502771631913709 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1333499440570497 / 10000000000000000 : ℝ)) (q :=
      (8470735269235369 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_500_13 :
    Uω (aρ 13) (bρ 13) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_500_14 :
    Uω (aρ 14) (bρ 14) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_500_15 :
    Uω (aρ 15) (bρ 15) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_500_16 :
    Uω (aρ 16) (bρ 16) (17536510154807 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_500 :
    Uρ (17536510154807 / 32000000000000 : ℝ) ≤
      (-(382209877564364374023 / 400000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (17536510154807 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6132954410357619226903 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (17536510154807 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6177250222205826174879 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (17536510154807 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(195827240620468206163 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (17536510154807 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3208275346350256311827 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (17536510154807 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(831225709655945375553 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (17536510154807 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6994827298646218981741 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (17536510154807 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7487245932138787324571 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (17536510154807 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4086237451230692446593 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (17536510154807 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2278289304907380917197 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (17536510154807 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10410129130832395465343 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (17536510154807 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(12276297427255723426533 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (17536510154807 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(3880655349478368086291 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (17536510154807 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (17536510154807 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (17536510154807 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (17536510154807 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_500_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_501_1 :
    Uω (aρ 1) (bρ 1) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(1527483027803754788683 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43424917977429129 / 80000000000000000 : ℝ) ≤
      (-(1527483027803754788683 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43424917977429129 / 80000000000000000 : ℝ) =
            (43424917977429129 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43424917977429129 / 40000000000000000 : ℝ) ≤
            (205384922946245211317 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2714042481873563 / 5000000000000000 : ℝ)) (q :=
      (43424917977429129 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_501_2 :
    Uω (aρ 2) (bρ 2) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(3077062560900137648367 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43233433616608557 / 80000000000000000 : ℝ) ≤
      (-(3077062560900137648367 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43233433616608557 / 80000000000000000 : ℝ) =
            (43233433616608557 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43233433616608557 / 40000000000000000 : ℝ) ≤
            (388673340599862351633 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5403982886051983 / 10000000000000000 : ℝ)) (q :=
      (43233433616608557 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_501_3 :
    Uω (aρ 3) (bρ 3) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(6243137428800446165823 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42850310513225973 / 80000000000000000 : ℝ) ≤
      (-(6243137428800446165823 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42850310513225973 / 80000000000000000 : ℝ) =
            (42850310513225973 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42850310513225973 / 40000000000000000 : ℝ) ≤
            (688334374199553834177 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5355598216556337 / 10000000000000000 : ℝ)) (q :=
      (42850310513225973 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_501_4 :
    Uω (aρ 4) (bρ 4) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(3196429047235951039163 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8442706330932121 / 16000000000000000 : ℝ) ≤
      (-(3196429047235951039163 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8442706330932121 / 16000000000000000 : ℝ) =
            (8442706330932121 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8442706330932121 / 8000000000000000 : ℝ) ≤
            (269306854264048960837 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1054939536595999 / 2000000000000000 : ℝ)) (q :=
      (8442706330932121 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_501_5 :
    Uω (aρ 5) (bρ 5) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(3312769725239216942567 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41242640690703941 / 80000000000000000 : ℝ) ≤
      (-(3312769725239216942567 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41242640690703941 / 80000000000000000 : ℝ) =
            (41242640690703941 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41242640690703941 / 40000000000000000 : ℝ) ≤
            (152966176260783057433 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5150164861325829 / 10000000000000000 : ℝ)) (q :=
      (41242640690703941 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_501_6 :
    Uω (aρ 6) (bρ 6) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(6969673196046202864671 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39847485915437389 / 80000000000000000 : ℝ) ≤
      (-(6969673196046202864671 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39847485915437389 / 80000000000000000 : ℝ) =
            (39847485915437389 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39847485915437389 / 20000000000000000 : ℝ) ≤
            (6893270409953797135329 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4968616542649191 / 10000000000000000 : ℝ)) (q :=
      (39847485915437389 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_501_7 :
    Uω (aρ 7) (bρ 7) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(746073623083452947819 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37937990999817837 / 80000000000000000 : ℝ) ≤
      (-(746073623083452947819 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (37937990999817837 / 80000000000000000 : ℝ) =
            (37937990999817837 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37937990999817837 / 20000000000000000 : ℝ) ≤
            (640220737516547052181 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4714904194504303 / 10000000000000000 : ℝ)) (q :=
      (37937990999817837 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_501_8 :
    Uω (aρ 8) (bρ 8) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(4071941691674149917709 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35432812436667113 / 80000000000000000 : ℝ) ≤
      (-(4071941691674149917709 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35432812436667113 / 80000000000000000 : ℝ) =
            (35432812436667113 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35432812436667113 / 20000000000000000 : ℝ) ≤
            (2859530111325850082291 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2186075602528311 / 5000000000000000 : ℝ)) (q :=
      (35432812436667113 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_501_9 :
    Uω (aρ 9) (bρ 9) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(4540632429122172497341 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6452465048739989 / 16000000000000000 : ℝ) ≤
      (-(4540632429122172497341 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6452465048739989 / 16000000000000000 : ℝ) =
            (6452465048739989 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6452465048739989 / 4000000000000000 : ℝ) ≤
            (2390839373877827502659 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (392049503517483 / 1000000000000000 : ℝ)) (q :=
      (6452465048739989 / 16000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_501_10 :
    Uω (aρ 10) (bρ 10) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(2074517497181400129451 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28353993531541789 / 80000000000000000 : ℝ) ≤
      (-(2074517497181400129451 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28353993531541789 / 80000000000000000 : ℝ) =
            (28353993531541789 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28353993531541789 / 20000000000000000 : ℝ) ≤
            (698071224018599870549 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3331971140630291 / 10000000000000000 : ℝ)) (q :=
      (28353993531541789 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_501_11 :
    Uω (aρ 11) (bρ 11) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(1222719945283823425943 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23554259836225581 / 80000000000000000 : ℝ) ≤
      (-(1222719945283823425943 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (23554259836225581 / 80000000000000000 : ℝ) =
            (23554259836225581 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23554259836225581 / 20000000000000000 : ℝ) ≤
            (163574415316176574057 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2550514343006239 / 10000000000000000 : ℝ)) (q :=
      (23554259836225581 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_501_12 :
    Uω (aρ 12) (bρ 12) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(15429951354170808899491 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17099196916817357 / 80000000000000000 : ℝ) ≤
      (-(15429951354170808899491 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17099196916817357 / 80000000000000000 : ℝ) =
            (17099196916817357 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17099196916817357 / 10000000000000000 : ℝ) ≤
            (5364464054829191100509 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1360448709839183 / 10000000000000000 : ℝ)) (q :=
      (17099196916817357 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_501_13 :
    Uω (aρ 13) (bρ 13) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_501_14 :
    Uω (aρ 14) (bρ 14) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_501_15 :
    Uω (aρ 15) (bρ 15) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_501_16 :
    Uω (aρ 16) (bρ 16) (35152907191649 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_501 :
    Uρ (35152907191649 / 64000000000000 : ℝ) ≤
      (-(1190885984971035254361 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (35152907191649 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1527483027803754788683 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (35152907191649 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3077062560900137648367 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (35152907191649 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6243137428800446165823 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (35152907191649 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3196429047235951039163 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (35152907191649 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3312769725239216942567 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (35152907191649 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6969673196046202864671 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (35152907191649 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(746073623083452947819 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (35152907191649 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4071941691674149917709 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (35152907191649 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4540632429122172497341 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (35152907191649 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2074517497181400129451 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (35152907191649 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1222719945283823425943 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (35152907191649 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(15429951354170808899491 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (35152907191649 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (35152907191649 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (35152907191649 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (35152907191649 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_501_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_502_1 :
    Uω (aρ 1) (bρ 1) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(304348134677823892373 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (544059714082891 / 1000000000000000 : ℝ) ≤
      (-(304348134677823892373 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (544059714082891 / 1000000000000000 : ℝ) =
            (544059714082891 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (544059714082891 / 500000000000000 : ℝ) ≤
            (42225455472176107627 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1088113485145939 / 2000000000000000 : ℝ)) (q :=
      (544059714082891 / 1000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_502_2 :
    Uω (aρ 2) (bρ 2) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(3065526689465984201931 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2166664791922889 / 4000000000000000 : ℝ) ≤
      (-(3065526689465984201931 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2166664791922889 / 4000000000000000 : ℝ) =
            (2166664791922889 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2166664791922889 / 2000000000000000 : ℝ) ≤
            (400209212034015798069 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33852913226227 / 62500000000000 : ℝ)) (q :=
      (2166664791922889 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_502_3 :
    Uω (aρ 3) (bρ 3) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(3109928746905706661603 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2147509098123207 / 4000000000000000 : ℝ) ≤
      (-(3109928746905706661603 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2147509098123207 / 4000000000000000 : ℝ) =
            (2147509098123207 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2147509098123207 / 2000000000000000 : ℝ) ≤
            (355807154594293338397 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (536808375354791 / 1000000000000000 : ℝ)) (q :=
      (2147509098123207 / 4000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_502_4 :
    Uω (aρ 4) (bρ 4) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(1592305384936174259601 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5289178489179933 / 10000000000000000 : ℝ) ≤
      (-(1592305384936174259601 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5289178489179933 / 10000000000000000 : ℝ) =
            (5289178489179933 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5289178489179933 / 5000000000000000 : ℝ) ≤
            (140562565813825740399 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5287189422356741 / 10000000000000000 : ℝ)) (q :=
      (5289178489179933 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_502_5 :
    Uω (aρ 5) (bρ 5) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(6601332083711793922337 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10335649800367549 / 20000000000000000 : ℝ) ≤
      (-(6601332083711793922337 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10335649800367549 / 20000000000000000 : ℝ) =
            (10335649800367549 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10335649800367549 / 10000000000000000 : ℝ) ≤
            (330139719288206077663 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (161333505115607 / 312500000000000 : ℝ)) (q :=
      (10335649800367549 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_502_6 :
    Uω (aρ 6) (bρ 6) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(6944582519792693022809 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (998689787140121 / 2000000000000000 : ℝ) ≤
      (-(6944582519792693022809 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (998689787140121 / 2000000000000000 : ℝ) =
            (998689787140121 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (998689787140121 / 500000000000000 : ℝ) ≤
            (6918361086207306977191 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (996232121974617 / 2000000000000000 : ℝ)) (q :=
      (998689787140121 / 2000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_502_7 :
    Uω (aρ 7) (bρ 7) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(7434297431019868095343 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4754803400861627 / 10000000000000000 : ℝ) ≤
      (-(7434297431019868095343 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4754803400861627 / 10000000000000000 : ℝ) =
            (4754803400861627 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4754803400861627 / 2500000000000000 : ℝ) ≤
            (6428646174980131904657 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4727530920955129 / 10000000000000000 : ℝ)) (q :=
      (4754803400861627 / 10000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_502_8 :
    Uω (aρ 8) (bρ 8) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(1014421937012309681831 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2220873001058891 / 5000000000000000 : ℝ) ≤
      (-(1014421937012309681831 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2220873001058891 / 5000000000000000 : ℝ) =
            (2220873001058891 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2220873001058891 / 1250000000000000 : ℝ) ≤
            (718446013737690318169 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4384957774807439 / 10000000000000000 : ℝ)) (q :=
      (2220873001058891 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_502_9 :
    Uω (aρ 9) (bρ 9) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(4524739837311758777763 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8091258695623841 / 20000000000000000 : ℝ) ≤
      (-(4524739837311758777763 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8091258695623841 / 20000000000000000 : ℝ) =
            (8091258695623841 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8091258695623841 / 5000000000000000 : ℝ) ≤
            (2406731965688241222237 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (983422523638929 / 2500000000000000 : ℝ)) (q :=
      (8091258695623841 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_502_10 :
    Uω (aρ 10) (bρ 10) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(5167602033692465113331 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7115047206429829 / 20000000000000000 : ℝ) ≤
      (-(5167602033692465113331 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7115047206429829 / 20000000000000000 : ℝ) =
            (7115047206429829 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7115047206429829 / 5000000000000000 : ℝ) ≤
            (1763869769307534886669 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (102112965053 / 305175781250 : ℝ)) (q :=
      (7115047206429829 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_502_11 :
    Uω (aρ 11) (bρ 11) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(1522301870274884627343 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2958681104557373 / 10000000000000000 : ℝ) ≤
      (-(1522301870274884627343 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2958681104557373 / 10000000000000000 : ℝ) =
            (2958681104557373 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2958681104557373 / 2500000000000000 : ℝ) ≤
            (210566080475115372657 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2566829267746621 / 10000000000000000 : ℝ)) (q :=
      (2958681104557373 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_502_12 :
    Uω (aρ 12) (bρ 12) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(1917385680481320352707 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2156909797056681 / 10000000000000000 : ℝ) ≤
      (-(1917385680481320352707 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2156909797056681 / 10000000000000000 : ℝ) =
            (2156909797056681 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2156909797056681 / 1250000000000000 : ℝ) ≤
            (681916245643679647293 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1386986749430237 / 10000000000000000 : ℝ)) (q :=
      (2156909797056681 / 10000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_502_13 :
    Uω (aρ 13) (bρ 13) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_502_14 :
    Uω (aρ 14) (bρ 14) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_502_15 :
    Uω (aρ 15) (bρ 15) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_502_16 :
    Uω (aρ 16) (bρ 16) (8808198518421 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_502 :
    Uρ (8808198518421 / 16000000000000 : ℝ) ≤
      (-(189982673360871353711 / 200000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (8808198518421 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(304348134677823892373 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (8808198518421 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3065526689465984201931 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (8808198518421 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3109928746905706661603 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (8808198518421 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1592305384936174259601 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (8808198518421 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6601332083711793922337 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (8808198518421 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6944582519792693022809 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (8808198518421 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7434297431019868095343 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (8808198518421 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1014421937012309681831 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (8808198518421 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4524739837311758777763 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (8808198518421 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5167602033692465113331 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (8808198518421 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1522301870274884627343 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (8808198518421 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1917385680481320352707 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (8808198518421 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (8808198518421 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (8808198518421 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (8808198518421 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_502_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_503_1 :
    Uω (aρ 1) (bρ 1) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(6064045915001829464321 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8724927254666151 / 16000000000000000 : ℝ) ≤
      (-(6064045915001829464321 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8724927254666151 / 16000000000000000 : ℝ) =
            (8724927254666151 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8724927254666151 / 8000000000000000 : ℝ) ≤
            (867425887998170535679 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1090609977417319 / 2000000000000000 : ℝ)) (q :=
      (8724927254666151 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_503_2 :
    Uω (aρ 2) (bρ 2) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(1221606949584324856063 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1737326321746531 / 3200000000000000 : ℝ) ≤
      (-(1221606949584324856063 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1737326321746531 / 3200000000000000 : ℝ) =
            (1737326321746531 / 1600000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1737326321746531 / 1600000000000000 : ℝ) ≤
            (164687411015675143937 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (217157973687189 / 400000000000000 : ℝ)) (q :=
      (1737326321746531 / 3200000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_503_3 :
    Uω (aρ 3) (bρ 3) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(3098315821178827396319 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8610010670417763 / 16000000000000000 : ℝ) ≤
      (-(3098315821178827396319 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8610010670417763 / 16000000000000000 : ℝ) =
            (8610010670417763 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8610010670417763 / 8000000000000000 : ℝ) ≤
            (367420080321172603681 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (538056927563611 / 1000000000000000 : ℝ)) (q :=
      (8610010670417763 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_503_4 :
    Uω (aρ 4) (bρ 4) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(634564076381066350629 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42413323994768167 / 80000000000000000 : ℝ) ≤
      (-(634564076381066350629 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42413323994768167 / 80000000000000000 : ℝ) =
            (42413323994768167 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42413323994768167 / 40000000000000000 : ℝ) ≤
            (58583103918933649371 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1324920279342737 / 2500000000000000 : ℝ)) (q :=
      (42413323994768167 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_503_5 :
    Uω (aρ 5) (bρ 5) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(3288591645766013384659 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41442557229805003 / 80000000000000000 : ℝ) ≤
      (-(3288591645766013384659 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41442557229805003 / 80000000000000000 : ℝ) =
            (41442557229805003 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41442557229805003 / 40000000000000000 : ℝ) ≤
            (177144255733986615341 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5175179345465157 / 10000000000000000 : ℝ)) (q :=
      (41442557229805003 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_503_6 :
    Uω (aρ 6) (bρ 6) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(6919554951870387697571 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40047695818072167 / 80000000000000000 : ℝ) ≤
      (-(6919554951870387697571 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (40047695818072167 / 80000000000000000 : ℝ) =
            (40047695818072167 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40047695818072167 / 40000000000000000 : ℝ) ≤
            (11916851129612302429 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1248426091917987 / 2500000000000000 : ℝ)) (q :=
      (40047695818072167 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_503_7 :
    Uω (aρ 7) (bρ 7) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(7407929150169422584079 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38138860354343527 / 80000000000000000 : ℝ) ≤
      (-(7407929150169422584079 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (38138860354343527 / 80000000000000000 : ℝ) =
            (38138860354343527 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38138860354343527 / 20000000000000000 : ℝ) ≤
            (6455014455830577415921 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1185039220624947 / 2500000000000000 : ℝ)) (q :=
      (38138860354343527 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_503_8 :
    Uω (aρ 8) (bρ 8) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(8086950740760240682239 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35635116139077731 / 80000000000000000 : ℝ) ≤
      (-(8086950740760240682239 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35635116139077731 / 80000000000000000 : ℝ) =
            (35635116139077731 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35635116139077731 / 20000000000000000 : ℝ) ≤
            (5775992865239759317761 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4397762480023339 / 10000000000000000 : ℝ)) (q :=
      (35635116139077731 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_503_9 :
    Uω (aρ 9) (bρ 9) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(4508900456673071142313 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32467725773847159 / 80000000000000000 : ℝ) ≤
      (-(4508900456673071142313 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (32467725773847159 / 80000000000000000 : ℝ) =
            (32467725773847159 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32467725773847159 / 20000000000000000 : ℝ) ≤
            (2422571346326928857687 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (246680032317231 / 625000000000000 : ℝ)) (q :=
      (32467725773847159 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_503_10 :
    Uω (aρ 10) (bρ 10) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(5148988703631236251007 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28566334052394611 / 80000000000000000 : ℝ) ≤
      (-(5148988703631236251007 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28566334052394611 / 80000000000000000 : ℝ) =
            (28566334052394611 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28566334052394611 / 20000000000000000 : ℝ) ≤
            (1782483099368763748993 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3360091620207559 / 10000000000000000 : ℝ)) (q :=
      (28566334052394611 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_503_11 :
    Uω (aρ 11) (bρ 11) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(2425987833100888042973 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23784466929877283 / 80000000000000000 : ℝ) ≤
      (-(2425987833100888042973 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (23784466929877283 / 80000000000000000 : ℝ) =
            (23784466929877283 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23784466929877283 / 20000000000000000 : ℝ) ≤
            (346600888099111957027 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2583101465783227 / 10000000000000000 : ℝ)) (q :=
      (23784466929877283 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_503_12 :
    Uω (aρ 12) (bρ 12) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(15249929318392561796379 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3481961518105123 / 16000000000000000 : ℝ) ≤
      (-(15249929318392561796379 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3481961518105123 / 16000000000000000 : ℝ) =
            (3481961518105123 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3481961518105123 / 2000000000000000 : ℝ) ≤
            (5544486090607438203621 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (141313672763031 / 1000000000000000 : ℝ)) (q :=
      (3481961518105123 / 16000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_503_13 :
    Uω (aρ 13) (bρ 13) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_503_14 :
    Uω (aρ 14) (bρ 14) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_503_15 :
    Uω (aρ 15) (bρ 15) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_503_16 :
    Uω (aρ 16) (bρ 16) (35312680955719 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_503 :
    Uρ (35312680955719 / 64000000000000 : ℝ) ≤
      (-(947137693861291331499 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (35312680955719 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6064045915001829464321 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (35312680955719 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1221606949584324856063 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (35312680955719 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3098315821178827396319 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (35312680955719 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(634564076381066350629 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (35312680955719 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3288591645766013384659 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (35312680955719 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6919554951870387697571 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (35312680955719 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(7407929150169422584079 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (35312680955719 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(8086950740760240682239 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (35312680955719 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4508900456673071142313 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (35312680955719 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5148988703631236251007 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (35312680955719 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(2425987833100888042973 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (35312680955719 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(15249929318392561796379 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (35312680955719 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (35312680955719 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (35312680955719 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (35312680955719 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_503_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_504_1 :
    Uω (aρ 1) (bρ 1) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(60411815348335259041 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21862247708772351 / 40000000000000000 : ℝ) ≤
      (-(60411815348335259041 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21862247708772351 / 40000000000000000 : ℝ) =
            (21862247708772351 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21862247708772351 / 20000000000000000 : ℝ) ≤
            (8902902681664740959 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5465532347822113 / 10000000000000000 : ℝ)) (q :=
      (21862247708772351 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_504_2 :
    Uω (aρ 2) (bρ 2) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(3042534492391497808847 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21766510116169791 / 40000000000000000 : ℝ) ≤
      (-(3042534492391497808847 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21766510116169791 / 40000000000000000 : ℝ) =
            (21766510116169791 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21766510116169791 / 20000000000000000 : ℝ) ≤
            (423201409108502191153 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5441432564030833 / 10000000000000000 : ℝ)) (q :=
      (21766510116169791 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_504_3 :
    Uω (aρ 3) (bρ 3) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(6173459623665779297577 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21574962341257021 / 40000000000000000 : ℝ) ≤
      (-(6173459623665779297577 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21574962341257021 / 40000000000000000 : ℝ) =
            (21574962341257021 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21574962341257021 / 20000000000000000 : ℝ) ≤
            (758012179334220702423 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (168532961966389 / 312500000000000 : ℝ)) (q :=
      (21574962341257021 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_504_4 :
    Uω (aρ 4) (bρ 4) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(1580528875958493533667 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21256609949949273 / 40000000000000000 : ℝ) ≤
      (-(1580528875958493533667 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21256609949949273 / 40000000000000000 : ℝ) =
            (21256609949949273 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21256609949949273 / 20000000000000000 : ℝ) ≤
            (152339074791506466333 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2656086384167787 / 5000000000000000 : ℝ)) (q :=
      (21256609949949273 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_504_5 :
    Uω (aρ 5) (bρ 5) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(6553092790598556143351 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20771257389598851 / 40000000000000000 : ℝ) ≤
      (-(6553092790598556143351 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20771257389598851 / 40000000000000000 : ℝ) =
            (20771257389598851 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20771257389598851 / 20000000000000000 : ℝ) ≤
            (378379012401443856649 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5187686407495363 / 10000000000000000 : ℝ)) (q :=
      (20771257389598851 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_504_6 :
    Uω (aρ 6) (bρ 6) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(3447295084451065829983 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20073899461071497 / 40000000000000000 : ℝ) ≤
      (-(3447295084451065829983 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20073899461071497 / 40000000000000000 : ℝ) =
            (20073899461071497 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20073899461071497 / 20000000000000000 : ℝ) ≤
            (18440817048934170017 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2503123909185843 / 5000000000000000 : ℝ)) (q :=
      (20073899461071497 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_504_7 :
    Uω (aρ 7) (bρ 7) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(3690815504439367221797 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19119645233276717 / 40000000000000000 : ℝ) ≤
      (-(3690815504439367221797 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19119645233276717 / 40000000000000000 : ℝ) =
            (19119645233276717 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19119645233276717 / 10000000000000000 : ℝ) ≤
            (3240656298560632778203 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (594097760654287 / 1250000000000000 : ℝ)) (q :=
      (19119645233276717 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_504_8 :
    Uω (aρ 8) (bρ 8) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(1007326077744263590559 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3573625686803071 / 8000000000000000 : ℝ) ≤
      (-(1007326077744263590559 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3573625686803071 / 8000000000000000 : ℝ) =
            (3573625686803071 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3573625686803071 / 2000000000000000 : ℝ) ≤
            (725541873005736409441 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (882113067388723 / 2000000000000000 : ℝ)) (q :=
      (3573625686803071 / 8000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_504_9 :
    Uω (aρ 9) (bρ 9) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(1123278478412851818853 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16285199201546043 / 40000000000000000 : ℝ) ≤
      (-(1123278478412851818853 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (16285199201546043 / 40000000000000000 : ℝ) =
            (16285199201546043 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16285199201546043 / 10000000000000000 : ℝ) ≤
            (609589472337148181147 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3960066349068959 / 10000000000000000 : ℝ)) (q :=
      (16285199201546043 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_504_10 :
    Uω (aρ 10) (bρ 10) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(10260906059422783887687 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14336214918596509 / 40000000000000000 : ℝ) ≤
      (-(10260906059422783887687 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14336214918596509 / 40000000000000000 : ℝ) =
            (14336214918596509 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14336214918596509 / 10000000000000000 : ℝ) ≤
            (3602037546577216112313 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (421766655136149 / 1250000000000000 : ℝ)) (q :=
      (14336214918596509 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_504_11 :
    Uω (aρ 11) (bρ 11) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(755110462113986613171 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11949658663093087 / 40000000000000000 : ℝ) ≤
      (-(755110462113986613171 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11949658663093087 / 40000000000000000 : ℝ) =
            (11949658663093087 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11949658663093087 / 10000000000000000 : ℝ) ≤
            (111323513261013386829 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2599331739542481 / 10000000000000000 : ℝ)) (q :=
      (11949658663093087 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_504_12 :
    Uω (aρ 12) (bρ 12) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(1516239665633792455279 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8781434594056657 / 40000000000000000 : ℝ) ≤
      (-(1516239665633792455279 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8781434594056657 / 40000000000000000 : ℝ) =
            (8781434594056657 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8781434594056657 / 5000000000000000 : ℝ) ≤
            (563201875266207544721 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (719459900854633 / 5000000000000000 : ℝ)) (q :=
      (8781434594056657 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_504_13 :
    Uω (aρ 13) (bρ 13) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_504_14 :
    Uω (aρ 14) (bρ 14) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_504_15 :
    Uω (aρ 15) (bρ 15) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_504_16 :
    Uω (aρ 16) (bρ 16) (17696283918877 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_504 :
    Uρ (17696283918877 / 32000000000000 : ℝ) ≤
      (-(1180476362959208691143 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (17696283918877 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(60411815348335259041 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (17696283918877 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3042534492391497808847 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (17696283918877 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6173459623665779297577 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (17696283918877 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1580528875958493533667 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (17696283918877 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6553092790598556143351 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (17696283918877 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3447295084451065829983 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (17696283918877 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3690815504439367221797 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (17696283918877 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1007326077744263590559 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (17696283918877 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1123278478412851818853 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (17696283918877 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10260906059422783887687 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (17696283918877 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(755110462113986613171 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (17696283918877 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1516239665633792455279 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (17696283918877 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (17696283918877 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (17696283918877 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (17696283918877 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_504_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_505_1 :
    Uω (aρ 1) (bρ 1) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(6018369313981465330427 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43824354559290113 / 80000000000000000 : ℝ) ≤
      (-(6018369313981465330427 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43824354559290113 / 80000000000000000 : ℝ) =
            (43824354559290113 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43824354559290113 / 40000000000000000 : ℝ) ≤
            (913102489018534669573 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5478014807940497 / 10000000000000000 : ℝ)) (q :=
      (43824354559290113 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_505_2 :
    Uω (aρ 2) (bρ 2) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(6062155847207341966241 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43632882404600209 / 80000000000000000 : ℝ) ≤
      (-(6062155847207341966241 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43632882404600209 / 80000000000000000 : ℝ) =
            (43632882404600209 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43632882404600209 / 40000000000000000 : ℝ) ≤
            (869315955792658033759 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5453915781778021 / 10000000000000000 : ℝ)) (q :=
      (43632882404600209 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_505_3 :
    Uω (aρ 3) (bρ 3) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(384396324293936033753 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43249795954150029 / 80000000000000000 : ℝ) ≤
      (-(384396324293936033753 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43249795954150029 / 80000000000000000 : ℝ) =
            (43249795954150029 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43249795954150029 / 40000000000000000 : ℝ) ≤
            (48820663393563966247 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1351385068878869 / 2500000000000000 : ℝ)) (q :=
      (43249795954150029 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_505_4 :
    Uω (aρ 4) (bρ 4) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(6298645498833575554591 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8522623126014137 / 16000000000000000 : ℝ) ≤
      (-(6298645498833575554591 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8522623126014137 / 16000000000000000 : ℝ) =
            (8522623126014137 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8522623126014137 / 8000000000000000 : ℝ) ≤
            (632826304166424445409 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (16639576173627 / 31250000000000 : ℝ)) (q :=
      (8522623126014137 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_505_5 :
    Uω (aρ 5) (bρ 5) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(6529060299625747032463 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41642471853104017 / 80000000000000000 : ℝ) ≤
      (-(6529060299625747032463 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41642471853104017 / 80000000000000000 : ℝ) =
            (41642471853104017 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41642471853104017 / 40000000000000000 : ℝ) ≤
            (402411503374252967537 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5200193350653973 / 10000000000000000 : ℝ)) (q :=
      (41642471853104017 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_505_6 :
    Uω (aρ 6) (bρ 6) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(858710982215112154227 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (40247900807027701 / 80000000000000000 : ℝ) ≤
      (-(858710982215112154227 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (40247900807027701 / 80000000000000000 : ℝ) =
            (40247900807027701 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (40247900807027701 / 40000000000000000 : ℝ) ≤
            (7722993159887845773 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2509395482137447 / 5000000000000000 : ℝ)) (q :=
      (40247900807027701 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_505_7 :
    Uω (aρ 7) (bρ 7) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(58843221046640534947 / 80000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1533588702705877 / 3200000000000000 : ℝ) ≤
      (-(58843221046640534947 / 80000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1533588702705877 / 3200000000000000 : ℝ) =
            (1533588702705877 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1533588702705877 / 800000000000000 : ℝ) ≤
            (52060327801359465053 / 80000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (47654065351897 / 100000000000000 : ℝ)) (q :=
      (1533588702705877 / 3200000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_505_8 :
    Uω (aρ 8) (bρ 8) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(2007587162204019625203 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35837390267996993 / 80000000000000000 : ℝ) ≤
      (-(2007587162204019625203 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35837390267996993 / 80000000000000000 : ℝ) =
            (35837390267996993 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35837390267996993 / 20000000000000000 : ℝ) ≤
            (1458148739295980374797 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4423366361617217 / 10000000000000000 : ℝ)) (q :=
      (35837390267996993 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_505_9 :
    Uω (aρ 9) (bρ 9) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(8954759677569814852371 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32673052853042553 / 80000000000000000 : ℝ) ≤
      (-(8954759677569814852371 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (32673052853042553 / 80000000000000000 : ℝ) =
            (32673052853042553 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32673052853042553 / 20000000000000000 : ℝ) ≤
            (4908183928430185147629 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3973247636238607 / 10000000000000000 : ℝ)) (q :=
      (32673052853042553 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_505_10 :
    Uω (aρ 10) (bρ 10) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(255599714979519626207 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1151139071792921 / 3200000000000000 : ℝ) ≤
      (-(255599714979519626207 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1151139071792921 / 3200000000000000 : ℝ) =
            (1151139071792921 / 800000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1151139071792921 / 800000000000000 : ℝ) ≤
            (90973875170480373793 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (135526506207149 / 400000000000000 : ℝ)) (q :=
      (1151139071792921 / 3200000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_505_11 :
    Uω (aρ 11) (bρ 11) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(6016947547431752205949 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24014003147253777 / 80000000000000000 : ℝ) ≤
      (-(6016947547431752205949 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24014003147253777 / 80000000000000000 : ℝ) =
            (24014003147253777 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24014003147253777 / 20000000000000000 : ℝ) ≤
            (914524255568247794051 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2615520869491413 / 10000000000000000 : ℝ)) (q :=
      (24014003147253777 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_505_12 :
    Uω (aρ 12) (bρ 12) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(1884551029486662392393 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17714540691209181 / 80000000000000000 : ℝ) ≤
      (-(1884551029486662392393 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (17714540691209181 / 80000000000000000 : ℝ) =
            (17714540691209181 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17714540691209181 / 10000000000000000 : ℝ) ≤
            (714750896638337607607 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (91522209510329 / 625000000000000 : ℝ)) (q :=
      (17714540691209181 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_505_13 :
    Uω (aρ 13) (bρ 13) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_505_14 :
    Uω (aρ 14) (bρ 14) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_505_15 :
    Uω (aρ 15) (bρ 15) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_505_16 :
    Uω (aρ 16) (bρ 16) (35472454719789 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_505 :
    Uρ (35472454719789 / 64000000000000 : ℝ) ≤
      (-(9416429288524211005069 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (35472454719789 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(6018369313981465330427 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (35472454719789 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6062155847207341966241 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (35472454719789 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(384396324293936033753 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (35472454719789 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6298645498833575554591 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (35472454719789 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6529060299625747032463 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (35472454719789 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(858710982215112154227 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (35472454719789 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(58843221046640534947 / 80000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (35472454719789 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2007587162204019625203 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (35472454719789 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(8954759677569814852371 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (35472454719789 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(255599714979519626207 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (35472454719789 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6016947547431752205949 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (35472454719789 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1884551029486662392393 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (35472454719789 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (35472454719789 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (35472454719789 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (35472454719789 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_505_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_506_1 :
    Uω (aρ 1) (bρ 1) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(59956090150079933539 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2745263356161489 / 5000000000000000 : ℝ) ≤
      (-(59956090150079933539 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2745263356161489 / 5000000000000000 : ℝ) =
            (2745263356161489 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2745263356161489 / 2500000000000000 : ℝ) ≤
            (9358627879920066461 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1372624316861489 / 2500000000000000 : ℝ)) (q :=
      (2745263356161489 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_506_2 :
    Uω (aρ 2) (bρ 2) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(6039295094548093923991 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5466593070069701 / 10000000000000000 : ℝ) ≤
      (-(6039295094548093923991 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5466593070069701 / 10000000000000000 : ℝ) =
            (5466593070069701 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5466593070069701 / 5000000000000000 : ℝ) ≤
            (892176708451906076009 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2733199497724701 / 5000000000000000 : ℝ)) (q :=
      (5466593070069701 / 10000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_506_3 :
    Uω (aρ 3) (bρ 3) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(6127276090160940364943 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27093541979627 / 50000000000000 : ℝ) ≤
      (-(6127276090160940364943 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27093541979627 / 50000000000000 : ℝ) = (27093541979627 / 25000000000000 : ℝ) / 2 ^ 1 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27093541979627 / 25000000000000 : ℝ) ≤
            (804195712839059635057 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (13545064383777 / 25000000000000 : ℝ)) (q :=
      (27093541979627 / 50000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_506_4 :
    Uω (aρ 4) (bρ 4) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(3137615244832883098359 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10678252796628263 / 20000000000000000 : ℝ) ≤
      (-(3137615244832883098359 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10678252796628263 / 20000000000000000 : ℝ) =
            (10678252796628263 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10678252796628263 / 10000000000000000 : ℝ) ≤
            (328120656667116901641 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5337155939353263 / 10000000000000000 : ℝ)) (q :=
      (10678252796628263 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_506_5 :
    Uω (aρ 5) (bρ 5) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(6505085539363036308551 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10435607113736623 / 20000000000000000 : ℝ) ≤
      (-(6505085539363036308551 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10435607113736623 / 20000000000000000 : ℝ) =
            (10435607113736623 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10435607113736623 / 10000000000000000 : ℝ) ≤
            (426386263636963691449 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5212700175796623 / 10000000000000000 : ℝ)) (q :=
      (10435607113736623 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_506_6 :
    Uω (aρ 6) (bρ 6) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(6844847704947540843917 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10087000370461153 / 20000000000000000 : ℝ) ≤
      (-(6844847704947540843917 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10087000370461153 / 20000000000000000 : ℝ) =
            (10087000370461153 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10087000370461153 / 10000000000000000 : ℝ) ≤
            (86624098052459156083 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5031333807661153 / 10000000000000000 : ℝ)) (q :=
      (10087000370461153 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_506_7 :
    Uω (aρ 7) (bρ 7) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(3664621821379332739513 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (192200708407459 / 400000000000000 : ℝ) ≤
      (-(3664621821379332739513 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (192200708407459 / 400000000000000 : ℝ) =
            (192200708407459 / 100000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (192200708407459 / 100000000000000 : ℝ) ≤
            (3266849981620667260487 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (95560604766659 / 200000000000000 : ℝ)) (q :=
      (192200708407459 / 400000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_506_8 :
    Uω (aρ 8) (bρ 8) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(4001085167470894044969 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2246157275151393 / 5000000000000000 : ℝ) ≤
      (-(4001085167470894044969 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2246157275151393 / 5000000000000000 : ℝ) =
            (2246157275151393 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2246157275151393 / 1250000000000000 : ℝ) ≤
            (2930386635529105955031 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1109041392476393 / 2500000000000000 : ℝ)) (q :=
      (2246157275151393 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_506_9 :
    Uω (aρ 9) (bρ 9) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(35693582933142942329 / 40000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8193922326007617 / 20000000000000000 : ℝ) ≤
      (-(35693582933142942329 / 40000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8193922326007617 / 20000000000000000 : ℝ) =
            (8193922326007617 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8193922326007617 / 5000000000000000 : ℝ) ≤
            (19758191490857057671 / 40000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3986424423667617 / 10000000000000000 : ℝ)) (q :=
      (8193922326007617 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_506_10 :
    Uω (aρ 10) (bρ 10) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(10187223622840232274999 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (722111888233093 / 2000000000000000 : ℝ) ≤
      (-(10187223622840232274999 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (722111888233093 / 2000000000000000 : ℝ) =
            (722111888233093 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (722111888233093 / 500000000000000 : ℝ) ≤
            (3675719983159767725001 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (340218001348593 / 1000000000000000 : ℝ)) (q :=
      (722111888233093 / 2000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_506_11 :
    Uω (aρ 11) (bρ 11) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(5993158914446563252359 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (603213185757801 / 2000000000000000 : ℝ) ≤
      (-(5993158914446563252359 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (603213185757801 / 2000000000000000 : ℝ) =
            (603213185757801 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (603213185757801 / 500000000000000 : ℝ) ≤
            (938312888553436747641 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (263166961493801 / 1000000000000000 : ℝ)) (q :=
      (603213185757801 / 2000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_506_12 :
    Uω (aρ 12) (bρ 12) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(14991891141000413337327 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2233111664528861 / 10000000000000000 : ℝ) ≤
      (-(14991891141000413337327 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2233111664528861 / 10000000000000000 : ℝ) =
            (2233111664528861 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2233111664528861 / 1250000000000000 : ℝ) ≤
            (5802524267999586662673 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (744730591551361 / 5000000000000000 : ℝ)) (q :=
      (2233111664528861 / 10000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_506_13 :
    Uω (aρ 13) (bρ 13) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_506_14 :
    Uω (aρ 14) (bρ 14) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_506_15 :
    Uω (aρ 15) (bρ 15) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_506_16 :
    Uω (aρ 16) (bρ 16) (1111010675057 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_506 :
    Uρ (1111010675057 / 2000000000000 : ℝ) ≤
      (-(9389226274504482798993 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1111010675057 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(59956090150079933539 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1111010675057 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(6039295094548093923991 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1111010675057 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6127276090160940364943 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1111010675057 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3137615244832883098359 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1111010675057 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6505085539363036308551 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1111010675057 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(6844847704947540843917 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1111010675057 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3664621821379332739513 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1111010675057 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4001085167470894044969 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1111010675057 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(35693582933142942329 / 40000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1111010675057 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(10187223622840232274999 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1111010675057 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(5993158914446563252359 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1111010675057 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(14991891141000413337327 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1111010675057 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1111010675057 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1111010675057 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1111010675057 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_506_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_507_1 :
    Uω (aρ 1) (bρ 1) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(373306275130817100621 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44024072835442519 / 80000000000000000 : ℝ) ≤
      (-(373306275130817100621 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (44024072835442519 / 80000000000000000 : ℝ) =
            (44024072835442519 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44024072835442519 / 40000000000000000 : ℝ) ≤
            (59910712556682899379 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5502979726342661 / 10000000000000000 : ℝ)) (q :=
      (44024072835442519 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_507_2 :
    Uω (aρ 2) (bρ 2) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(3008243243902837444081 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43832606700323227 / 80000000000000000 : ℝ) ≤
      (-(3008243243902837444081 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43832606700323227 / 80000000000000000 : ℝ) =
            (43832606700323227 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43832606700323227 / 40000000000000000 : ℝ) ≤
            (457492657597162555919 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2739441102536419 / 5000000000000000 : ℝ)) (q :=
      (43832606700323227 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_507_3 :
    Uω (aρ 3) (bρ 3) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(6104264082439977002931 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43449538322676247 / 80000000000000000 : ℝ) ≤
      (-(6104264082439977002931 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43449538322676247 / 80000000000000000 : ℝ) =
            (43449538322676247 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43449538322676247 / 40000000000000000 : ℝ) ≤
            (827207720560022997069 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5430511217011093 / 10000000000000000 : ℝ)) (q :=
      (43449538322676247 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_507_4 :
    Uω (aρ 4) (bρ 4) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(6251870219006976036533 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42812906570442639 / 80000000000000000 : ℝ) ≤
      (-(6251870219006976036533 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42812906570442639 / 80000000000000000 : ℝ) =
            (42812906570442639 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42812906570442639 / 40000000000000000 : ℝ) ≤
            (679601583993023963467 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5349647460017691 / 10000000000000000 : ℝ)) (q :=
      (42812906570442639 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_507_5 :
    Uω (aρ 5) (bρ 5) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(6481168232575320061883 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41842384588114851 / 80000000000000000 : ℝ) ≤
      (-(6481168232575320061883 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41842384588114851 / 80000000000000000 : ℝ) =
            (41842384588114851 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41842384588114851 / 40000000000000000 : ℝ) ≤
            (450303570424679938117 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (653150860471343 / 1250000000000000 : ℝ)) (q :=
      (41842384588114851 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_507_6 :
    Uω (aρ 6) (bρ 6) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(3410034699783073694907 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8089620191124223 / 16000000000000000 : ℝ) ≤
      (-(3410034699783073694907 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8089620191124223 / 16000000000000000 : ℝ) =
            (8089620191124223 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8089620191124223 / 8000000000000000 : ℝ) ≤
            (55701201716926305093 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (504387635078731 / 1000000000000000 : ℝ)) (q :=
      (8089620191124223 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_507_7 :
    Uω (aρ 7) (bρ 7) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(1460630734883897880289 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38540562831702879 / 80000000000000000 : ℝ) ≤
      (-(1460630734883897880289 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (38540562831702879 / 80000000000000000 : ℝ) =
            (38540562831702879 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38540562831702879 / 20000000000000000 : ℝ) ≤
            (1311957986316102119711 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4790653200567751 / 10000000000000000 : ℝ)) (q :=
      (38540562831702879 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_507_8 :
    Uω (aρ 8) (bρ 8) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(3987036599165787142513 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (36039635334013223 / 80000000000000000 : ℝ) ≤
      (-(3987036599165787142513 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (36039635334013223 / 80000000000000000 : ℝ) =
            (36039635334013223 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (36039635334013223 / 20000000000000000 : ℝ) ≤
            (2944435203834212857487 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4448962977485337 / 10000000000000000 : ℝ)) (q :=
      (36039635334013223 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_507_9 :
    Uω (aρ 9) (bρ 9) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(8892135271530491175893 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (32878307933950143 / 80000000000000000 : ℝ) ≤
      (-(8892135271530491175893 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (32878307933950143 / 80000000000000000 : ℝ) =
            (32878307933950143 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (32878307933950143 / 20000000000000000 : ℝ) ≤
            (4970808334469508824107 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3999596755829567 / 10000000000000000 : ℝ)) (q :=
      (32878307933950143 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_507_10 :
    Uω (aρ 10) (bρ 10) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(5075304873631269541131 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28990426634305347 / 80000000000000000 : ℝ) ≤
      (-(5075304873631269541131 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (28990426634305347 / 80000000000000000 : ℝ) =
            (28990426634305347 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28990426634305347 / 20000000000000000 : ℝ) ≤
            (1856166929368730458869 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (427023183051671 / 1250000000000000 : ℝ)) (q :=
      (28990426634305347 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_507_11 :
    Uω (aρ 11) (bρ 11) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(11939031264853494913149 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24242893131011923 / 80000000000000000 : ℝ) ≤
      (-(11939031264853494913149 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24242893131011923 / 80000000000000000 : ℝ) =
            (24242893131011923 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24242893131011923 / 20000000000000000 : ℝ) ≤
            (1923912341146505086851 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (661944678698753 / 2500000000000000 : ℝ)) (q :=
      (24242893131011923 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_507_12 :
    Uω (aρ 12) (bρ 12) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(2981755615627733624033 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3602798532646971 / 16000000000000000 : ℝ) ≤
      (-(2981755615627733624033 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (3602798532646971 / 16000000000000000 : ℝ) =
            (3602798532646971 / 2000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3602798532646971 / 2000000000000000 : ℝ) ≤
            (1177127466172266375967 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (302850738907149 / 2000000000000000 : ℝ)) (q :=
      (3602798532646971 / 16000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_507_13 :
    Uω (aρ 13) (bρ 13) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_13]) (by norm_num [bρ_13])]; exact Lmid_13

lemma U_507_14 :
    Uω (aρ 14) (bρ 14) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_507_15 :
    Uω (aρ 15) (bρ 15) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_507_16 :
    Uω (aρ 16) (bρ 16) (35632228483859 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_507 :
    Uρ (35632228483859 / 64000000000000 : ℝ) ≤
      (-(1170274556345986861049 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (35632228483859 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(373306275130817100621 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (35632228483859 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3008243243902837444081 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (35632228483859 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(6104264082439977002931 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (35632228483859 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(6251870219006976036533 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (35632228483859 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(6481168232575320061883 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (35632228483859 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3410034699783073694907 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (35632228483859 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1460630734883897880289 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (35632228483859 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3987036599165787142513 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (35632228483859 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(8892135271530491175893 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (35632228483859 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5075304873631269541131 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (35632228483859 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(11939031264853494913149 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (35632228483859 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(2981755615627733624033 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (35632228483859 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4762195995179309567439 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (35632228483859 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (35632228483859 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (35632228483859 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_507_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
