/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U45) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_544_1 :
    Uω (aρ 1) (bρ 1) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(243234294615614466823 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2459174615841993 / 4000000000000000 : ℝ) ≤
      (-(243234294615614466823 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2459174615841993 / 4000000000000000 : ℝ) =
            (2459174615841993 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2459174615841993 / 2000000000000000 : ℝ) ≤
            (103339295534385533177 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1229582048664243 / 2000000000000000 : ℝ)) (q :=
      (2459174615841993 / 4000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_544_2 :
    Uω (aρ 2) (bρ 2) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(980732507775771540851 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12248041166219101 / 20000000000000000 : ℝ) ≤
      (-(980732507775771540851 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12248041166219101 / 20000000000000000 : ℝ) =
            (12248041166219101 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12248041166219101 / 10000000000000000 : ℝ) ≤
            (405561852824228459149 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6123847342840351 / 10000000000000000 : ℝ)) (q :=
      (12248041166219101 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_544_3 :
    Uω (aρ 3) (bρ 3) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(2491037061290261113757 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1519047235167293 / 2500000000000000 : ℝ) ≤
      (-(2491037061290261113757 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1519047235167293 / 2500000000000000 : ℝ) =
            (1519047235167293 / 1250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1519047235167293 / 1250000000000000 : ℝ) ≤
            (974698840209738886243 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3037790082154797 / 5000000000000000 : ℝ)) (q :=
      (1519047235167293 / 2500000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_544_4 :
    Uω (aρ 4) (bρ 4) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(5113675763595366645521 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11993498327717163 / 20000000000000000 : ℝ) ≤
      (-(5113675763595366645521 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11993498327717163 / 20000000000000000 : ℝ) =
            (11993498327717163 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11993498327717163 / 10000000000000000 : ℝ) ≤
            (1817796039404633354479 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5994994791753413 / 10000000000000000 : ℝ)) (q :=
      (11993498327717163 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_544_5 :
    Uω (aρ 5) (bρ 5) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(166170619676123348097 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11751563438453559 / 20000000000000000 : ℝ) ≤
      (-(166170619676123348097 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11751563438453559 / 20000000000000000 : ℝ) =
            (11751563438453559 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11751563438453559 / 10000000000000000 : ℝ) ≤
            (50437874167626651903 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5871249821824809 / 10000000000000000 : ℝ)) (q :=
      (11751563438453559 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_544_6 :
    Uω (aρ 6) (bρ 6) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(2808566494661532032637 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5702312497043969 / 10000000000000000 : ℝ) ≤
      (-(2808566494661532032637 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5702312497043969 / 10000000000000000 : ℝ) =
            (5702312497043969 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5702312497043969 / 5000000000000000 : ℝ) ≤
            (657169406838467967363 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1422887938149797 / 2500000000000000 : ℝ)) (q :=
      (5702312497043969 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_544_7 :
    Uω (aρ 7) (bρ 7) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(755119197430400781771 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10931373038086789 / 20000000000000000 : ℝ) ≤
      (-(755119197430400781771 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10931373038086789 / 20000000000000000 : ℝ) =
            (10931373038086789 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10931373038086789 / 10000000000000000 : ℝ) ≤
            (111314777944599218229 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5441961177358039 / 10000000000000000 : ℝ)) (q :=
      (10931373038086789 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_544_8 :
    Uω (aρ 8) (bρ 8) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(1655595618708660814971 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10313915736839439 / 20000000000000000 : ℝ) ≤
      (-(1655595618708660814971 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10313915736839439 / 20000000000000000 : ℝ) =
            (10313915736839439 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10313915736839439 / 10000000000000000 : ℝ) ≤
            (77272332041339185029 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5108045527450689 / 10000000000000000 : ℝ)) (q :=
      (10313915736839439 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_544_9 :
    Uω (aρ 9) (bρ 9) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(7402464053785215584387 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9539927326420767 / 20000000000000000 : ℝ) ≤
      (-(7402464053785215584387 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9539927326420767 / 20000000000000000 : ℝ) =
            (9539927326420767 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9539927326420767 / 5000000000000000 : ℝ) ≤
            (6460479552214784415613 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4675022745392017 / 10000000000000000 : ℝ)) (q :=
      (9539927326420767 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_544_10 :
    Uω (aρ 10) (bρ 10) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(4218182011013012442561 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (537679376244323 / 1250000000000000 : ℝ) ≤
      (-(4218182011013012442561 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (537679376244323 / 1250000000000000 : ℝ) =
            (537679376244323 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (537679376244323 / 312500000000000 : ℝ) ≤
            (2713289791986987557439 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2063262236187709 / 5000000000000000 : ℝ)) (q :=
      (537679376244323 / 1250000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_544_11 :
    Uω (aρ 11) (bρ 11) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(981205691910561245223 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7497177235692769 / 20000000000000000 : ℝ) ≤
      (-(981205691910561245223 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7497177235692769 / 20000000000000000 : ℝ) =
            (7497177235692769 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7497177235692769 / 5000000000000000 : ℝ) ≤
            (405088668689438754777 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3439308314364019 / 10000000000000000 : ℝ)) (q :=
      (7497177235692769 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_544_12 :
    Uω (aρ 12) (bρ 12) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(292944600445161657491 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1549077372466801 / 5000000000000000 : ℝ) ≤
      (-(292944600445161657491 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1549077372466801 / 5000000000000000 : ℝ) =
            (1549077372466801 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1549077372466801 / 1250000000000000 : ℝ) ≤
            (53628989704838342509 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1281070332611727 / 5000000000000000 : ℝ)) (q :=
      (1549077372466801 / 5000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_544_13 :
    Uω (aρ 13) (bρ 13) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(1864386724188942654493 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (562581847817931 / 2500000000000000 : ℝ) ≤
      (-(1864386724188942654493 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (562581847817931 / 2500000000000000 : ℝ) =
            (562581847817931 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (562581847817931 / 312500000000000 : ℝ) ≤
            (734915201936057345507 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (632933849747349 / 5000000000000000 : ℝ)) (q :=
      (562581847817931 / 2500000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13]) (by norm_num [bρ_13])
      (by norm_num) (by norm_num [aρ_13, bρ_13]) (by norm_num [aρ_13, bρ_13]) hlg

lemma U_544_14 :
    Uω (aρ 14) (bρ 14) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_544_15 :
    Uω (aρ 15) (bρ 15) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_544_16 :
    Uω (aρ 16) (bρ 16) (4969968043179 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_544 :
    Uρ (4969968043179 / 8000000000000 : ℝ) ≤
      (-(7887909540485613658987 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4969968043179 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(243234294615614466823 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4969968043179 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(980732507775771540851 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4969968043179 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2491037061290261113757 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4969968043179 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(5113675763595366645521 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4969968043179 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(166170619676123348097 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4969968043179 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2808566494661532032637 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4969968043179 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(755119197430400781771 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4969968043179 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1655595618708660814971 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4969968043179 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7402464053785215584387 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4969968043179 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(4218182011013012442561 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4969968043179 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(981205691910561245223 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4969968043179 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(292944600445161657491 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4969968043179 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(1864386724188942654493 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4969968043179 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4969968043179 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4969968043179 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_544_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_545_1 :
    Uω (aρ 1) (bρ 1) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(4847217421798197610027 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49269483440175017 / 80000000000000000 : ℝ) ≤
      (-(4847217421798197610027 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49269483440175017 / 80000000000000000 : ℝ) =
            (49269483440175017 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49269483440175017 / 40000000000000000 : ℝ) ≤
            (2084254381201802389973 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3079329589816799 / 5000000000000000 : ℝ)) (q :=
      (49269483440175017 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_545_2 :
    Uω (aρ 2) (bρ 2) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(2443062744530523726207 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49078157849416297 / 80000000000000000 : ℝ) ≤
      (-(2443062744530523726207 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49078157849416297 / 80000000000000000 : ℝ) =
            (49078157849416297 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49078157849416297 / 40000000000000000 : ℝ) ≤
            (1022673156969476273793 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3067298397226959 / 5000000000000000 : ℝ)) (q :=
      (49078157849416297 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_545_3 :
    Uω (aρ 3) (bρ 3) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(992879575151331134011 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48695510882625581 / 80000000000000000 : ℝ) ≤
      (-(992879575151331134011 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48695510882625581 / 80000000000000000 : ℝ) =
            (48695510882625581 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48695510882625581 / 40000000000000000 : ℝ) ≤
            (393414785448668865989 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6086331159106239 / 10000000000000000 : ℝ)) (q :=
      (48695510882625581 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_545_4 :
    Uω (aρ 4) (bρ 4) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(1273940532409412364583 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48060009186278117 / 80000000000000000 : ℝ) ≤
      (-(1273940532409412364583 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48060009186278117 / 80000000000000000 : ℝ) =
            (48060009186278117 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48060009186278117 / 40000000000000000 : ℝ) ≤
            (458927418340587635417 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6005749916084373 / 10000000000000000 : ℝ)) (q :=
      (48060009186278117 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_545_5 :
    Uω (aρ 5) (bρ 5) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(2649584500781039761267 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (47092310763100777 / 80000000000000000 : ℝ) ≤
      (-(2649584500781039761267 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (47092310763100777 / 80000000000000000 : ℝ) =
            (47092310763100777 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (47092310763100777 / 40000000000000000 : ℝ) ≤
            (816151400718960238733 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2941007614812519 / 5000000000000000 : ℝ)) (q :=
      (47092310763100777 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_545_6 :
    Uω (aρ 6) (bρ 6) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(559826525414619874691 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9140930600818241 / 16000000000000000 : ℝ) ≤
      (-(559826525414619874691 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9140930600818241 / 16000000000000000 : ℝ) =
            (9140930600818241 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9140930600818241 / 8000000000000000 : ℝ) ≤
            (133320654885380125309 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1140468233002529 / 2000000000000000 : ℝ)) (q :=
      (9140930600818241 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_545_7 :
    Uω (aρ 7) (bρ 7) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(240848857808598739739 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43811857060557489 / 80000000000000000 : ℝ) ≤
      (-(240848857808598739739 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43811857060557489 / 80000000000000000 : ℝ) =
            (43811857060557489 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43811857060557489 / 40000000000000000 : ℝ) ≤
            (36410014311401260261 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (85200055623269 / 156250000000000 : ℝ)) (q :=
      (43811857060557489 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_545_8 :
    Uω (aρ 8) (bρ 8) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(3300681018533957643367 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (41342475366695973 / 80000000000000000 : ℝ) ≤
      (-(3300681018533957643367 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (41342475366695973 / 80000000000000000 : ℝ) =
            (41342475366695973 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (41342475366695973 / 40000000000000000 : ℝ) ≤
            (165054882966042356633 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5118999787763837 / 10000000000000000 : ℝ)) (q :=
      (41342475366695973 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_545_9 :
    Uω (aρ 9) (bρ 9) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(1844874861177744237403 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38247442285464721 / 80000000000000000 : ℝ) ≤
      (-(1844874861177744237403 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (38247442285464721 / 80000000000000000 : ℝ) =
            (38247442285464721 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38247442285464721 / 20000000000000000 : ℝ) ≤
            (1620861040322255762597 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (585775893227003 / 1250000000000000 : ℝ)) (q :=
      (38247442285464721 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_545_10 :
    Uω (aρ 10) (bρ 10) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(336414102829495814321 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34501105847704137 / 80000000000000000 : ℝ) ≤
      (-(336414102829495814321 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (34501105847704137 / 80000000000000000 : ℝ) =
            (34501105847704137 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34501105847704137 / 20000000000000000 : ℝ) ≤
            (218103641410504185679 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2069091034935439 / 5000000000000000 : ℝ)) (q :=
      (34501105847704137 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_545_11 :
    Uω (aρ 11) (bρ 11) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(1956172290722271357863 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (30082406186747193 / 80000000000000000 : ℝ) ≤
      (-(1956172290722271357863 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (30082406186747193 / 80000000000000000 : ℝ) =
            (30082406186747193 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (30082406186747193 / 20000000000000000 : ℝ) ≤
            (816416430477728642137 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1725991890418321 / 5000000000000000 : ℝ)) (q :=
      (30082406186747193 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_545_12 :
    Uω (aρ 12) (bρ 12) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(11675955630294015158997 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24889127738889657 / 80000000000000000 : ℝ) ≤
      (-(11675955630294015158997 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (24889127738889657 / 80000000000000000 : ℝ) =
            (24889127738889657 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24889127738889657 / 20000000000000000 : ℝ) ≤
            (2186987975705984841003 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1288682132778629 / 5000000000000000 : ℝ)) (q :=
      (24889127738889657 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_545_13 :
    Uω (aρ 13) (bρ 13) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(14831083687162373912247 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18154496392940433 / 80000000000000000 : ℝ) ≤
      (-(14831083687162373912247 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (18154496392940433 / 80000000000000000 : ℝ) =
            (18154496392940433 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18154496392940433 / 10000000000000000 : ℝ) ≤
            (5963331721837626087753 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (161636021333119 / 1250000000000000 : ℝ)) (q :=
      (18154496392940433 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_545_14 :
    Uω (aρ 14) (bρ 14) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_545_15 :
    Uω (aρ 15) (bρ 15) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_545_16 :
    Uω (aρ 16) (bρ 16) (39828536950369 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_545 :
    Uρ (39828536950369 / 64000000000000 : ℝ) ≤
      (-(245766429868497178311 / 312500000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (39828536950369 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4847217421798197610027 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (39828536950369 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2443062744530523726207 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (39828536950369 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(992879575151331134011 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (39828536950369 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1273940532409412364583 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (39828536950369 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2649584500781039761267 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (39828536950369 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(559826525414619874691 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (39828536950369 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(240848857808598739739 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (39828536950369 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3300681018533957643367 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (39828536950369 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1844874861177744237403 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (39828536950369 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(336414102829495814321 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (39828536950369 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1956172290722271357863 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (39828536950369 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11675955630294015158997 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (39828536950369 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(14831083687162373912247 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (39828536950369 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (39828536950369 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (39828536950369 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_545_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_546_1 :
    Uω (aρ 1) (bρ 1) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(4829779413085618008589 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24677737281115379 / 40000000000000000 : ℝ) ≤
      (-(4829779413085618008589 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24677737281115379 / 40000000000000000 : ℝ) =
            (24677737281115379 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24677737281115379 / 20000000000000000 : ℝ) ≤
            (2101692389914381991411 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6169408115626127 / 10000000000000000 : ℝ)) (q :=
      (24677737281115379 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_546_2 :
    Uω (aρ 2) (bρ 2) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(2434309570975091985393 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24582075512730507 / 40000000000000000 : ℝ) ≤
      (-(2434309570975091985393 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24582075512730507 / 40000000000000000 : ℝ) =
            (24582075512730507 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24582075512730507 / 20000000000000000 : ℝ) ≤
            (1031426330524908014607 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6145346243943691 / 10000000000000000 : ℝ)) (q :=
      (24582075512730507 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_546_3 :
    Uω (aρ 3) (bρ 3) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(4946752824996576485697 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (975630204191363 / 1600000000000000 : ℝ) ≤
      (-(4946752824996576485697 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (975630204191363 / 1600000000000000 : ℝ) =
            (975630204191363 / 800000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (975630204191363 / 800000000000000 : ℝ) ≤
            (1984718978003423514303 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (243883285852819 / 400000000000000 : ℝ)) (q :=
      (975630204191363 / 1600000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_546_4 :
    Uω (aρ 4) (bρ 4) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(1269470136695590692193 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4814602497190733 / 8000000000000000 : ℝ) ≤
      (-(1269470136695590692193 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4814602497190733 / 8000000000000000 : ℝ) =
            (4814602497190733 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4814602497190733 / 4000000000000000 : ℝ) ≤
            (463397814054409307807 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (601650501797027 / 1000000000000000 : ℝ)) (q :=
      (4814602497190733 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_546_5 :
    Uω (aρ 5) (bρ 5) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(1056182323825263913179 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23589183765250227 / 40000000000000000 : ℝ) ≤
      (-(1056182323825263913179 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23589183765250227 / 40000000000000000 : ℝ) =
            (23589183765250227 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23589183765250227 / 20000000000000000 : ℝ) ≤
            (330112036774736086821 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5892780576953551 / 10000000000000000 : ℝ)) (q :=
      (23589183765250227 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_546_6 :
    Uω (aρ 6) (bρ 6) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(1394858296170015163569 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22895402710036903 / 40000000000000000 : ℝ) ≤
      (-(1394858296170015163569 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22895402710036903 / 40000000000000000 : ℝ) =
            (22895402710036903 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22895402710036903 / 20000000000000000 : ℝ) ≤
            (338009654579984836431 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5713130424486889 / 10000000000000000 : ℝ)) (q :=
      (22895402710036903 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_546_7 :
    Uω (aρ 7) (bρ 7) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(6001528506852776076673 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21949110245097181 / 40000000000000000 : ℝ) ≤
      (-(6001528506852776076673 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21949110245097181 / 40000000000000000 : ℝ) =
            (21949110245097181 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21949110245097181 / 20000000000000000 : ℝ) ≤
            (929943296147223923327 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1365911393194257 / 2500000000000000 : ℝ)) (q :=
      (21949110245097181 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_546_8 :
    Uω (aρ 8) (bρ 8) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(1316077306315072704157 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (165717137239417 / 320000000000000 : ℝ) ≤
      (-(1316077306315072704157 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (165717137239417 / 320000000000000 : ℝ) =
            (165717137239417 / 160000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (165717137239417 / 160000000000000 : ℝ) ≤
            (70217054284927295843 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (641244147379 / 1250000000000 : ℝ)) (q :=
      (165717137239417 / 320000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_546_9 :
    Uω (aρ 9) (bρ 9) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(1839147393547709124913 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19167583565192881 / 40000000000000000 : ℝ) ≤
      (-(1839147393547709124913 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19167583565192881 / 40000000000000000 : ℝ) =
            (19167583565192881 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19167583565192881 / 10000000000000000 : ℝ) ≤
            (1626588507952290875087 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2348694756262439 / 5000000000000000 : ℝ)) (q :=
      (19167583565192881 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_546_10 :
    Uω (aρ 10) (bρ 10) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(8384414277493951212261 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17295355994526979 / 40000000000000000 : ℝ) ≤
      (-(8384414277493951212261 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17295355994526979 / 40000000000000000 : ℝ) =
            (17295355994526979 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17295355994526979 / 10000000000000000 : ℝ) ≤
            (5478529328506048787739 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4149834760686927 / 10000000000000000 : ℝ)) (q :=
      (17295355994526979 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_546_11 :
    Uω (aρ 11) (bρ 11) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(9749780267626559126277 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15088025663808893 / 40000000000000000 : ℝ) ≤
      (-(9749780267626559126277 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15088025663808893 / 40000000000000000 : ℝ) =
            (15088025663808893 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15088025663808893 / 10000000000000000 : ℝ) ≤
            (4113163338373440873723 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (866161555383221 / 2500000000000000 : ℝ)) (q :=
      (15088025663808893 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_546_12 :
    Uω (aρ 12) (bρ 12) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(2326874644250277370813 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12496419102519193 / 40000000000000000 : ℝ) ≤
      (-(2326874644250277370813 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12496419102519193 / 40000000000000000 : ℝ) =
            (12496419102519193 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12496419102519193 / 10000000000000000 : ℝ) ≤
            (445714076949722629187 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1296271518786517 / 5000000000000000 : ℝ)) (q :=
      (12496419102519193 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_546_13 :
    Uω (aρ 13) (bρ 13) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(14748808740681928824749 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9152239278767629 / 40000000000000000 : ℝ) ≤
      (-(14748808740681928824749 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9152239278767629 / 40000000000000000 : ℝ) =
            (9152239278767629 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9152239278767629 / 5000000000000000 : ℝ) ≤
            (6045606668318071175251 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (329958716823063 / 2500000000000000 : ℝ)) (q :=
      (9152239278767629 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_546_14 :
    Uω (aρ 14) (bρ 14) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_546_15 :
    Uω (aρ 15) (bρ 15) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_546_16 :
    Uω (aρ 16) (bρ 16) (19948664777653 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_546 :
    Uρ (19948664777653 / 32000000000000 : ℝ) ≤
      (-(7841298324713687178439 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (19948664777653 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4829779413085618008589 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (19948664777653 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2434309570975091985393 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (19948664777653 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4946752824996576485697 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (19948664777653 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1269470136695590692193 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (19948664777653 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1056182323825263913179 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (19948664777653 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1394858296170015163569 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (19948664777653 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(6001528506852776076673 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (19948664777653 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1316077306315072704157 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (19948664777653 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1839147393547709124913 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (19948664777653 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(8384414277493951212261 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (19948664777653 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9749780267626559126277 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (19948664777653 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(2326874644250277370813 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (19948664777653 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(14748808740681928824749 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (19948664777653 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (19948664777653 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (19948664777653 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_546_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_547_1 :
    Uω (aρ 1) (bρ 1) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(4812371760118998631747 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49441465683013763 / 80000000000000000 : ℝ) ≤
      (-(4812371760118998631747 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49441465683013763 / 80000000000000000 : ℝ) =
            (49441465683013763 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49441465683013763 / 40000000000000000 : ℝ) ≤
            (2119100042881001368253 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (772519631412559 / 1250000000000000 : ℝ)) (q :=
      (49441465683013763 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_547_2 :
    Uω (aρ 2) (bρ 2) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(1212785847555891833407 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9850028838611011 / 16000000000000000 : ℝ) ≤
      (-(1212785847555891833407 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9850028838611011 / 16000000000000000 : ℝ) =
            (9850028838611011 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9850028838611011 / 8000000000000000 : ℝ) ≤
            (520082103194108166593 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1231219138264159 / 2000000000000000 : ℝ)) (q :=
      (9850028838611011 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_547_3 :
    Uω (aρ 3) (bρ 3) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(2464569430179590840317 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48867509506341239 / 80000000000000000 : ℝ) ≤
      (-(2464569430179590840317 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48867509506341239 / 80000000000000000 : ℝ) =
            (48867509506341239 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48867509506341239 / 40000000000000000 : ℝ) ≤
            (1001166471320409159683 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6107833125992341 / 10000000000000000 : ℝ)) (q :=
      (48867509506341239 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_547_4 :
    Uω (aρ 4) (bρ 4) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(316251931279762199151 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9646408133647383 / 16000000000000000 : ℝ) ≤
      (-(316251931279762199151 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9646408133647383 / 16000000000000000 : ℝ) =
            (9646408133647383 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9646408133647383 / 8000000000000000 : ℝ) ≤
            (116965056407737800849 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (301363004876563 / 500000000000000 : ℝ)) (q :=
      (9646408133647383 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_547_5 :
    Uω (aρ 5) (bρ 5) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(5262687560051708840297 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9452884811467307 / 16000000000000000 : ℝ) ≤
      (-(5262687560051708840297 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9452884811467307 / 16000000000000000 : ℝ) =
            (9452884811467307 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9452884811467307 / 8000000000000000 : ℝ) ≤
            (1668784242948291159703 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1180709172828233 / 2000000000000000 : ℝ)) (q :=
      (9452884811467307 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_547_6 :
    Uω (aρ 6) (bρ 6) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(5560636645839827234383 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9175391445551787 / 16000000000000000 : ℝ) ≤
      (-(5560636645839827234383 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9175391445551787 / 16000000000000000 : ℝ) =
            (9175391445551787 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9175391445551787 / 8000000000000000 : ℝ) ≤
            (1370835157160172765617 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1144783906377353 / 2000000000000000 : ℝ)) (q :=
      (9175391445551787 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_547_7 :
    Uω (aρ 7) (bρ 7) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(2990937303811851794713 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43984582450042547 / 80000000000000000 : ℝ) ≤
      (-(2990937303811851794713 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43984582450042547 / 80000000000000000 : ℝ) =
            (43984582450042547 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43984582450042547 / 40000000000000000 : ℝ) ≤
            (474798597688148205287 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1368621804554417 / 2500000000000000 : ℝ)) (q :=
      (43984582450042547 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_547_8 :
    Uω (aρ 8) (bρ 8) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(3279727881572910084163 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8303217959810399 / 16000000000000000 : ℝ) ≤
      (-(3279727881572910084163 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8303217959810399 / 16000000000000000 : ℝ) =
            (8303217959810399 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8303217959810399 / 8000000000000000 : ℝ) ≤
            (186008019927089915837 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (514090570681003 / 1000000000000000 : ℝ)) (q :=
      (8303217959810399 / 16000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_547_9 :
    Uω (aρ 9) (bρ 9) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(7333734172046849876191 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38422883898404551 / 80000000000000000 : ℝ) ≤
      (-(7333734172046849876191 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (38422883898404551 / 80000000000000000 : ℝ) =
            (38422883898404551 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38422883898404551 / 20000000000000000 : ℝ) ≤
            (6529209433953150123809 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4708569860008169 / 10000000000000000 : ℝ)) (q :=
      (38422883898404551 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_547_10 :
    Uω (aρ 10) (bρ 10) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(417927435075955961471 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34680298668558191 / 80000000000000000 : ℝ) ≤
      (-(417927435075955961471 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (34680298668558191 / 80000000000000000 : ℝ) =
            (34680298668558191 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34680298668558191 / 20000000000000000 : ℝ) ≤
            (275219745224044038529 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4161482586041579 / 10000000000000000 : ℝ)) (q :=
      (34680298668558191 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_547_11 :
    Uω (aρ 11) (bρ 11) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(4859406205668740621801 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (30269644934577319 / 80000000000000000 : ℝ) ≤
      (-(4859406205668740621801 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (30269644934577319 / 80000000000000000 : ℝ) =
            (30269644934577319 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (30269644934577319 / 20000000000000000 : ℝ) ≤
            (2072065597331259378199 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3477295778751361 / 10000000000000000 : ℝ)) (q :=
      (30269644934577319 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_547_12 :
    Uω (aρ 12) (bρ 12) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(11593033208050026335313 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25096372489155823 / 80000000000000000 : ℝ) ≤
      (-(11593033208050026335313 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25096372489155823 / 80000000000000000 : ℝ) =
            (25096372489155823 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25096372489155823 / 20000000000000000 : ℝ) ≤
            (2269910397949973664687 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2607677764080987 / 10000000000000000 : ℝ)) (q :=
      (25096372489155823 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_547_13 :
    Uω (aρ 13) (bρ 13) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(183352136630615516529 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18452678587610763 / 80000000000000000 : ℝ) ≤
      (-(183352136630615516529 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (18452678587610763 / 80000000000000000 : ℝ) =
            (18452678587610763 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18452678587610763 / 10000000000000000 : ℝ) ≤
            (76578055981884483471 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (673068015144861 / 5000000000000000 : ℝ)) (q :=
      (18452678587610763 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_547_14 :
    Uω (aρ 14) (bρ 14) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_547_15 :
    Uω (aρ 15) (bρ 15) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_547_16 :
    Uω (aρ 16) (bρ 16) (39966122160243 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_547 :
    Uρ (39966122160243 / 64000000000000 : ℝ) ≤
      (-(1954555256450453128983 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (39966122160243 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4812371760118998631747 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (39966122160243 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1212785847555891833407 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (39966122160243 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2464569430179590840317 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (39966122160243 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(316251931279762199151 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (39966122160243 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5262687560051708840297 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (39966122160243 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5560636645839827234383 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (39966122160243 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2990937303811851794713 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (39966122160243 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3279727881572910084163 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (39966122160243 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7333734172046849876191 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (39966122160243 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(417927435075955961471 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (39966122160243 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4859406205668740621801 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (39966122160243 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11593033208050026335313 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (39966122160243 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) * (-(183352136630615516529 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (39966122160243 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (39966122160243 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (39966122160243 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_547_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_548_1 :
    Uω (aρ 1) (bρ 1) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(2397497178697846703457 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6190932100316333 / 10000000000000000 : ℝ) ≤
      (-(2397497178697846703457 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6190932100316333 / 10000000000000000 : ℝ) =
            (6190932100316333 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6190932100316333 / 5000000000000000 : ℝ) ≤
            (1068238722802153296543 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6190905986658291 / 10000000000000000 : ℝ)) (q :=
      (6190932100316333 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_548_2 :
    Uω (aρ 2) (bρ 2) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(1208424531780068070263 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2466806867612131 / 4000000000000000 : ℝ) ≤
      (-(1208424531780068070263 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2466806867612131 / 4000000000000000 : ℝ) =
            (2466806867612131 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2466806867612131 / 2000000000000000 : ℝ) ≤
            (524443418969931929737 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (154171128414907 / 250000000000000 : ℝ)) (q :=
      (2466806867612131 / 4000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_548_3 :
    Uω (aρ 3) (bρ 3) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(613944484060455122537 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12238377193275971 / 20000000000000000 : ℝ) ≤
      (-(613944484060455122537 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12238377193275971 / 20000000000000000 : ℝ) =
            (12238377193275971 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12238377193275971 / 10000000000000000 : ℝ) ≤
            (252489491314544877463 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1529646024540399 / 2500000000000000 : ℝ)) (q :=
      (12238377193275971 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_548_4 :
    Uω (aρ 4) (bρ 4) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(252110653838961592423 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12079514068936013 / 20000000000000000 : ℝ) ≤
      (-(252110653838961592423 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12079514068936013 / 20000000000000000 : ℝ) =
            (12079514068936013 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12079514068936013 / 10000000000000000 : ℝ) ≤
            (94462936311038407577 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3019007577443319 / 5000000000000000 : ℝ)) (q :=
      (12079514068936013 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_548_5 :
    Uω (aρ 5) (bρ 5) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(5244496702731643532673 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5918810043115331 / 10000000000000000 : ℝ) ≤
      (-(5244496702731643532673 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5918810043115331 / 10000000000000000 : ℝ) =
            (5918810043115331 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5918810043115331 / 5000000000000000 : ℝ) ≤
            (1686975100268356467327 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5914311091516287 / 10000000000000000 : ℝ)) (q :=
      (5918810043115331 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_548_6 :
    Uω (aρ 6) (bρ 6) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(55418755033094918291 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11490777107644973 / 20000000000000000 : ℝ) ≤
      (-(55418755033094918291 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11490777107644973 / 20000000000000000 : ℝ) =
            (11490777107644973 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11490777107644973 / 10000000000000000 : ℝ) ≤
            (13895962996905081709 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2867354244035299 / 5000000000000000 : ℝ)) (q :=
      (11490777107644973 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_548_7 :
    Uω (aρ 7) (bρ 7) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(953961534678529139 / 1600000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11017735737204267 / 20000000000000000 : ℝ) ≤
      (-(953961534678529139 / 1600000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11017735737204267 / 20000000000000000 : ℝ) =
            (11017735737204267 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11017735737204267 / 10000000000000000 : ℝ) ≤
            (155073953801470861 / 1600000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1371332124597473 / 2500000000000000 : ℝ)) (q :=
      (11017735737204267 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_548_8 :
    Uω (aρ 8) (bρ 8) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(1634642384464888181893 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (260018074101987 / 500000000000000 : ℝ) ≤
      (-(1634642384464888181893 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (260018074101987 / 500000000000000 : ℝ) =
            (260018074101987 / 250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (260018074101987 / 250000000000000 : ℝ) ≤
            (98225566285111818107 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1030371475321021 / 2000000000000000 : ℝ)) (q :=
      (260018074101987 / 500000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_548_9 :
    Uω (aρ 9) (bρ 9) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(3655466485081770504419 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2406912040432491 / 5000000000000000 : ℝ) ≤
      (-(3655466485081770504419 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2406912040432491 / 5000000000000000 : ℝ) =
            (2406912040432491 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2406912040432491 / 1250000000000000 : ℝ) ≤
            (3276005317918229495581 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4719748202615589 / 10000000000000000 : ℝ)) (q :=
      (2406912040432491 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_548_10 :
    Uω (aρ 10) (bρ 10) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(4166377703121249495059 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8692466512294929 / 20000000000000000 : ℝ) ≤
      (-(4166377703121249495059 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8692466512294929 / 20000000000000000 : ℝ) =
            (8692466512294929 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8692466512294929 / 5000000000000000 : ℝ) ≤
            (2765094099878750504941 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2086562793337777 / 5000000000000000 : ℝ)) (q :=
      (8692466512294929 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_548_11 :
    Uω (aρ 11) (bρ 11) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(121099461847467560769 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7590796891998231 / 20000000000000000 : ℝ) ≤
      (-(121099461847467560769 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7590796891998231 / 20000000000000000 : ℝ) =
            (7590796891998231 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7590796891998231 / 5000000000000000 : ℝ) ≤
            (52187333227532439231 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (218120787036491 / 625000000000000 : ℝ)) (q :=
      (7590796891998231 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_548_12 :
    Uω (aρ 12) (bρ 12) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(5775966047425651859671 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1259986682061253 / 4000000000000000 : ℝ) ≤
      (-(5775966047425651859671 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1259986682061253 / 4000000000000000 : ℝ) =
            (1259986682061253 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1259986682061253 / 1000000000000000 : ℝ) ≤
            (1155505755574348140329 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (262276920757689 / 1000000000000000 : ℝ)) (q :=
      (1259986682061253 / 4000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_548_13 :
    Uω (aρ 13) (bρ 13) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(3647270300163015730903 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2324899871636139 / 10000000000000000 : ℝ) ≤
      (-(3647270300163015730903 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2324899871636139 / 10000000000000000 : ℝ) =
            (2324899871636139 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2324899871636139 / 1250000000000000 : ℝ) ≤
            (1551333552086984269097 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1372017282137903 / 10000000000000000 : ℝ)) (q :=
      (2324899871636139 / 10000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_548_14 :
    Uω (aρ 14) (bρ 14) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_548_15 :
    Uω (aρ 15) (bρ 15) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_548_16 :
    Uω (aρ 16) (bρ 16) (2001745738259 / 3200000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_548 :
    Uρ (2001745738259 / 3200000000000 : ℝ) ≤
      (-(7795288173310978959933 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (2001745738259 / 3200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2397497178697846703457 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (2001745738259 / 3200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1208424531780068070263 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (2001745738259 / 3200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(613944484060455122537 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (2001745738259 / 3200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(252110653838961592423 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (2001745738259 / 3200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5244496702731643532673 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (2001745738259 / 3200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(55418755033094918291 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (2001745738259 / 3200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) * (-(953961534678529139 / 1600000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (2001745738259 / 3200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1634642384464888181893 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (2001745738259 / 3200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3655466485081770504419 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (2001745738259 / 3200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(4166377703121249495059 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (2001745738259 / 3200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(121099461847467560769 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (2001745738259 / 3200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(5775966047425651859671 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (2001745738259 / 3200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(3647270300163015730903 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (2001745738259 / 3200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (2001745738259 / 3200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (2001745738259 / 3200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_548_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_549_1 :
    Uω (aρ 1) (bρ 1) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(1194411774990531570599 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49613447920788041 / 80000000000000000 : ℝ) ≤
      (-(1194411774990531570599 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49613447920788041 / 80000000000000000 : ℝ) =
            (49613447920788041 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49613447920788041 / 40000000000000000 : ℝ) ≤
            (538456175759468429401 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6201654921701229 / 10000000000000000 : ℝ)) (q :=
      (49613447920788041 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_549_2 :
    Uω (aρ 2) (bρ 2) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(4816283246437239450033 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9884426100613517 / 16000000000000000 : ℝ) ≤
      (-(4816283246437239450033 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9884426100613517 / 16000000000000000 : ℝ) =
            (9884426100613517 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9884426100613517 / 8000000000000000 : ℝ) ≤
            (2115188556562760549967 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1235518915956223 / 2000000000000000 : ℝ)) (q :=
      (9884426100613517 / 16000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_549_3 :
    Uω (aρ 3) (bρ 3) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(195760150103412896917 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49039508010013997 / 80000000000000000 : ℝ) ≤
      (-(195760150103412896917 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49039508010013997 / 80000000000000000 : ℝ) =
            (49039508010013997 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49039508010013997 / 40000000000000000 : ℝ) ≤
            (81498722016587103083 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3064667531433859 / 5000000000000000 : ℝ)) (q :=
      (49039508010013997 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_549_4 :
    Uω (aρ 4) (bρ 4) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(1256106740590143561431 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48404071794902537 / 80000000000000000 : ℝ) ≤
      (-(1256106740590143561431 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48404071794902537 / 80000000000000000 : ℝ) =
            (48404071794902537 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48404071794902537 / 40000000000000000 : ℝ) ≤
            (476761210159856438569 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6048770190154853 / 10000000000000000 : ℝ)) (q :=
      (48404071794902537 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_549_5 :
    Uω (aρ 5) (bρ 5) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(653292365778121990287 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (47436536394562869 / 80000000000000000 : ℝ) ≤
      (-(653292365778121990287 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (47436536394562869 / 80000000000000000 : ℝ) =
            (47436536394562869 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (47436536394562869 / 40000000000000000 : ℝ) ≤
            (213141609596878009713 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (740634532425617 / 1250000000000000 : ℝ)) (q :=
      (47436536394562869 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_549_6 :
    Uω (aρ 6) (bρ 6) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(690393702942002721149 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46049259031944133 / 80000000000000000 : ℝ) ≤
      (-(690393702942002721149 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (46049259031944133 / 80000000000000000 : ℝ) =
            (46049259031944133 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46049259031944133 / 40000000000000000 : ℝ) ≤
            (176040272432997278851 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1436374323472563 / 2500000000000000 : ℝ)) (q :=
      (46049259031944133 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_549_7 :
    Uω (aρ 7) (bρ 7) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(185708853261108282267 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44157301995163901 / 80000000000000000 : ℝ) ≤
      (-(185708853261108282267 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (44157301995163901 / 80000000000000000 : ℝ) =
            (44157301995163901 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44157301995163901 / 40000000000000000 : ℝ) ≤
            (30899640582641717733 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2748084707727597 / 5000000000000000 : ℝ)) (q :=
      (44157301995163901 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_549_8 :
    Uω (aρ 8) (bρ 8) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(6517727663076715180429 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8337938100698421 / 16000000000000000 : ℝ) ≤
      (-(6517727663076715180429 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8337938100698421 / 16000000000000000 : ℝ) =
            (8337938100698421 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8337938100698421 / 8000000000000000 : ℝ) ≤
            (413744139923284819571 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1032561638775449 / 2000000000000000 : ℝ)) (q :=
      (8337938100698421 / 16000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_549_9 :
    Uω (aρ 9) (bρ 9) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(7288185702466368188041 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38598293432777697 / 80000000000000000 : ℝ) ≤
      (-(7288185702466368188041 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (38598293432777697 / 80000000000000000 : ℝ) =
            (38598293432777697 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38598293432777697 / 20000000000000000 : ℝ) ≤
            (6574757903533631811959 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4730924554558643 / 10000000000000000 : ℝ)) (q :=
      (38598293432777697 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_549_10 :
    Uω (aρ 10) (bρ 10) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(8307033959244178314683 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (34859414292000669 / 80000000000000000 : ℝ) ≤
      (-(8307033959244178314683 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (34859414292000669 / 80000000000000000 : ℝ) =
            (34859414292000669 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (34859414292000669 / 20000000000000000 : ℝ) ≤
            (5555909646755821685317 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2092381901429693 / 5000000000000000 : ℝ)) (q :=
      (34859414292000669 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_549_11 :
    Uω (aρ 11) (bρ 11) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(603575809542648455083 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (30456679779584297 / 80000000000000000 : ℝ) ≤
      (-(603575809542648455083 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (30456679779584297 / 80000000000000000 : ℝ) =
            (30456679779584297 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (30456679779584297 / 20000000000000000 : ℝ) ≤
            (262858165832351544917 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3502556800960293 / 10000000000000000 : ℝ)) (q :=
      (30456679779584297 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_549_12 :
    Uω (aρ 12) (bρ 12) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(5755533234833897135403 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25302924632807569 / 80000000000000000 : ℝ) ≤
      (-(5755533234833897135403 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25302924632807569 / 80000000000000000 : ℝ) =
            (25302924632807569 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25302924632807569 / 20000000000000000 : ℝ) ≤
            (1175938568166102864597 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2637818110951111 / 10000000000000000 : ℝ)) (q :=
      (25302924632807569 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_549_13 :
    Uω (aρ 13) (bρ 13) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(14511458352928684789089 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18744133034056773 / 80000000000000000 : ℝ) ≤
      (-(14511458352928684789089 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (18744133034056773 / 80000000000000000 : ℝ) =
            (18744133034056773 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18744133034056773 / 10000000000000000 : ℝ) ≤
            (6282957056071315210911 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (349375488214603 / 2500000000000000 : ℝ)) (q :=
      (18744133034056773 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_549_14 :
    Uω (aρ 14) (bρ 14) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_549_15 :
    Uω (aρ 15) (bρ 15) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_549_16 :
    Uω (aρ 16) (bρ 16) (40103707370117 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_549 :
    Uρ (40103707370117 / 64000000000000 : ℝ) ≤
      (-(7772494551631630816607 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (40103707370117 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1194411774990531570599 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (40103707370117 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4816283246437239450033 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (40103707370117 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(195760150103412896917 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (40103707370117 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1256106740590143561431 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (40103707370117 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(653292365778121990287 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (40103707370117 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(690393702942002721149 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (40103707370117 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(185708853261108282267 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (40103707370117 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6517727663076715180429 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (40103707370117 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7288185702466368188041 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (40103707370117 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(8307033959244178314683 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (40103707370117 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(603575809542648455083 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (40103707370117 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(5755533234833897135403 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (40103707370117 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(14511458352928684789089 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (40103707370117 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (40103707370117 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (40103707370117 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_549_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_550_1 :
    Uω (aρ 1) (bρ 1) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(4760329883409985412941 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24849719518896217 / 40000000000000000 : ℝ) ≤
      (-(4760329883409985412941 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24849719518896217 / 40000000000000000 : ℝ) =
            (24849719518896217 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24849719518896217 / 20000000000000000 : ℝ) ≤
            (2171141919590014587059 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6212403856430921 / 10000000000000000 : ℝ)) (q :=
      (24849719518896217 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_550_2 :
    Uω (aρ 2) (bρ 2) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(959779728505078014553 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4950812364557353 / 8000000000000000 : ℝ) ≤
      (-(959779728505078014553 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4950812364557353 / 8000000000000000 : ℝ) =
            (4950812364557353 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4950812364557353 / 4000000000000000 : ℝ) ≤
            (426514632094921985447 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1237668804177239 / 2000000000000000 : ℝ)) (q :=
      (4950812364557353 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_550_3 :
    Uω (aρ 3) (bρ 3) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(2438241196225873571523 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24562753608614197 / 40000000000000000 : ℝ) ≤
      (-(2438241196225873571523 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24562753608614197 / 40000000000000000 : ℝ) =
            (24562753608614197 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24562753608614197 / 20000000000000000 : ℝ) ≤
            (1027494705274126428477 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6140086020149911 / 10000000000000000 : ℝ)) (q :=
      (24562753608614197 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_550_4 :
    Uω (aρ 4) (bρ 4) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(19557314236304715771 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (24245043613091401 / 40000000000000000 : ℝ) ≤
      (-(19557314236304715771 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24245043613091401 / 40000000000000000 : ℝ) =
            (24245043613091401 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24245043613091401 / 20000000000000000 : ℝ) ≤
            (7518747494164034229 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6059525203453513 / 10000000000000000 : ℝ)) (q :=
      (24245043613091401 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_550_5 :
    Uω (aρ 5) (bρ 5) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(520821411025116205967 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23761296103775901 / 40000000000000000 : ℝ) ≤
      (-(520821411025116205967 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23761296103775901 / 40000000000000000 : ℝ) =
            (23761296103775901 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23761296103775901 / 20000000000000000 : ℝ) ≤
            (172325769274883794033 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5935841368130763 / 10000000000000000 : ℝ)) (q :=
      (23761296103775901 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_550_6 :
    Uω (aρ 6) (bρ 6) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(5504458873723566257013 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4613540903523353 / 8000000000000000 : ℝ) ≤
      (-(5504458873723566257013 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4613540903523353 / 8000000000000000 : ℝ) =
            (4613540903523353 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4613540903523353 / 4000000000000000 : ℝ) ≤
            (1427012929276433742987 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1151257190038239 / 2000000000000000 : ℝ)) (q :=
      (4613540903523353 / 8000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_550_7 :
    Uω (aρ 7) (bρ 7) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(1184629118309960228537 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22121829798830323 / 40000000000000000 : ℝ) ≤
      (-(1184629118309960228537 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22121829798830323 / 40000000000000000 : ℝ) =
            (22121829798830323 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22121829798830323 / 20000000000000000 : ℝ) ≤
            (201665242290039771463 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2753504985778987 / 5000000000000000 : ℝ)) (q :=
      (22121829798830323 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_550_8 :
    Uω (aρ 8) (bρ 8) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(6496929947425930102249 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20888242881114017 / 40000000000000000 : ℝ) ≤
      (-(6496929947425930102249 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20888242881114017 / 40000000000000000 : ℝ) =
            (20888242881114017 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20888242881114017 / 20000000000000000 : ℝ) ≤
            (434541855574069897751 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5173758164039821 / 10000000000000000 : ℝ)) (q :=
      (20888242881114017 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_550_9 :
    Uω (aρ 9) (bρ 9) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(3632746052450233074369 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3868598631227813 / 8000000000000000 : ℝ) ≤
      (-(3632746052450233074369 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3868598631227813 / 8000000000000000 : ℝ) =
            (3868598631227813 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3868598631227813 / 2000000000000000 : ℝ) ≤
            (3298725750549766925631 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (948419785982469 / 2000000000000000 : ℝ)) (q :=
      (3868598631227813 / 8000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_550_10 :
    Uω (aρ 10) (bρ 10) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(8281383932199983076381 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17474471778125199 / 40000000000000000 : ℝ) ≤
      (-(8281383932199983076381 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17474471778125199 / 40000000000000000 : ℝ) =
            (17474471778125199 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17474471778125199 / 10000000000000000 : ℝ) ≤
            (5581559673800016923619 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1049099318600103 / 2500000000000000 : ℝ)) (q :=
      (17474471778125199 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_550_11 :
    Uω (aρ 11) (bρ 11) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(9626579514052903566141 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15275061056299521 / 40000000000000000 : ℝ) ≤
      (-(9626579514052903566141 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15275061056299521 / 40000000000000000 : ℝ) =
            (15275061056299521 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15275061056299521 / 10000000000000000 : ℝ) ≤
            (4236364091947096433859 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3515168539692573 / 10000000000000000 : ℝ)) (q :=
      (15275061056299521 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_550_12 :
    Uω (aρ 12) (bρ 12) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(11470433001551724661083 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12702974179877313 / 40000000000000000 : ℝ) ≤
      (-(11470433001551724661083 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12702974179877313 / 40000000000000000 : ℝ) =
            (12702974179877313 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12702974179877313 / 10000000000000000 : ℝ) ≤
            (2392510604448275338917 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2652825198166469 / 10000000000000000 : ℝ)) (q :=
      (12702974179877313 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_550_13 :
    Uω (aρ 13) (bρ 13) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(7217614053428216597823 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9443783011720333 / 40000000000000000 : ℝ) ≤
      (-(7217614053428216597823 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9443783011720333 / 40000000000000000 : ℝ) =
            (9443783011720333 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9443783011720333 / 5000000000000000 : ℝ) ≤
            (3179593651071783402177 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1422611355682979 / 10000000000000000 : ℝ)) (q :=
      (9443783011720333 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_550_14 :
    Uω (aρ 14) (bρ 14) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_550_15 :
    Uω (aρ 15) (bρ 15) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_550_16 :
    Uω (aρ 16) (bρ 16) (20086249987527 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_550 :
    Uρ (20086249987527 / 32000000000000 : ℝ) ≤
      (-(7749835359783882693713 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20086249987527 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4760329883409985412941 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20086249987527 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(959779728505078014553 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20086249987527 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2438241196225873571523 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20086249987527 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(19557314236304715771 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20086249987527 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(520821411025116205967 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20086249987527 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5504458873723566257013 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20086249987527 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1184629118309960228537 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20086249987527 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6496929947425930102249 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20086249987527 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3632746052450233074369 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20086249987527 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(8281383932199983076381 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20086249987527 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9626579514052903566141 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20086249987527 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11470433001551724661083 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20086249987527 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(7217614053428216597823 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20086249987527 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (20086249987527 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20086249987527 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_550_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_551_1 :
    Uω (aρ 1) (bρ 1) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(4743042603872454263259 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9957086030710067 / 16000000000000000 : ℝ) ≤
      (-(4743042603872454263259 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9957086030710067 / 16000000000000000 : ℝ) =
            (9957086030710067 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9957086030710067 / 8000000000000000 : ℝ) ≤
            (2188429199127545736741 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (622315279084899 / 1000000000000000 : ℝ)) (q :=
      (9957086030710067 / 16000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_551_2 :
    Uω (aρ 2) (bρ 2) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(2390772105142890830111 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49594116779803731 / 80000000000000000 : ℝ) ≤
      (-(2390772105142890830111 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49594116779803731 / 80000000000000000 : ℝ) =
            (49594116779803731 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49594116779803731 / 40000000000000000 : ℝ) ≤
            (1074963796357109169889 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6199093459922339 / 10000000000000000 : ℝ)) (q :=
      (49594116779803731 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_551_3 :
    Uω (aρ 3) (bρ 3) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(2429495842219293840209 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49211506394902783 / 80000000000000000 : ℝ) ≤
      (-(2429495842219293840209 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49211506394902783 / 80000000000000000 : ℝ) =
            (49211506394902783 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49211506394902783 / 40000000000000000 : ℝ) ≤
            (1036240059280706159791 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3075418485023551 / 5000000000000000 : ℝ)) (q :=
      (49211506394902783 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_551_4 :
    Uω (aρ 4) (bρ 4) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(2494474705526851839749 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48576102570051939 / 80000000000000000 : ℝ) ≤
      (-(2494474705526851839749 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48576102570051939 / 80000000000000000 : ℝ) =
            (48576102570051939 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48576102570051939 / 40000000000000000 : ℝ) ≤
            (971261195973148160251 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6070280194899391 / 10000000000000000 : ℝ)) (q :=
      (48576102570051939 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_551_5 :
    Uω (aρ 5) (bρ 5) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(259506106759272505429 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1904345911406987 / 3200000000000000 : ℝ) ≤
      (-(259506106759272505429 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1904345911406987 / 3200000000000000 : ℝ) =
            (1904345911406987 / 1600000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1904345911406987 / 1600000000000000 : ℝ) ≤
            (87067483390727494571 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (237864256720603 / 400000000000000 : ℝ)) (q :=
      (1904345911406987 / 3200000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_551_6 :
    Uω (aρ 6) (bρ 6) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(5485803121827726466689 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9244311688760919 / 16000000000000000 : ℝ) ≤
      (-(5485803121827726466689 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9244311688760919 / 16000000000000000 : ℝ) =
            (9244311688760919 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9244311688760919 / 8000000000000000 : ℝ) ≤
            (1445668681172273533311 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1153414891562511 / 2000000000000000 : ℝ)) (q :=
      (9244311688760919 / 16000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_551_7 :
    Uω (aρ 7) (bρ 7) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(5903646300329178437817 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44330015764817219 / 80000000000000000 : ℝ) ≤
      (-(5903646300329178437817 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (44330015764817219 / 80000000000000000 : ℝ) =
            (44330015764817219 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44330015764817219 / 40000000000000000 : ℝ) ≤
            (1027825502670821562183 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5517850168825711 / 10000000000000000 : ℝ)) (q :=
      (44330015764817219 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_551_8 :
    Uω (aρ 8) (bρ 8) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(6476176200793001902877 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8372655530798919 / 16000000000000000 : ℝ) ≤
      (-(6476176200793001902877 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8372655530798919 / 16000000000000000 : ℝ) =
            (8372655530798919 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8372655530798919 / 8000000000000000 : ℝ) ≤
            (455295602206998097123 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1036941458492011 / 2000000000000000 : ℝ)) (q :=
      (8372655530798919 / 16000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_551_9 :
    Uω (aρ 9) (bρ 9) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(905356489426210870313 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (38773671341181867 / 80000000000000000 : ℝ) ≤
      (-(905356489426210870313 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (38773671341181867 / 80000000000000000 : ℝ) =
            (38773671341181867 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (38773671341181867 / 20000000000000000 : ℝ) ≤
            (827511461323789129687 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4753271342616873 / 10000000000000000 : ℝ)) (q :=
      (38773671341181867 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_551_10 :
    Uω (aρ 10) (bρ 10) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(412790245041383228599 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (280307631994663 / 640000000000000 : ℝ) ≤
      (-(412790245041383228599 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (280307631994663 / 640000000000000 : ℝ) =
            (280307631994663 / 160000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (280307631994663 / 160000000000000 : ℝ) ≤
            (280356935258616771401 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33664208325197 / 80000000000000 : ℝ)) (q :=
      (280307631994663 / 640000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_551_11 :
    Uω (aρ 11) (bρ 11) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(2399013933030365643021 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (30643515101983563 / 80000000000000000 : ℝ) ≤
      (-(2399013933030365643021 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (30643515101983563 / 80000000000000000 : ℝ) =
            (30643515101983563 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (30643515101983563 / 20000000000000000 : ℝ) ≤
            (1066721968469634356979 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3527767942517297 / 10000000000000000 : ℝ)) (q :=
      (30643515101983563 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_551_12 :
    Uω (aρ 12) (bρ 12) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(11430028437903927354641 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25508807644800619 / 80000000000000000 : ℝ) ≤
      (-(11430028437903927354641 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25508807644800619 / 80000000000000000 : ℝ) =
            (25508807644800619 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25508807644800619 / 20000000000000000 : ℝ) ≤
            (2432915168096072645359 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2667791174906561 / 10000000000000000 : ℝ)) (q :=
      (25508807644800619 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_551_13 :
    Uω (aρ 13) (bρ 13) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(1436032230020782576113 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19029576065137959 / 80000000000000000 : ℝ) ≤
      (-(1436032230020782576113 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19029576065137959 / 80000000000000000 : ℝ) =
            (19029576065137959 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19029576065137959 / 10000000000000000 : ℝ) ≤
            (643409310879217423887 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (180920627698237 / 1250000000000000 : ℝ)) (q :=
      (19029576065137959 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_551_14 :
    Uω (aρ 14) (bρ 14) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_551_15 :
    Uω (aρ 15) (bρ 15) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_551_16 :
    Uω (aρ 16) (bρ 16) (40241292579991 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_551 :
    Uρ (40241292579991 / 64000000000000 : ℝ) ≤
      (-(7727306164144297624663 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (40241292579991 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4743042603872454263259 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (40241292579991 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2390772105142890830111 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (40241292579991 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2429495842219293840209 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (40241292579991 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2494474705526851839749 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (40241292579991 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(259506106759272505429 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (40241292579991 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5485803121827726466689 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (40241292579991 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5903646300329178437817 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (40241292579991 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6476176200793001902877 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (40241292579991 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(905356489426210870313 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (40241292579991 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(412790245041383228599 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (40241292579991 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(2399013933030365643021 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (40241292579991 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11430028437903927354641 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (40241292579991 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(1436032230020782576113 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (40241292579991 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (40241292579991 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (40241292579991 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_551_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_552_1 :
    Uω (aρ 1) (bρ 1) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(4725785158020472823779 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1558481914627131 / 2500000000000000 : ℝ) ≤
      (-(4725785158020472823779 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1558481914627131 / 2500000000000000 : ℝ) =
            (1558481914627131 / 1250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1558481914627131 / 1250000000000000 : ℝ) ≤
            (2205686644979527176221 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (779237715619631 / 1250000000000000 : ℝ)) (q :=
      (1558481914627131 / 2500000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_552_2 :
    Uω (aρ 2) (bρ 2) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(4764219845165794570447 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12420027476450291 / 20000000000000000 : ℝ) ≤
      (-(4764219845165794570447 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12420027476450291 / 20000000000000000 : ℝ) =
            (12420027476450291 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12420027476450291 / 10000000000000000 : ℝ) ≤
            (2167251957834205429553 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6209842896900291 / 10000000000000000 : ℝ)) (q :=
      (12420027476450291 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_552_3 :
    Uω (aρ 3) (bρ 3) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(2420765760732845746699 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (246487527715959 / 400000000000000 : ℝ) ≤
      (-(2420765760732845746699 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (246487527715959 / 400000000000000 : ℝ) =
            (246487527715959 / 200000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (246487527715959 / 200000000000000 : ℝ) ≤
            (1044970140767154253301 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (123231758251959 / 200000000000000 : ℝ)) (q :=
      (246487527715959 / 400000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_552_4 :
    Uω (aρ 4) (bρ 4) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(1242814437627491156317 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6082764728371717 / 10000000000000000 : ℝ) ≤
      (-(1242814437627491156317 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6082764728371717 / 10000000000000000 : ℝ) =
            (6082764728371717 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6082764728371717 / 5000000000000000 : ℝ) ≤
            (490053513122508843683 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3040517582304217 / 5000000000000000 : ℝ)) (q :=
      (6082764728371717 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_552_5 :
    Uω (aρ 5) (bρ 5) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(5172062882054117301997 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11923675782176853 / 20000000000000000 : ℝ) ≤
      (-(5172062882054117301997 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11923675782176853 / 20000000000000000 : ℝ) =
            (11923675782176853 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11923675782176853 / 10000000000000000 : ℝ) ≤
            (1759408920945882698003 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5957371409376853 / 10000000000000000 : ℝ)) (q :=
      (11923675782176853 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_552_6 :
    Uω (aρ 6) (bρ 6) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(136679555913746854773 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5788463407623591 / 10000000000000000 : ℝ) ≤
      (-(136679555913746854773 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5788463407623591 / 10000000000000000 : ℝ) =
            (5788463407623591 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5788463407623591 / 5000000000000000 : ℝ) ≤
            (36607239161253145227 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2888931408793591 / 5000000000000000 : ℝ)) (q :=
      (5788463407623591 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_552_7 :
    Uω (aρ 7) (bρ 7) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(5884185278614776937653 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (88832741010153 / 160000000000000 : ℝ) ≤
      (-(5884185278614776937653 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (88832741010153 / 160000000000000 : ℝ) = (88832741010153 / 80000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (88832741010153 / 80000000000000 : ℝ) ≤
            (1047286524385223062347 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (44229520074953 / 80000000000000 : ℝ)) (q :=
      (88832741010153 / 160000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_552_8 :
    Uω (aρ 8) (bρ 8) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(5164372987447805311 / 8000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5243758275009757 / 10000000000000000 : ℝ) ≤
      (-(5164372987447805311 / 8000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5243758275009757 / 10000000000000000 : ℝ) =
            (5243758275009757 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5243758275009757 / 5000000000000000 : ℝ) ≤
            (380804454952194689 / 8000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2597827792229757 / 5000000000000000 : ℝ)) (q :=
      (5243758275009757 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_552_9 :
    Uω (aρ 9) (bρ 9) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(3610132436957952754391 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2428834285919803 / 5000000000000000 : ℝ) ≤
      (-(3610132436957952754391 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2428834285919803 / 5000000000000000 : ℝ) =
            (2428834285919803 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2428834285919803 / 1250000000000000 : ℝ) ≤
            (3321339366042047245609 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1191110451619803 / 2500000000000000 : ℝ)) (q :=
      (2428834285919803 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_552_10 :
    Uω (aρ 10) (bρ 10) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(8230296444833993408677 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2195496611053351 / 5000000000000000 : ℝ) ≤
      (-(8230296444833993408677 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2195496611053351 / 5000000000000000 : ℝ) =
            (2195496611053351 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2195496611053351 / 1250000000000000 : ℝ) ≤
            (5632647161166006591323 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1054912535127101 / 2500000000000000 : ℝ)) (q :=
      (2195496611053351 / 5000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_552_11 :
    Uω (aρ 11) (bρ 11) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(2391410179756399555909 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1536842963727483 / 4000000000000000 : ℝ) ≤
      (-(2391410179756399555909 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1536842963727483 / 4000000000000000 : ℝ) =
            (1536842963727483 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1536842963727483 / 1000000000000000 : ℝ) ≤
            (1074325721743600444091 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (708071028227483 / 2000000000000000 : ℝ)) (q :=
      (1536842963727483 / 4000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_552_12 :
    Uω (aρ 12) (bρ 12) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(11389849601897008077703 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (640287631001113 / 2000000000000000 : ℝ) ≤
      (-(11389849601897008077703 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (640287631001113 / 2000000000000000 : ℝ) =
            (640287631001113 / 500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (640287631001113 / 500000000000000 : ℝ) ≤
            (2473094004102991922297 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (268271672919613 / 1000000000000000 : ℝ)) (q :=
      (640287631001113 / 2000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12]) (by norm_num [bρ_12])
      (by norm_num) (by norm_num [aρ_12, bρ_12]) (by norm_num [aρ_12, bρ_12]) hlg

lemma U_552_13 :
    Uω (aρ 13) (bρ 13) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(1428667820436467843137 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4792558739157083 / 20000000000000000 : ℝ) ≤
      (-(1428667820436467843137 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4792558739157083 / 20000000000000000 : ℝ) =
            (4792558739157083 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4792558739157083 / 2500000000000000 : ℝ) ≤
            (650773720463532156863 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1471780899937083 / 10000000000000000 : ℝ)) (q :=
      (4792558739157083 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_552_14 :
    Uω (aρ 14) (bρ 14) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_552_15 :
    Uω (aρ 15) (bρ 15) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_552_16 :
    Uω (aρ 16) (bρ 16) (1259690162029 / 2000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_552 :
    Uρ (1259690162029 / 2000000000000 : ℝ) ≤
      (-(61639222863656401809 / 80000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1259690162029 / 2000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4725785158020472823779 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1259690162029 / 2000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4764219845165794570447 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1259690162029 / 2000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2420765760732845746699 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1259690162029 / 2000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1242814437627491156317 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1259690162029 / 2000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5172062882054117301997 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1259690162029 / 2000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(136679555913746854773 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1259690162029 / 2000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5884185278614776937653 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1259690162029 / 2000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) * (-(5164372987447805311 / 8000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1259690162029 / 2000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3610132436957952754391 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1259690162029 / 2000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(8230296444833993408677 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1259690162029 / 2000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(2391410179756399555909 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1259690162029 / 2000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11389849601897008077703 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1259690162029 / 2000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(1428667820436467843137 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1259690162029 / 2000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1259690162029 / 2000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1259690162029 / 2000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_552_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_553_1 :
    Uω (aρ 1) (bρ 1) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(294284840191189489643 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49957412381352409 / 80000000000000000 : ℝ) ≤
      (-(294284840191189489643 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49957412381352409 / 80000000000000000 : ℝ) =
            (49957412381352409 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49957412381352409 / 40000000000000000 : ℝ) ≤
            (138932147496310510357 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (780581332344587 / 1250000000000000 : ℝ)) (q :=
      (49957412381352409 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_553_2 :
    Uω (aρ 2) (bρ 2) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(593365680394418844097 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49766103023608513 / 80000000000000000 : ℝ) ≤
      (-(593365680394418844097 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49766103023608513 / 80000000000000000 : ℝ) =
            (49766103023608513 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49766103023608513 / 40000000000000000 : ℝ) ≤
            (273068294980581155903 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3110296165915361 / 5000000000000000 : ℝ)) (q :=
      (49766103023608513 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_553_3 :
    Uω (aρ 3) (bρ 3) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(4824101797013151299569 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9876700932449797 / 16000000000000000 : ℝ) ≤
      (-(4824101797013151299569 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9876700932449797 / 16000000000000000 : ℝ) =
            (9876700932449797 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9876700932449797 / 8000000000000000 : ℝ) ≤
            (2107370005986848700431 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (154308471196021 / 250000000000000 : ℝ)) (q :=
      (9876700932449797 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_553_4 :
    Uω (aρ 4) (bρ 4) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(990719470384999601177 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48748132997408709 / 80000000000000000 : ℝ) ≤
      (-(990719470384999601177 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48748132997408709 / 80000000000000000 : ℝ) =
            (48748132997408709 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48748132997408709 / 40000000000000000 : ℝ) ≤
            (395574890215000398823 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6091790112695771 / 10000000000000000 : ℝ)) (q :=
      (48748132997408709 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_553_5 :
    Uω (aρ 5) (bρ 5) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(16106363226655447673 / 31250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (47780758239416737 / 80000000000000000 : ℝ) ≤
      (-(16106363226655447673 / 31250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (47780758239416737 / 80000000000000000 : ℝ) =
            (47780758239416737 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (47780758239416737 / 40000000000000000 : ℝ) ≤
            (5554486157719552327 / 31250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2984068171266389 / 5000000000000000 : ℝ)) (q :=
      (47780758239416737 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_553_6 :
    Uω (aρ 6) (bρ 6) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(2724298043665763560073 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46393855490092449 / 80000000000000000 : ℝ) ≤
      (-(2724298043665763560073 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (46393855490092449 / 80000000000000000 : ℝ) =
            (46393855490092449 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46393855490092449 / 40000000000000000 : ℝ) ≤
            (741437857834236439927 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2894325515170853 / 5000000000000000 : ℝ)) (q :=
      (46393855490092449 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_553_7 :
    Uω (aρ 7) (bρ 7) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(183273824226132342093 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1780108953072601 / 3200000000000000 : ℝ) ≤
      (-(183273824226132342093 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1780108953072601 / 3200000000000000 : ℝ) =
            (1780108953072601 / 1600000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1780108953072601 / 1600000000000000 : ℝ) ≤
            (33334669617617657907 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (110790589905647 / 200000000000000 : ℝ)) (q :=
      (1780108953072601 / 3200000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_553_8 :
    Uω (aρ 8) (bρ 8) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(3217399930171501478579 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42036851421584033 / 80000000000000000 : ℝ) ≤
      (-(3217399930171501478579 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42036851421584033 / 80000000000000000 : ℝ) =
            (42036851421584033 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42036851421584033 / 40000000000000000 : ℝ) ≤
            (248335971328498521421 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2603301522657301 / 5000000000000000 : ℝ)) (q :=
      (42036851421584033 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_553_9 :
    Uω (aρ 9) (bρ 9) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(143954614445972021909 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7789803613516941 / 16000000000000000 : ℝ) ≤
      (-(143954614445972021909 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7789803613516941 / 16000000000000000 : ℝ) =
            (7789803613516941 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7789803613516941 / 4000000000000000 : ℝ) ≤
            (133304257674027978091 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (477561033517477 / 1000000000000000 : ℝ)) (q :=
      (7789803613516941 / 16000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_553_10 :
    Uω (aρ 10) (bρ 10) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(4102429073931367588247 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35217419042646141 / 80000000000000000 : ℝ) ≤
      (-(4102429073931367588247 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35217419042646141 / 80000000000000000 : ℝ) =
            (35217419042646141 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35217419042646141 / 20000000000000000 : ℝ) ≤
            (2829042729068632411753 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4231269612435129 / 10000000000000000 : ℝ)) (q :=
      (35217419042646141 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_553_11 :
    Uω (aρ 11) (bρ 11) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(9535333598606493714421 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (30830155149136949 / 80000000000000000 : ℝ) ≤
      (-(9535333598606493714421 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (30830155149136949 / 80000000000000000 : ℝ) =
            (30830155149136949 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (30830155149136949 / 20000000000000000 : ℝ) ≤
            (4327610007393506285579 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3552930265262831 / 10000000000000000 : ℝ)) (q :=
      (30830155149136949 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_553_12 :
    Uω (aρ 12) (bρ 12) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(11349893390006880405851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25714043829325249 / 80000000000000000 : ℝ) ≤
      (-(11349893390006880405851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25714043829325249 / 80000000000000000 : ℝ) =
            (25714043829325249 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25714043829325249 / 20000000000000000 : ℝ) ≤
            (2513050215993119594149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1348801265997453 / 5000000000000000 : ℝ)) (q :=
      (25714043829325249 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_553_13 :
    Uω (aρ 13) (bρ 13) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(7107118967621958687121 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19309608859234949 / 80000000000000000 : ℝ) ≤
      (-(7107118967621958687121 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19309608859234949 / 80000000000000000 : ℝ) =
            (19309608859234949 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19309608859234949 / 10000000000000000 : ℝ) ≤
            (3290088736878041312879 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1495875531067331 / 10000000000000000 : ℝ)) (q :=
      (19309608859234949 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_553_14 :
    Uω (aρ 14) (bρ 14) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_553_15 :
    Uω (aρ 15) (bρ 15) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_553_16 :
    Uω (aρ 16) (bρ 16) (8075775557973 / 12800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_553 :
    Uρ (8075775557973 / 12800000000000 : ℝ) ≤
      (-(3841310813236541712291 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (8075775557973 / 12800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(294284840191189489643 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (8075775557973 / 12800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(593365680394418844097 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (8075775557973 / 12800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4824101797013151299569 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (8075775557973 / 12800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(990719470384999601177 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (8075775557973 / 12800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(16106363226655447673 / 31250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (8075775557973 / 12800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2724298043665763560073 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (8075775557973 / 12800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(183273824226132342093 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (8075775557973 / 12800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3217399930171501478579 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (8075775557973 / 12800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(143954614445972021909 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (8075775557973 / 12800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(4102429073931367588247 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (8075775557973 / 12800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9535333598606493714421 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (8075775557973 / 12800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11349893390006880405851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (8075775557973 / 12800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(7107118967621958687121 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (8075775557973 / 12800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (8075775557973 / 12800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (8075775557973 / 12800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_553_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_554_1 :
    Uω (aρ 1) (bρ 1) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(293209959795218729589 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25021701746704671 / 40000000000000000 : ℝ) ≤
      (-(293209959795218729589 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25021701746704671 / 40000000000000000 : ℝ) =
            (25021701746704671 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25021701746704671 / 20000000000000000 : ℝ) ≤
            (140007027892281270411 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6255399592249523 / 10000000000000000 : ℝ)) (q :=
      (25021701746704671 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_554_2 :
    Uω (aρ 2) (bρ 2) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(4729660900783168347879 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24926048066634081 / 40000000000000000 : ℝ) ≤
      (-(4729660900783168347879 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24926048066634081 / 40000000000000000 : ℝ) =
            (24926048066634081 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24926048066634081 / 20000000000000000 : ℝ) ≤
            (2201810902216831652121 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1557835441181057 / 2500000000000000 : ℝ)) (q :=
      (24926048066634081 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_554_3 :
    Uω (aρ 3) (bρ 3) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(2403351202558697929501 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24734751876113413 / 40000000000000000 : ℝ) ≤
      (-(2403351202558697929501 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24734751876113413 / 40000000000000000 : ℝ) =
            (24734751876113413 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24734751876113413 / 20000000000000000 : ℝ) ≤
            (1062384698941302070499 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3091544887906947 / 5000000000000000 : ℝ)) (q :=
      (24734751876113413 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_554_4 :
    Uω (aρ 4) (bρ 4) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(123399202623718425537 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24417074040907061 / 40000000000000000 : ℝ) ≤
      (-(123399202623718425537 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24417074040907061 / 40000000000000000 : ℝ) =
            (24417074040907061 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24417074040907061 / 20000000000000000 : ℝ) ≤
            (49887592451281574463 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3051272519637859 / 5000000000000000 : ℝ)) (q :=
      (24417074040907061 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_554_5 :
    Uω (aρ 5) (bρ 5) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(1284010517231633783179 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23933406559280117 / 40000000000000000 : ℝ) ≤
      (-(1284010517231633783179 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23933406559280117 / 40000000000000000 : ℝ) =
            (23933406559280117 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23933406559280117 / 20000000000000000 : ℝ) ≤
            (448857433518366216821 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2989450608898623 / 5000000000000000 : ℝ)) (q :=
      (23933406559280117 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_554_6 :
    Uω (aρ 6) (bρ 6) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(1357511136087193952523 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23240001567198817 / 40000000000000000 : ℝ) ≤
      (-(1357511136087193952523 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23240001567198817 / 40000000000000000 : ℝ) =
            (23240001567198817 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23240001567198817 / 20000000000000000 : ℝ) ≤
            (375356814662806047477 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1449859774224149 / 2500000000000000 : ℝ)) (q :=
      (23240001567198817 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_554_7 :
    Uω (aρ 7) (bρ 7) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(5845377439924378908381 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22294537869171803 / 40000000000000000 : ℝ) ≤
      (-(5845377439924378908381 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22294537869171803 / 40000000000000000 : ℝ) =
            (22294537869171803 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22294537869171803 / 20000000000000000 : ℝ) ≤
            (1086094363075621091619 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5550368628643089 / 10000000000000000 : ℝ)) (q :=
      (22294537869171803 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_554_8 :
    Uω (aρ 8) (bρ 8) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(3207088446241811533109 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21061816669719703 / 40000000000000000 : ℝ) ≤
      (-(3207088446241811533109 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21061816669719703 / 40000000000000000 : ℝ) =
            (21061816669719703 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21061816669719703 / 20000000000000000 : ℝ) ≤
            (258647455258188466891 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5217549680257039 / 10000000000000000 : ℝ)) (q :=
      (21061816669719703 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_554_9 :
    Uω (aρ 9) (bρ 9) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(1793812301093678316561 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3903667987396711 / 8000000000000000 : ℝ) ≤
      (-(1793812301093678316561 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3903667987396711 / 8000000000000000 : ℝ) =
            (3903667987396711 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3903667987396711 / 2000000000000000 : ℝ) ≤
            (1671923600406321683439 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (957355388449793 / 2000000000000000 : ℝ)) (q :=
      (3903667987396711 / 8000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_554_10 :
    Uω (aρ 10) (bρ 10) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(4089744798721756566173 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17653436974398951 / 40000000000000000 : ℝ) ≤
      (-(4089744798721756566173 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17653436974398951 / 40000000000000000 : ℝ) =
            (17653436974398951 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17653436974398951 / 10000000000000000 : ℝ) ≤
            (2841727004278243433827 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4242884494451663 / 10000000000000000 : ℝ)) (q :=
      (17653436974398951 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_554_11 :
    Uω (aρ 11) (bρ 11) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(190102670123856259617 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15461701618385637 / 40000000000000000 : ℝ) ≤
      (-(190102670123856259617 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15461701618385637 / 40000000000000000 : ℝ) =
            (15461701618385637 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15461701618385637 / 10000000000000000 : ℝ) ≤
            (87156201996143740383 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1782746721325003 / 5000000000000000 : ℝ)) (q :=
      (15461701618385637 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_554_12 :
    Uω (aρ 12) (bρ 12) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(113101567696471236689 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12908213015248219 / 40000000000000000 : ℝ) ≤
      (-(113101567696471236689 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12908213015248219 / 40000000000000000 : ℝ) =
            (12908213015248219 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12908213015248219 / 10000000000000000 : ℝ) ≤
            (25527868363528763311 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2712449237766297 / 10000000000000000 : ℝ)) (q :=
      (12908213015248219 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_554_13 :
    Uω (aρ 13) (bρ 13) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(7071473971965871018263 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1944775889466269 / 8000000000000000 : ℝ) ≤
      (-(7071473971965871018263 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1944775889466269 / 8000000000000000 : ℝ) =
            (1944775889466269 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1944775889466269 / 1000000000000000 : ℝ) ≤
            (3325733732534128981737 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (75983209770143 / 500000000000000 : ℝ)) (q :=
      (1944775889466269 / 8000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_554_14 :
    Uω (aρ 14) (bρ 14) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_554_15 :
    Uω (aρ 15) (bρ 15) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_554_16 :
    Uω (aρ 16) (bρ 16) (20223835197401 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_554 :
    Uρ (20223835197401 / 32000000000000 : ℝ) ≤
      (-(7660458916787004784987 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20223835197401 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(293209959795218729589 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20223835197401 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4729660900783168347879 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20223835197401 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(2403351202558697929501 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20223835197401 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(123399202623718425537 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20223835197401 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1284010517231633783179 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20223835197401 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1357511136087193952523 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20223835197401 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5845377439924378908381 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20223835197401 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3207088446241811533109 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20223835197401 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1793812301093678316561 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20223835197401 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(4089744798721756566173 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20223835197401 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(190102670123856259617 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20223835197401 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(113101567696471236689 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20223835197401 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(7071473971965871018263 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20223835197401 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (20223835197401 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20223835197401 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_554_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_555_1 :
    Uω (aρ 1) (bρ 1) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(1168547699318994396631 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (50129394604245311 / 80000000000000000 : ℝ) ≤
      (-(1168547699318994396631 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (50129394604245311 / 80000000000000000 : ℝ) =
            (50129394604245311 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (50129394604245311 / 40000000000000000 : ℝ) ≤
            (564320251431005603369 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6266148525437109 / 10000000000000000 : ℝ)) (q :=
      (50129394604245311 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_555_2 :
    Uω (aρ 2) (bρ 2) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(1178106528778261540091 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49938089234822199 / 80000000000000000 : ℝ) ≤
      (-(1178106528778261540091 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49938089234822199 / 80000000000000000 : ℝ) =
            (49938089234822199 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49938089234822199 / 40000000000000000 : ℝ) ≤
            (554761421971738459909 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6242091195591331 / 10000000000000000 : ℝ)) (q :=
      (49938089234822199 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_555_3 :
    Uω (aρ 3) (bρ 3) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(4789333240367326840447 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49555502813276743 / 80000000000000000 : ℝ) ≤
      (-(4789333240367326840447 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49555502813276743 / 80000000000000000 : ℝ) =
            (49555502813276743 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49555502813276743 / 40000000000000000 : ℝ) ≤
            (2142138562632673159553 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6193840696554967 / 10000000000000000 : ℝ)) (q :=
      (49555502813276743 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_555_4 :
    Uω (aρ 4) (bρ 4) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(2459184949907346047189 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48920163080644023 / 80000000000000000 : ℝ) ≤
      (-(2459184949907346047189 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48920163080644023 / 80000000000000000 : ℝ) =
            (48920163080644023 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48920163080644023 / 40000000000000000 : ℝ) ≤
            (1006550951592653952811 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6113299944461787 / 10000000000000000 : ℝ)) (q :=
      (48920163080644023 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_555_5 :
    Uω (aρ 5) (bρ 5) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(5118080274195688240163 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (47952867767386439 / 80000000000000000 : ℝ) ≤
      (-(5118080274195688240163 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (47952867767386439 / 80000000000000000 : ℝ) =
            (47952867767386439 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (47952867767386439 / 40000000000000000 : ℝ) ≤
            (1813391528804311759837 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5989666035482391 / 10000000000000000 : ℝ)) (q :=
      (47952867767386439 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_555_6 :
    Uω (aρ 6) (bρ 6) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(1352881869626692158181 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46566150197161723 / 80000000000000000 : ℝ) ≤
      (-(1352881869626692158181 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (46566150197161723 / 80000000000000000 : ℝ) =
            (46566150197161723 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46566150197161723 / 40000000000000000 : ℝ) ≤
            (379986081123307841819 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1452556754516553 / 2500000000000000 : ℝ)) (q :=
      (46566150197161723 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_555_7 :
    Uω (aρ 7) (bρ 7) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(1165206064660802796103 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (44675426247907999 / 80000000000000000 : ℝ) ≤
      (-(1165206064660802796103 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (44675426247907999 / 80000000000000000 : ℝ) =
            (44675426247907999 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (44675426247907999 / 40000000000000000 : ℝ) ≤
            (221088295939197203897 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5561207411512781 / 10000000000000000 : ℝ)) (q :=
      (44675426247907999 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_555_8 :
    Uω (aρ 8) (bρ 8) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(6393597145535780670923 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42210411974394231 / 80000000000000000 : ℝ) ≤
      (-(6393597145535780670923 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42210411974394231 / 80000000000000000 : ℝ) =
            (42210411974394231 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42210411974394231 / 40000000000000000 : ℝ) ≤
            (537874657464219329077 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5228495494474339 / 10000000000000000 : ℝ)) (q :=
      (42210411974394231 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_555_9 :
    Uω (aρ 9) (bρ 9) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(7152820065878755550463 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7824866809506411 / 16000000000000000 : ℝ) ≤
      (-(7152820065878755550463 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7824866809506411 / 16000000000000000 : ℝ) =
            (7824866809506411 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7824866809506411 / 4000000000000000 : ℝ) ≤
            (6710123540121244449537 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (959588328223759 / 2000000000000000 : ℝ)) (q :=
      (7824866809506411 / 16000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_555_10 :
    Uω (aρ 10) (bρ 10) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(1630838076988301541033 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35396310645675803 / 80000000000000000 : ℝ) ≤
      (-(1630838076988301541033 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35396310645675803 / 80000000000000000 : ℝ) =
            (35396310645675803 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35396310645675803 / 20000000000000000 : ℝ) ≤
            (1141750644211698458967 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1063623706037433 / 2500000000000000 : ℝ)) (q :=
      (35396310645675803 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_555_11 :
    Uω (aρ 11) (bρ 11) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(2368759897097424207653 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (31016604040819147 / 80000000000000000 : ℝ) ≤
      (-(2368759897097424207653 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (31016604040819147 / 80000000000000000 : ℝ) =
            (31016604040819147 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (31016604040819147 / 20000000000000000 : ℝ) ≤
            (1096976004402575792347 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (447255599892571 / 1250000000000000 : ℝ)) (q :=
      (31016604040819147 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_555_12 :
    Uω (aρ 12) (bρ 12) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(5635318388450483959479 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25918654397605731 / 80000000000000000 : ℝ) ≤
      (-(5635318388450483959479 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (25918654397605731 / 80000000000000000 : ℝ) =
            (25918654397605731 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25918654397605731 / 20000000000000000 : ℝ) ≤
            (1296153414549516040521 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1363628742511107 / 5000000000000000 : ℝ)) (q :=
      (25918654397605731 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_555_13 :
    Uω (aρ 13) (bρ 13) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(7036379287111782039099 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19584741662899847 / 80000000000000000 : ℝ) ≤
      (-(7036379287111782039099 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19584741662899847 / 80000000000000000 : ℝ) =
            (19584741662899847 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19584741662899847 / 10000000000000000 : ℝ) ≤
            (3360828417388217960901 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1543161042940743 / 10000000000000000 : ℝ)) (q :=
      (19584741662899847 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_555_14 :
    Uω (aρ 14) (bρ 14) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_555_15 :
    Uω (aρ 15) (bρ 15) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_555_16 :
    Uω (aρ 16) (bρ 16) (40516462999739 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_555 :
    Uρ (40516462999739 / 64000000000000 : ℝ) ≤
      (-(3819205705809023544411 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (40516462999739 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1168547699318994396631 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (40516462999739 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1178106528778261540091 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (40516462999739 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4789333240367326840447 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (40516462999739 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2459184949907346047189 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (40516462999739 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5118080274195688240163 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (40516462999739 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1352881869626692158181 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (40516462999739 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1165206064660802796103 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (40516462999739 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6393597145535780670923 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (40516462999739 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7152820065878755550463 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (40516462999739 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1630838076988301541033 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (40516462999739 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(2368759897097424207653 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (40516462999739 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(5635318388450483959479 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (40516462999739 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(7036379287111782039099 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (40516462999739 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (40516462999739 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (40516462999739 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_555_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
