/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U46) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_556_1 :
    Uω (aρ 1) (bρ 1) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(291065728968855683219 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12553846428466647 / 20000000000000000 : ℝ) ≤
      (-(291065728968855683219 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12553846428466647 / 20000000000000000 : ℝ) =
            (12553846428466647 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12553846428466647 / 10000000000000000 : ℝ) ≤
            (142151258718644316781 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3138448729160511 / 5000000000000000 : ℝ)) (q :=
      (12553846428466647 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_556_2 :
    Uω (aρ 2) (bρ 2) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(2347610491870088450017 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12506020582078109 / 20000000000000000 : ℝ) ≤
      (-(2347610491870088450017 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12506020582078109 / 20000000000000000 : ℝ) =
            (12506020582078109 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12506020582078109 / 10000000000000000 : ℝ) ≤
            (1118125409629911549983 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1563210156110621 / 2500000000000000 : ℝ)) (q :=
      (12506020582078109 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_556_3 :
    Uω (aρ 3) (bρ 3) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(4771994197900481931239 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12410375461387277 / 20000000000000000 : ℝ) ≤
      (-(4771994197900481931239 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12410375461387277 / 20000000000000000 : ℝ) =
            (12410375461387277 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12410375461387277 / 10000000000000000 : ℝ) ≤
            (2159477605099518068761 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1551147902525413 / 2500000000000000 : ℝ)) (q :=
      (12410375461387277 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_556_4 :
    Uω (aρ 4) (bρ 4) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(2450401313667920874891 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12251544498587317 / 20000000000000000 : ℝ) ≤
      (-(2450401313667920874891 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12251544498587317 / 20000000000000000 : ℝ) =
            (12251544498587317 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12251544498587317 / 10000000000000000 : ℝ) ≤
            (1015334587832079125109 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1531013707091673 / 2500000000000000 : ℝ)) (q :=
      (12251544498587317 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_556_5 :
    Uω (aρ 5) (bρ 5) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(1275037682980197292503 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3002432636695933 / 5000000000000000 : ℝ) ≤
      (-(1275037682980197292503 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3002432636695933 / 5000000000000000 : ℝ) =
            (3002432636695933 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3002432636695933 / 2500000000000000 : ℝ) ≤
            (457830267769802707497 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6000430795898107 / 10000000000000000 : ℝ)) (q :=
      (3002432636695933 / 5000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_556_6 :
    Uω (aρ 6) (bρ 6) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(5393044761434235189473 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11663074170404497 / 20000000000000000 : ℝ) ≤
      (-(5393044761434235189473 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11663074170404497 / 20000000000000000 : ℝ) =
            (11663074170404497 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11663074170404497 / 10000000000000000 : ℝ) ≤
            (1538427041565764810527 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (727626849332359 / 1250000000000000 : ℝ)) (q :=
      (11663074170404497 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_556_7 :
    Uω (aρ 7) (bρ 7) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(362920054805424530923 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2238088768184477 / 4000000000000000 : ℝ) ≤
      (-(362920054805424530923 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2238088768184477 / 4000000000000000 : ℝ) =
            (2238088768184477 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2238088768184477 / 2000000000000000 : ℝ) ≤
            (70296932882075469077 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (139301146148419 / 250000000000000 : ℝ)) (q :=
      (2238088768184477 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_556_8 :
    Uω (aρ 8) (bρ 8) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(6373060435506251966543 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (165223388074311 / 312500000000000 : ℝ) ≤
      (-(6373060435506251966543 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (165223388074311 / 312500000000000 : ℝ) =
            (165223388074311 / 156250000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (165223388074311 / 156250000000000 : ℝ) ≤
            (558411367493748033457 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5239440493110279 / 10000000000000000 : ℝ)) (q :=
      (165223388074311 / 312500000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_556_9 :
    Uω (aρ 9) (bρ 9) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(1426088610888638727831 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4901497580180003 / 10000000000000000 : ℝ) ≤
      (-(1426088610888638727831 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4901497580180003 / 10000000000000000 : ℝ) =
            (4901497580180003 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4901497580180003 / 2500000000000000 : ℝ) ≤
            (1346500110311361272169 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4809104445074381 / 10000000000000000 : ℝ)) (q :=
      (4901497580180003 / 10000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_556_10 :
    Uω (aρ 10) (bρ 10) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(508060006594250466711 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4435716160243901 / 10000000000000000 : ℝ) ≤
      (-(508060006594250466711 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4435716160243901 / 10000000000000000 : ℝ) =
            (4435716160243901 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4435716160243901 / 2500000000000000 : ℝ) ≤
            (358373968780749533289 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4266100638697177 / 10000000000000000 : ℝ)) (q :=
      (4435716160243901 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_556_11 :
    Uω (aρ 11) (bρ 11) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(1180631375359092244143 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3888719757142301 / 10000000000000000 : ℝ) ≤
      (-(1180631375359092244143 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3888719757142301 / 10000000000000000 : ℝ) =
            (3888719757142301 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3888719757142301 / 2500000000000000 : ℝ) ≤
            (552236575390907755857 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3590584458698977 / 10000000000000000 : ℝ)) (q :=
      (3888719757142301 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_556_12 :
    Uω (aρ 12) (bρ 12) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(11231330514346018154391 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3252591427872931 / 10000000000000000 : ℝ) ≤
      (-(11231330514346018154391 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3252591427872931 / 10000000000000000 : ℝ) =
            (3252591427872931 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3252591427872931 / 2500000000000000 : ℝ) ≤
            (2631613091653981845609 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2742027896845237 / 10000000000000000 : ℝ)) (q :=
      (3252591427872931 / 10000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_556_13 :
    Uω (aρ 13) (bρ 13) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(14003623676628956738161 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4930152423445567 / 20000000000000000 : ℝ) ≤
      (-(14003623676628956738161 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4930152423445567 / 20000000000000000 : ℝ) =
            (4930152423445567 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4930152423445567 / 2500000000000000 : ℝ) ≤
            (6790791732371043261839 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (783189603069971 / 5000000000000000 : ℝ)) (q :=
      (4930152423445567 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_556_14 :
    Uω (aρ 14) (bρ 14) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_556_15 :
    Uω (aρ 15) (bρ 15) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_556_16 :
    Uω (aρ 16) (bρ 16) (10146313901169 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_556 :
    Uρ (10146313901169 / 16000000000000 : ℝ) ≤
      (-(7616476006420413902031 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10146313901169 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(291065728968855683219 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10146313901169 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2347610491870088450017 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10146313901169 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4771994197900481931239 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10146313901169 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2450401313667920874891 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10146313901169 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1275037682980197292503 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10146313901169 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5393044761434235189473 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10146313901169 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(362920054805424530923 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10146313901169 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6373060435506251966543 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10146313901169 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1426088610888638727831 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10146313901169 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(508060006594250466711 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10146313901169 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1180631375359092244143 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10146313901169 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11231330514346018154391 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10146313901169 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(14003623676628956738161 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10146313901169 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10146313901169 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10146313901169 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_556_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_557_1 :
    Uω (aρ 1) (bρ 1) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(2319970927352704056403 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (50301376822279401 / 80000000000000000 : ℝ) ≤
      (-(2319970927352704056403 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (50301376822279401 / 80000000000000000 : ℝ) =
            (50301376822279401 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (50301376822279401 / 40000000000000000 : ℝ) ≤
            (1145764974147295943597 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6287646390902819 / 10000000000000000 : ℝ)) (q :=
      (50301376822279401 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_557_2 :
    Uω (aρ 2) (bρ 2) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(1169511351196875418163 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (50110075413780381 / 80000000000000000 : ℝ) ≤
      (-(1169511351196875418163 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (50110075413780381 / 80000000000000000 : ℝ) =
            (50110075413780381 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (50110075413780381 / 40000000000000000 : ℝ) ≤
            (563356599553124581837 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6116787159461 / 9765625000000 : ℝ)) (q :=
      (50110075413780381 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_557_3 :
    Uω (aρ 3) (bρ 3) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(4754685173399231974649 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49727500849193261 / 80000000000000000 : ℝ) ≤
      (-(4754685173399231974649 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49727500849193261 / 80000000000000000 : ℝ) =
            (49727500849193261 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49727500849193261 / 40000000000000000 : ℝ) ≤
            (2176786629600768025351 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1553835629122821 / 2500000000000000 : ℝ)) (q :=
      (49727500849193261 / 80000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_557_4 :
    Uω (aρ 4) (bρ 4) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(2441633089450279375213 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (49092192823377549 / 80000000000000000 : ℝ) ≤
      (-(2441633089450279375213 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (49092192823377549 / 80000000000000000 : ℝ) =
            (49092192823377549 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (49092192823377549 / 40000000000000000 : ℝ) ≤
            (1024102812049720624787 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1533702422775589 / 2500000000000000 : ℝ)) (q :=
      (49092192823377549 / 80000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_557_5 :
    Uω (aρ 5) (bρ 5) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(5082253326313264360587 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9624995275807277 / 16000000000000000 : ℝ) ≤
      (-(5082253326313264360587 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9624995275807277 / 16000000000000000 : ℝ) =
            (9624995275807277 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9624995275807277 / 8000000000000000 : ℝ) ≤
            (1849218476686735639413 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1202239099870413 / 2000000000000000 : ℝ)) (q :=
      (9624995275807277 / 16000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_557_6 :
    Uω (aρ 6) (bρ 6) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(5374596265478078590309 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46738442590975717 / 80000000000000000 : ℝ) ≤
      (-(5374596265478078590309 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (46738442590975717 / 80000000000000000 : ℝ) =
            (46738442590975717 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46738442590975717 / 40000000000000000 : ℝ) ≤
            (1556875537521921409691 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2915901213738449 / 5000000000000000 : ℝ)) (q :=
      (46738442590975717 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_557_7 :
    Uω (aρ 7) (bρ 7) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(2893724476532077899517 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8969624618761153 / 16000000000000000 : ℝ) ≤
      (-(2893724476532077899517 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8969624618761153 / 16000000000000000 : ℝ) =
            (8969624618761153 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8969624618761153 / 8000000000000000 : ℝ) ≤
            (572011424967922100483 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (558288393394441 / 1000000000000000 : ℝ)) (q :=
      (8969624618761153 / 16000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_557_8 :
    Uω (aρ 8) (bρ 8) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(6352566579593873370831 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42383959477729581 / 80000000000000000 : ℝ) ≤
      (-(6352566579593873370831 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (42383959477729581 / 80000000000000000 : ℝ) =
            (42383959477729581 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42383959477729581 / 40000000000000000 : ℝ) ≤
            (578905223406126629169 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1312596170316341 / 2500000000000000 : ℝ)) (q :=
      (42383959477729581 / 80000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_557_9 :
    Uω (aρ 9) (bρ 9) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(177702947989476951683 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39299619708350081 / 80000000000000000 : ℝ) ≤
      (-(177702947989476951683 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39299619708350081 / 80000000000000000 : ℝ) =
            (39299619708350081 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39299619708350081 / 20000000000000000 : ℝ) ≤
            (168870642160523048317 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4820265367280489 / 10000000000000000 : ℝ)) (q :=
      (39299619708350081 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_557_10 :
    Uω (aρ 10) (bρ 10) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(253243698688492737057 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7115026000924909 / 16000000000000000 : ℝ) ≤
      (-(253243698688492737057 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7115026000924909 / 16000000000000000 : ℝ) =
            (7115026000924909 / 4000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7115026000924909 / 4000000000000000 : ℝ) ≤
            (179973288999007262943 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (855540394968821 / 2000000000000000 : ℝ)) (q :=
      (7115026000924909 / 16000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_557_11 :
    Uω (aρ 11) (bρ 11) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(9415166918186793190237 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (31202865774225213 / 80000000000000000 : ℝ) ≤
      (-(9415166918186793190237 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (31202865774225213 / 80000000000000000 : ℝ) =
            (31202865774225213 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (31202865774225213 / 20000000000000000 : ℝ) ≤
            (4447776687813206809763 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (450389067931159 / 1250000000000000 : ℝ)) (q :=
      (31202865774225213 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_557_12 :
    Uω (aρ 12) (bρ 12) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(11192235148967130137221 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26122659539245121 / 80000000000000000 : ℝ) ≤
      (-(11192235148967130137221 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (26122659539245121 / 80000000000000000 : ℝ) =
            (26122659539245121 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26122659539245121 / 20000000000000000 : ℝ) ≤
            (2670708457032869862779 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2756761081389249 / 10000000000000000 : ℝ)) (q :=
      (26122659539245121 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_557_13 :
    Uω (aρ 13) (bρ 13) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(6967750135136901165281 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19855411842309173 / 80000000000000000 : ℝ) ≤
      (-(6967750135136901165281 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (19855411842309173 / 80000000000000000 : ℝ) =
            (19855411842309173 / 10000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19855411842309173 / 10000000000000000 : ℝ) ≤
            (3429457569363098834719 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (794665449375131 / 5000000000000000 : ℝ)) (q :=
      (19855411842309173 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_557_14 :
    Uω (aρ 14) (bρ 14) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_557_15 :
    Uω (aρ 15) (bρ 15) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_557_16 :
    Uω (aρ 16) (bρ 16) (40654048209613 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_557 :
    Uρ (40654048209613 / 64000000000000 : ℝ) ≤
      (-(7594649789318552314463 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (40654048209613 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2319970927352704056403 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (40654048209613 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1169511351196875418163 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (40654048209613 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4754685173399231974649 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (40654048209613 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(2441633089450279375213 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (40654048209613 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5082253326313264360587 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (40654048209613 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5374596265478078590309 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (40654048209613 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2893724476532077899517 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (40654048209613 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6352566579593873370831 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (40654048209613 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(177702947989476951683 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (40654048209613 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(253243698688492737057 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (40654048209613 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9415166918186793190237 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (40654048209613 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11192235148967130137221 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (40654048209613 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(6967750135136901165281 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (40654048209613 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (40654048209613 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (40654048209613 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_557_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_558_1 :
    Uω (aρ 1) (bρ 1) (814456816291 / 1280000000000 : ℝ) ≤
      (-(4622861270707890117367 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25193683964744969 / 40000000000000000 : ℝ) ≤
      (-(4622861270707890117367 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25193683964744969 / 40000000000000000 : ℝ) =
            (25193683964744969 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25193683964744969 / 20000000000000000 : ℝ) ≤
            (2308610532292109882633 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6298395323184047 / 10000000000000000 : ℝ)) (q :=
      (25193683964744969 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_558_2 :
    Uω (aρ 2) (bρ 2) (814456816291 / 1280000000000 : ℝ) ≤
      (-(4660899276902082966911 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25098034245633637 / 40000000000000000 : ℝ) ≤
      (-(4660899276902082966911 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25098034245633637 / 40000000000000000 : ℝ) =
            (25098034245633637 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25098034245633637 / 20000000000000000 : ℝ) ≤
            (2270572526097917033089 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6274339476138381 / 10000000000000000 : ℝ)) (q :=
      (25098034245633637 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_558_3 :
    Uω (aρ 3) (bρ 3) (814456816291 / 1280000000000 : ℝ) ≤
      (-(4737406063087016598307 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24906749912178749 / 40000000000000000 : ℝ) ≤
      (-(4737406063087016598307 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24906749912178749 / 40000000000000000 : ℝ) =
            (24906749912178749 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24906749912178749 / 20000000000000000 : ℝ) ≤
            (2194065739912983401693 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6226093415760937 / 10000000000000000 : ℝ)) (q :=
      (24906749912178749 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_558_4 :
    Uω (aρ 4) (bρ 4) (814456816291 / 1280000000000 : ℝ) ≤
      (-(4865760446468570302513 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4917820756817343 / 8000000000000000 : ℝ) ≤
      (-(4865760446468570302513 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4917820756817343 / 8000000000000000 : ℝ) =
            (4917820756817343 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4917820756817343 / 4000000000000000 : ℝ) ≤
            (2065711356531429697487 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (76819556659749 / 125000000000000 : ℝ)) (q :=
      (4917820756817343 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_558_5 :
    Uω (aρ 5) (bρ 5) (814456816291 / 1280000000000 : ℝ) ≤
      (-(2532193971103932224791 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24105515172156347 / 40000000000000000 : ℝ) ≤
      (-(2532193971103932224791 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24105515172156347 / 40000000000000000 : ℝ) =
            (24105515172156347 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24105515172156347 / 20000000000000000 : ℝ) ≤
            (933541930396067775209 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (752745018268717 / 1250000000000000 : ℝ)) (q :=
      (24105515172156347 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_558_6 :
    Uω (aρ 6) (bρ 6) (814456816291 / 1280000000000 : ℝ) ≤
      (-(1339045465924501048353 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23412293964210231 / 40000000000000000 : ℝ) ≤
      (-(1339045465924501048353 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23412293964210231 / 40000000000000000 : ℝ) =
            (23412293964210231 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23412293964210231 / 20000000000000000 : ℝ) ≤
            (393822484825498951647 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2921294958658339 / 5000000000000000 : ℝ)) (q :=
      (23412293964210231 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_558_7 :
    Uω (aρ 7) (bρ 7) (814456816291 / 1280000000000 : ℝ) ≤
      (-(2884107202550171195271 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22467234723155521 / 40000000000000000 : ℝ) ≤
      (-(2884107202550171195271 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22467234723155521 / 40000000000000000 : ℝ) =
            (22467234723155521 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22467234723155521 / 20000000000000000 : ℝ) ≤
            (581628698949828804729 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5593721677549323 / 10000000000000000 : ℝ)) (q :=
      (22467234723155521 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_558_8 :
    Uω (aρ 8) (bρ 8) (814456816291 / 1280000000000 : ℝ) ≤
      (-(633211539617910829051 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21235364193371443 / 40000000000000000 : ℝ) ≤
      (-(633211539617910829051 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21235364193371443 / 40000000000000000 : ℝ) =
            (21235364193371443 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21235364193371443 / 20000000000000000 : ℝ) ≤
            (59935640682089170949 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1315332015999321 / 2500000000000000 : ℝ)) (q :=
      (21235364193371443 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_558_9 :
    Uω (aρ 9) (bρ 9) (814456816291 / 1280000000000 : ℝ) ≤
      (-(3542922206328462858359 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19693625650212941 / 40000000000000000 : ℝ) ≤
      (-(3542922206328462858359 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19693625650212941 / 40000000000000000 : ℝ) =
            (19693625650212941 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19693625650212941 / 10000000000000000 : ℝ) ≤
            (3388549596671537141641 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4831424420778033 / 10000000000000000 : ℝ)) (q :=
      (19693625650212941 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_558_10 :
    Uω (aρ 10) (bρ 10) (814456816291 / 1280000000000 : ℝ) ≤
      (-(1009838093136397352783 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17832256479524721 / 40000000000000000 : ℝ) ≤
      (-(1009838093136397352783 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17832256479524721 / 40000000000000000 : ℝ) =
            (17832256479524721 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17832256479524721 / 10000000000000000 : ℝ) ≤
            (723029857613602647217 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4289298868928923 / 10000000000000000 : ℝ)) (q :=
      (17832256479524721 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_558_11 :
    Uω (aρ 11) (bρ 11) (814456816291 / 1280000000000 : ℝ) ≤
      (-(9385386513549517948139 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15647963836678691 / 40000000000000000 : ℝ) ≤
      (-(9385386513549517948139 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15647963836678691 / 40000000000000000 : ℝ) =
            (15647963836678691 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15647963836678691 / 10000000000000000 : ℝ) ≤
            (4477557092450482051861 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (903907293427727 / 2500000000000000 : ℝ)) (q :=
      (15647963836678691 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_558_12 :
    Uω (aρ 12) (bρ 12) (814456816291 / 1280000000000 : ℝ) ≤
      (-(11153347910153076889553 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (104897764484849 / 320000000000000 : ℝ) ≤
      (-(11153347910153076889553 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (104897764484849 / 320000000000000 : ℝ) = (104897764484849 / 80000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (104897764484849 / 80000000000000 : ℝ) ≤
            (2709595695846923110447 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (22171661058877 / 80000000000000 : ℝ)) (q :=
      (104897764484849 / 320000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12]) (by norm_num [bρ_12])
      (by norm_num) (by norm_num [aρ_12, bρ_12]) (by norm_num [aρ_12, bρ_12]) hlg

lemma U_558_13 :
    Uω (aρ 13) (bρ 13) (814456816291 / 1280000000000 : ℝ) ≤
      (-(13868348245627295984087 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9994596818018049 / 40000000000000000 : ℝ) ≤
      (-(13868348245627295984087 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9994596818018049 / 40000000000000000 : ℝ) =
            (9994596818018049 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9994596818018049 / 5000000000000000 : ℝ) ≤
            (6926067163372704015913 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1612027502660587 / 10000000000000000 : ℝ)) (q :=
      (9994596818018049 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_558_14 :
    Uω (aρ 14) (bρ 14) (814456816291 / 1280000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_558_15 :
    Uω (aρ 15) (bρ 15) (814456816291 / 1280000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_558_16 :
    Uω (aρ 16) (bρ 16) (814456816291 / 1280000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_558 :
    Uρ (814456816291 / 1280000000000 : ℝ) ≤
      (-(1893232505862725806829 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (814456816291 / 1280000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4622861270707890117367 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (814456816291 / 1280000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4660899276902082966911 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (814456816291 / 1280000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4737406063087016598307 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (814456816291 / 1280000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4865760446468570302513 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (814456816291 / 1280000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(2532193971103932224791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (814456816291 / 1280000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1339045465924501048353 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (814456816291 / 1280000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2884107202550171195271 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (814456816291 / 1280000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(633211539617910829051 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (814456816291 / 1280000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3542922206328462858359 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (814456816291 / 1280000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1009838093136397352783 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (814456816291 / 1280000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9385386513549517948139 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (814456816291 / 1280000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11153347910153076889553 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (814456816291 / 1280000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(13868348245627295984087 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (814456816291 / 1280000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (814456816291 / 1280000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (814456816291 / 1280000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_558_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_559_1 :
    Uω (aρ 1) (bρ 1) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(2302904905921185912749 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (50473359035504343 / 80000000000000000 : ℝ) ≤
      (-(2302904905921185912749 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (50473359035504343 / 80000000000000000 : ℝ) =
            (50473359035504343 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (50473359035504343 / 40000000000000000 : ℝ) ≤
            (1162830995578814087251 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3154572127583121 / 5000000000000000 : ℝ)) (q :=
      (50473359035504343 / 80000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_559_2 :
    Uω (aρ 2) (bρ 2) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(580472812406440178227 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (50282061560814059 / 80000000000000000 : ℝ) ≤
      (-(580472812406440178227 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (50282061560814059 / 80000000000000000 : ℝ) =
            (50282061560814059 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (50282061560814059 / 40000000000000000 : ℝ) ≤
            (285961162968559821773 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6285088899003671 / 10000000000000000 : ℝ)) (q :=
      (50282061560814059 / 80000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_559_3 :
    Uω (aρ 3) (bρ 3) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(472015676372460509977 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9979899754237819 / 16000000000000000 : ℝ) ≤
      (-(472015676372460509977 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9979899754237819 / 16000000000000000 : ℝ) =
            (9979899754237819 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9979899754237819 / 8000000000000000 : ℝ) ≤
            (221131503927539490023 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (623684430794743 / 1000000000000000 : ℝ)) (q :=
      (9979899754237819 / 16000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_559_4 :
    Uω (aρ 4) (bρ 4) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(151508916330217477677 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9852844445835671 / 16000000000000000 : ℝ) ≤
      (-(151508916330217477677 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (9852844445835671 / 16000000000000000 : ℝ) =
            (9852844445835671 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9852844445835671 / 8000000000000000 : ℝ) ≤
            (65099577513532522323 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1231263870701949 / 2000000000000000 : ℝ)) (q :=
      (9852844445835671 / 16000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_559_5 :
    Uω (aρ 5) (bρ 5) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(5046554465058193984063 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (48297084084177007 / 80000000000000000 : ℝ) ≤
      (-(5046554465058193984063 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (48297084084177007 / 80000000000000000 : ℝ) =
            (48297084084177007 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (48297084084177007 / 40000000000000000 : ℝ) ≤
            (1884917337941806015937 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (754090592074301 / 1250000000000000 : ℝ)) (q :=
      (48297084084177007 / 80000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_559_6 :
    Uω (aρ 6) (bρ 6) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(533780142986120744697 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (46910732697114243 / 80000000000000000 : ℝ) ≤
      (-(533780142986120744697 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (46910732697114243 / 80000000000000000 : ℝ) =
            (46910732697114243 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (46910732697114243 / 40000000000000000 : ℝ) ≤
            (159367037313879255303 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5853377264968717 / 10000000000000000 : ℝ)) (q :=
      (46910732697114243 / 80000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_559_7 :
    Uω (aρ 7) (bρ 7) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(5749017087125469562931 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (45020814429197179 / 80000000000000000 : ℝ) ≤
      (-(5749017087125469562931 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (45020814429197179 / 80000000000000000 : ℝ) =
            (45020814429197179 / 40000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (45020814429197179 / 40000000000000000 : ℝ) ≤
            (1182454715874530437069 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5604559078749451 / 10000000000000000 : ℝ)) (q :=
      (45020814429197179 / 80000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_559_8 :
    Uω (aρ 8) (bρ 8) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(631170670481372951783 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8511498818824967 / 16000000000000000 : ℝ) ≤
      (-(631170670481372951783 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (8511498818824967 / 16000000000000000 : ℝ) =
            (8511498818824967 / 8000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8511498818824967 / 8000000000000000 : ℝ) ≤
            (61976509818627048217 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1054454129264273 / 2000000000000000 : ℝ)) (q :=
      (8511498818824967 / 16000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_559_9 :
    Uω (aρ 9) (bρ 9) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(353181114344393088867 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (39474875469341551 / 80000000000000000 : ℝ) ≤
      (-(353181114344393088867 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (39474875469341551 / 80000000000000000 : ℝ) =
            (39474875469341551 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (39474875469341551 / 20000000000000000 : ℝ) ≤
            (339966065955606911133 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (605322702310693 / 1250000000000000 : ℝ)) (q :=
      (39474875469341551 / 80000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_559_10 :
    Uω (aρ 10) (bρ 10) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(402683943645360927051 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (35753878288956451 / 80000000000000000 : ℝ) ≤
      (-(402683943645360927051 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (35753878288956451 / 80000000000000000 : ℝ) =
            (35753878288956451 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (35753878288956451 / 20000000000000000 : ℝ) ≤
            (290463236654639072949 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4300891356884269 / 10000000000000000 : ℝ)) (q :=
      (35753878288956451 / 80000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_559_11 :
    Uω (aρ 11) (bρ 11) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(146182952791553937827 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (31388944228734327 / 80000000000000000 : ℝ) ≤
      (-(146182952791553937827 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (31388944228734327 / 80000000000000000 : ℝ) =
            (31388944228734327 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (31388944228734327 / 20000000000000000 : ℝ) ≤
            (70425541052196062173 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1814067234016869 / 5000000000000000 : ℝ)) (q :=
      (31388944228734327 / 80000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_559_12 :
    Uω (aρ 12) (bρ 12) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(11114666087772948681293 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26326078487755239 / 80000000000000000 : ℝ) ≤
      (-(11114666087772948681293 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (26326078487755239 / 80000000000000000 : ℝ) =
            (26326078487755239 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26326078487755239 / 20000000000000000 : ℝ) ≤
            (2748277518227051318707 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1393059064736983 / 5000000000000000 : ℝ)) (q :=
      (26326078487755239 / 80000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_559_13 :
    Uω (aρ 13) (bρ 13) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(13802130104783206082597 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20121997581452683 / 80000000000000000 : ℝ) ≤
      (-(13802130104783206082597 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (20121997581452683 / 80000000000000000 : ℝ) =
            (20121997581452683 / 20000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20121997581452683 / 20000000000000000 : ℝ) ≤
            (60813501216793917403 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1634479644493327 / 10000000000000000 : ℝ)) (q :=
      (20121997581452683 / 80000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_559_14 :
    Uω (aρ 14) (bρ 14) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_559_15 :
    Uω (aρ 15) (bρ 15) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_559_16 :
    Uω (aρ 16) (bρ 16) (40791633419487 / 64000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_559 :
    Uρ (40791633419487 / 64000000000000 : ℝ) ≤
      (-(3775657065764696745661 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (40791633419487 / 64000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2302904905921185912749 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (40791633419487 / 64000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(580472812406440178227 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (40791633419487 / 64000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(472015676372460509977 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (40791633419487 / 64000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(151508916330217477677 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (40791633419487 / 64000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(5046554465058193984063 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (40791633419487 / 64000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(533780142986120744697 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (40791633419487 / 64000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5749017087125469562931 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (40791633419487 / 64000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(631170670481372951783 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (40791633419487 / 64000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(353181114344393088867 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (40791633419487 / 64000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(402683943645360927051 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (40791633419487 / 64000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(146182952791553937827 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (40791633419487 / 64000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(11114666087772948681293 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (40791633419487 / 64000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(13802130104783206082597 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (40791633419487 / 64000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (40791633419487 / 64000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (40791633419487 / 64000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_559_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_560_1 :
    Uω (aρ 1) (bρ 1) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(2294393689475535923337 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (631991876754109 / 1000000000000000 : ℝ) ≤
      (-(2294393689475535923337 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (631991876754109 / 1000000000000000 : ℝ) =
            (631991876754109 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (631991876754109 / 500000000000000 : ℝ) ≤
            (1171342212024464076663 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (631989318685093 / 1000000000000000 : ℝ)) (q :=
      (631991876754109 / 1000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_560_2 :
    Uω (aρ 2) (bρ 2) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(4626694971520392917771 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1574001706951919 / 2500000000000000 : ℝ) ≤
      (-(4626694971520392917771 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1574001706951919 / 2500000000000000 : ℝ) =
            (1574001706951919 / 1250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1574001706951919 / 1250000000000000 : ℝ) ≤
            (2304776831479607082229 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3147919159947051 / 5000000000000000 : ℝ)) (q :=
      (1574001706951919 / 2500000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_560_3 :
    Uω (aρ 3) (bρ 3) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(940587434521278228623 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12496374422458581 / 20000000000000000 : ℝ) ≤
      (-(940587434521278228623 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12496374422458581 / 20000000000000000 : ℝ) =
            (12496374422458581 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12496374422458581 / 10000000000000000 : ℝ) ≤
            (445706926078721771377 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6247595193087331 / 10000000000000000 : ℝ)) (q :=
      (12496374422458581 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_560_4 :
    Uω (aρ 4) (bρ 4) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(1207710175071547666761 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3084389800426919 / 5000000000000000 : ℝ) ≤
      (-(1207710175071547666761 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3084389800426919 / 5000000000000000 : ℝ) =
            (3084389800426919 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3084389800426919 / 2500000000000000 : ℝ) ≤
            (525157775678452333239 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3083537076700713 / 5000000000000000 : ℝ)) (q :=
      (3084389800426919 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_560_5 :
    Uω (aρ 5) (bρ 5) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(251437639046613927597 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1511973049994807 / 2500000000000000 : ℝ) ≤
      (-(251437639046613927597 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1511973049994807 / 2500000000000000 : ℝ) =
            (1511973049994807 / 1250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1511973049994807 / 1250000000000000 : ℝ) ≤
            (95135951103386072403 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3021744635493603 / 5000000000000000 : ℝ)) (q :=
      (1511973049994807 / 2500000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_560_6 :
    Uω (aρ 6) (bρ 6) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(5319454838437104841271 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2349843845009789 / 4000000000000000 : ℝ) ≤
      (-(5319454838437104841271 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2349843845009789 / 4000000000000000 : ℝ) =
            (2349843845009789 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2349843845009789 / 2000000000000000 : ℝ) ≤
            (1612016964562895158729 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1172832894243539 / 2000000000000000 : ℝ)) (q :=
      (2349843845009789 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_560_7 :
    Uω (aρ 7) (bρ 7) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(2864928427064339415983 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (704799344537407 / 1250000000000000 : ℝ) ≤
      (-(2864928427064339415983 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (704799344537407 / 1250000000000000 : ℝ) =
            (704799344537407 / 625000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (704799344537407 / 625000000000000 : ℝ) ≤
            (600807474435660584017 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2807698069763631 / 5000000000000000 : ℝ)) (q :=
      (704799344537407 / 1250000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_560_8 :
    Uω (aρ 8) (bρ 8) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(6291340326210612036741 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2665266038735567 / 5000000000000000 : ℝ) ≤
      (-(6291340326210612036741 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2665266038735567 / 5000000000000000 : ℝ) =
            (2665266038735567 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2665266038735567 / 2500000000000000 : ℝ) ≤
            (640131476789387963259 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2641606216605509 / 5000000000000000 : ℝ)) (q :=
      (2665266038735567 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_560_9 :
    Uω (aρ 9) (bρ 9) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(7041451297304985064883 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (618163941660743 / 1250000000000000 : ℝ) ≤
      (-(7041451297304985064883 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (618163941660743 / 1250000000000000 : ℝ) =
            (618163941660743 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (618163941660743 / 312500000000000 : ℝ) ≤
            (6821492308695014935117 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2426868486600319 / 5000000000000000 : ℝ)) (q :=
      (618163941660743 / 1250000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_560_10 :
    Uω (aρ 10) (bρ 10) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(4014360175648586768127 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8960806534119087 / 20000000000000000 : ℝ) ≤
      (-(4014360175648586768127 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8960806534119087 / 20000000000000000 : ℝ) =
            (8960806534119087 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8960806534119087 / 5000000000000000 : ℝ) ≤
            (2917111627351413231873 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4312479474242837 / 10000000000000000 : ℝ)) (q :=
      (8960806534119087 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_560_11 :
    Uω (aρ 11) (bρ 11) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(932613351350855815937 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7870478976903391 / 20000000000000000 : ℝ) ≤
      (-(932613351350855815937 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7870478976903391 / 20000000000000000 : ℝ) =
            (7870478976903391 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7870478976903391 / 5000000000000000 : ℝ) ≤
            (453681009249144184063 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3640628543232141 / 10000000000000000 : ℝ)) (q :=
      (7870478976903391 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_560_12 :
    Uω (aρ 12) (bρ 12) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(2769046757582107150309 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3303446737945291 / 10000000000000000 : ℝ) ≤
      (-(2769046757582107150309 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3303446737945291 / 10000000000000000 : ℝ) =
            (3303446737945291 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3303446737945291 / 2500000000000000 : ℝ) ≤
            (696689143917892849691 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (700185784726083 / 2500000000000000 : ℝ)) (q :=
      (3303446737945291 / 10000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_560_13 :
    Uω (aρ 13) (bρ 13) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(13736810718800869438119 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5063465858776757 / 20000000000000000 : ℝ) ≤
      (-(13736810718800869438119 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5063465858776757 / 20000000000000000 : ℝ) =
            (5063465858776757 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5063465858776757 / 5000000000000000 : ℝ) ≤
            (126132887199130561881 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1656697263385507 / 10000000000000000 : ℝ)) (q :=
      (5063465858776757 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_560_14 :
    Uω (aρ 14) (bρ 14) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_560_15 :
    Uω (aρ 15) (bρ 15) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_560_16 :
    Uω (aρ 16) (bρ 16) (5107553253053 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_560 :
    Uρ (5107553253053 / 8000000000000 : ℝ) ≤
      (-(1505959936281701094027 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5107553253053 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2294393689475535923337 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5107553253053 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4626694971520392917771 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5107553253053 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(940587434521278228623 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5107553253053 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1207710175071547666761 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5107553253053 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(251437639046613927597 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5107553253053 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5319454838437104841271 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5107553253053 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2864928427064339415983 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5107553253053 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6291340326210612036741 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5107553253053 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(7041451297304985064883 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5107553253053 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(4014360175648586768127 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5107553253053 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(932613351350855815937 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5107553253053 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(2769046757582107150309 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5107553253053 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(13736810718800869438119 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5107553253053 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5107553253053 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5107553253053 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_560_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_561_1 :
    Uω (aρ 1) (bρ 1) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(2277414598492095836739 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25365666173215799 / 40000000000000000 : ℝ) ≤
      (-(2277414598492095836739 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25365666173215799 / 40000000000000000 : ℝ) =
            (25365666173215799 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25365666173215799 / 20000000000000000 : ℝ) ≤
            (1188321303007904163261 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6341391049333837 / 10000000000000000 : ℝ)) (q :=
      (25365666173215799 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_561_2 :
    Uω (aρ 2) (bρ 2) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(4592607267118482431659 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25270020361109551 / 40000000000000000 : ℝ) ≤
      (-(4592607267118482431659 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25270020361109551 / 40000000000000000 : ℝ) =
            (25270020361109551 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25270020361109551 / 20000000000000000 : ℝ) ≤
            (2338864535881517568341 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6317337155790713 / 10000000000000000 : ℝ)) (q :=
      (25270020361109551 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_561_3 :
    Uω (aρ 3) (bρ 3) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(4668586706926270342089 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25078747721572853 / 40000000000000000 : ℝ) ≤
      (-(4668586706926270342089 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25078747721572853 / 40000000000000000 : ℝ) =
            (25078747721572853 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25078747721572853 / 20000000000000000 : ℝ) ≤
            (2262885096073729657911 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1567274235593091 / 2500000000000000 : ℝ)) (q :=
      (25078747721572853 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_561_4 :
    Uω (aρ 4) (bρ 4) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(479604253574241296943 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24761132856907953 / 40000000000000000 : ℝ) ≤
      (-(479604253574241296943 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24761132856907953 / 40000000000000000 : ℝ) =
            (24761132856907953 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24761132856907953 / 20000000000000000 : ℝ) ≤
            (213542926725758703057 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3094291845552457 / 5000000000000000 : ℝ)) (q :=
      (24761132856907953 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_561_5 :
    Uω (aρ 5) (bρ 5) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(4993244339069595102151 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4855524396330021 / 8000000000000000 : ℝ) ≤
      (-(4993244339069595102151 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4855524396330021 / 8000000000000000 : ℝ) =
            (4855524396330021 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4855524396330021 / 4000000000000000 : ℝ) ≤
            (1938227463930404897849 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (606501817281099 / 1000000000000000 : ℝ)) (q :=
      (4855524396330021 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_561_6 :
    Uω (aρ 6) (bρ 6) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(5282862684184516705617 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23584581810980857 / 40000000000000000 : ℝ) ≤
      (-(5282862684184516705617 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23584581810980857 / 40000000000000000 : ℝ) =
            (23584581810980857 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23584581810980857 / 20000000000000000 : ℝ) ≤
            (1648609118815483294383 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2942869231308183 / 5000000000000000 : ℝ)) (q :=
      (23584581810980857 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_561_7 :
    Uω (aρ 7) (bρ 7) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(1138329413456083984391 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22639920619566651 / 40000000000000000 : ℝ) ≤
      (-(1138329413456083984391 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22639920619566651 / 40000000000000000 : ℝ) =
            (22639920619566651 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22639920619566651 / 20000000000000000 : ℝ) ≤
            (247964947143916015609 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5637069247669263 / 10000000000000000 : ℝ)) (q :=
      (22639920619566651 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_561_8 :
    Uω (aρ 8) (bρ 8) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(6250733795887733386939 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21408886102295611 / 40000000000000000 : ℝ) ≤
      (-(6250733795887733386939 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21408886102295611 / 40000000000000000 : ℝ) =
            (21408886102295611 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21408886102295611 / 20000000000000000 : ℝ) ≤
            (680738007112266613061 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5305093640373743 / 10000000000000000 : ℝ)) (q :=
      (21408886102295611 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_561_9 :
    Uω (aρ 9) (bρ 9) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(3498630877915021785957 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3973770394664829 / 8000000000000000 : ℝ) ≤
      (-(3498630877915021785957 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3973770394664829 / 8000000000000000 : ℝ) =
            (3973770394664829 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3973770394664829 / 2000000000000000 : ℝ) ≤
            (3432840925084978214043 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (487604220424801 / 1000000000000000 : ℝ)) (q :=
      (3973770394664829 / 8000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_561_10 :
    Uω (aρ 10) (bρ 10) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(3989501908388574488219 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18010934972507951 / 40000000000000000 : ℝ) ≤
      (-(3989501908388574488219 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (18010934972507951 / 40000000000000000 : ℝ) =
            (18010934972507951 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18010934972507951 / 10000000000000000 : ℝ) ≤
            (2941969894611425511781 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4335642737334913 / 10000000000000000 : ℝ)) (q :=
      (18010934972507951 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_561_11 :
    Uω (aρ 11) (bρ 11) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(4633642821382275522129 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15833863235497879 / 40000000000000000 : ℝ) ≤
      (-(4633642821382275522129 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15833863235497879 / 40000000000000000 : ℝ) =
            (15833863235497879 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15833863235497879 / 10000000000000000 : ℝ) ≤
            (2297828981617724477871 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3665583495034877 / 10000000000000000 : ℝ)) (q :=
      (15833863235497879 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_561_12 :
    Uω (aρ 12) (bρ 12) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(10999826886831738863463 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2663014768093521 / 8000000000000000 : ℝ) ≤
      (-(10999826886831738863463 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2663014768093521 / 8000000000000000 : ℝ) =
            (2663014768093521 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2663014768093521 / 2000000000000000 : ℝ) ≤
            (2863116719168261136537 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (141494444710237 / 500000000000000 : ℝ)) (q :=
      (2663014768093521 / 8000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_561_13 :
    Uω (aρ 13) (bρ 13) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(1701092299087291908943 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10257463780728953 / 40000000000000000 : ℝ) ≤
      (-(1701092299087291908943 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10257463780728953 / 40000000000000000 : ℝ) =
            (10257463780728953 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10257463780728953 / 10000000000000000 : ℝ) ≤
            (31775651662708091057 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (850232802965207 / 5000000000000000 : ℝ)) (q :=
      (10257463780728953 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_561_14 :
    Uω (aρ 14) (bρ 14) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_561_15 :
    Uω (aρ 15) (bρ 15) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_561_16 :
    Uω (aρ 16) (bρ 16) (20499005617149 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_561 :
    Uρ (20499005617149 / 32000000000000 : ℝ) ≤
      (-(1497413207056877704401 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20499005617149 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2277414598492095836739 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20499005617149 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4592607267118482431659 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20499005617149 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4668586706926270342089 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20499005617149 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(479604253574241296943 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20499005617149 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4993244339069595102151 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20499005617149 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5282862684184516705617 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20499005617149 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1138329413456083984391 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20499005617149 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6250733795887733386939 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20499005617149 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3498630877915021785957 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20499005617149 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3989501908388574488219 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20499005617149 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(4633642821382275522129 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20499005617149 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(10999826886831738863463 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20499005617149 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(1701092299087291908943 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20499005617149 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (20499005617149 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20499005617149 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_561_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_562_1 :
    Uω (aρ 1) (bρ 1) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(565123242699242190631 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6362914318480821 / 10000000000000000 : ℝ) ≤
      (-(565123242699242190631 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6362914318480821 / 10000000000000000 : ℝ) =
            (6362914318480821 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6362914318480821 / 5000000000000000 : ℝ) ≤
            (301310732675757809369 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6362888910644767 / 10000000000000000 : ℝ)) (q :=
      (6362914318480821 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_562_2 :
    Uω (aρ 2) (bρ 2) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(227931768568958541353 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12678006697715053 / 20000000000000000 : ℝ) ≤
      (-(227931768568958541353 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12678006697715053 / 20000000000000000 : ℝ) =
            (12678006697715053 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12678006697715053 / 10000000000000000 : ℝ) ≤
            (118641821581041458647 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3169417991954089 / 5000000000000000 : ℝ)) (q :=
      (12678006697715053 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_562_3 :
    Uω (aρ 3) (bρ 3) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(4634353854935592034951 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12582373271360453 / 20000000000000000 : ℝ) ≤
      (-(4634353854935592034951 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12582373271360453 / 20000000000000000 : ℝ) =
            (12582373271360453 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12582373271360453 / 10000000000000000 : ℝ) ≤
            (2297117948064407965049 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3145299331951789 / 5000000000000000 : ℝ)) (q :=
      (12582373271360453 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_562_4 :
    Uω (aρ 4) (bρ 4) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(74396329823126201829 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12423573573143853 / 20000000000000000 : ℝ) ≤
      (-(74396329823126201829 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12423573573143853 / 20000000000000000 : ℝ) =
            (12423573573143853 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12423573573143853 / 10000000000000000 : ℝ) ≤
            (33907917098748798171 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3105046573375989 / 5000000000000000 : ℝ)) (q :=
      (12423573573143853 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_562_5 :
    Uω (aρ 5) (bρ 5) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(4957861717286478519223 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12181837361044447 / 20000000000000000 : ℝ) ≤
      (-(4957861717286478519223 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12181837361044447 / 20000000000000000 : ℝ) =
            (12181837361044447 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12181837361044447 / 10000000000000000 : ℝ) ≤
            (1973610085713521480777 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1521636713496893 / 2500000000000000 : ℝ)) (q :=
      (12181837361044447 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_562_6 :
    Uω (aρ 6) (bρ 6) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(5246404410543003654287 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11835362029592483 / 20000000000000000 : ℝ) ≤
      (-(5246404410543003654287 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11835362029592483 / 20000000000000000 : ℝ) =
            (11835362029592483 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11835362029592483 / 10000000000000000 : ℝ) ≤
            (1685067392456996345713 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (738413987209451 / 1250000000000000 : ℝ)) (q :=
      (11835362029592483 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_562_7 :
    Uω (aρ 7) (bρ 7) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(282679195069658106583 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11363129768687869 / 20000000000000000 : ℝ) ≤
      (-(282679195069658106583 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11363129768687869 / 20000000000000000 : ℝ) =
            (11363129768687869 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11363129768687869 / 10000000000000000 : ℝ) ≤
            (63894395080341893417 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2829370508765497 / 5000000000000000 : ℝ)) (q :=
      (11363129768687869 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_562_8 :
    Uω (aρ 8) (bρ 8) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(621029439375479713257 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10747818824267901 / 20000000000000000 : ℝ) ≤
      (-(621029439375479713257 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10747818824267901 / 20000000000000000 : ℝ) =
            (10747818824267901 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10747818824267901 / 10000000000000000 : ℝ) ≤
            (72117740924520286743 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2663485862225513 / 5000000000000000 : ℝ)) (q :=
      (10747818824267901 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_562_9 :
    Uω (aρ 9) (bρ 9) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(6953273864243853381139 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9978221685393537 / 20000000000000000 : ℝ) ≤
      (-(6953273864243853381139 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9978221685393537 / 20000000000000000 : ℝ) =
            (9978221685393537 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 15
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9978221685393537 / 5000000000000000 : ℝ) ≤
            (6909669741756146618861 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2449170106968331 / 5000000000000000 : ℝ)) (q :=
      (9978221685393537 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_562_10 :
    Uω (aρ 10) (bρ 10) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(7929552090284195248573 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4525055686322299 / 10000000000000000 : ℝ) ≤
      (-(7929552090284195248573 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4525055686322299 / 10000000000000000 : ℝ) =
            (4525055686322299 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4525055686322299 / 2500000000000000 : ℝ) ≤
            (5933391515715804751427 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4358788934682723 / 10000000000000000 : ℝ)) (q :=
      (4525055686322299 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_562_11 :
    Uω (aρ 11) (bρ 11) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(92088367002658787047 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3981670370963811 / 10000000000000000 : ℝ) ≤
      (-(92088367002658787047 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3981670370963811 / 10000000000000000 : ℝ) =
            (3981670370963811 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3981670370963811 / 2500000000000000 : ℝ) ≤
            (46541069057341212953 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3690494930170747 / 10000000000000000 : ℝ)) (q :=
      (3981670370963811 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_562_12 :
    Uω (aρ 12) (bρ 12) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(5462123687277067907423 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (167701122188047 / 500000000000000 : ℝ) ≤
      (-(5462123687277067907423 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (167701122188047 / 500000000000000 : ℝ) =
            (167701122188047 / 125000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (167701122188047 / 125000000000000 : ℝ) ≤
            (1469348115722932092577 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (571779834490001 / 2000000000000000 : ℝ)) (q :=
      (167701122188047 / 500000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12]) (by norm_num [bρ_12])
      (by norm_num) (by norm_num [aρ_12, bρ_12]) (by norm_num [aρ_12, bρ_12]) hlg

lemma U_562_13 :
    Uω (aρ 13) (bρ 13) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(13483890514746875546159 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5193164395830821 / 20000000000000000 : ℝ) ≤
      (-(13483890514746875546159 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5193164395830821 / 20000000000000000 : ℝ) =
            (5193164395830821 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5193164395830821 / 5000000000000000 : ℝ) ≤
            (379053091253124453841 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (871700211176973 / 5000000000000000 : ℝ)) (q :=
      (5193164395830821 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_562_14 :
    Uω (aρ 14) (bρ 14) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_562_15 :
    Uω (aρ 15) (bρ 15) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_562_16 :
    Uω (aρ 16) (bρ 16) (10283899111043 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_562 :
    Uρ (10283899111043 / 16000000000000 : ℝ) ≤
      (-(3722356053754804569431 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10283899111043 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(565123242699242190631 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10283899111043 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(227931768568958541353 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10283899111043 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4634353854935592034951 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10283899111043 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(74396329823126201829 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10283899111043 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4957861717286478519223 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10283899111043 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5246404410543003654287 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10283899111043 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(282679195069658106583 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10283899111043 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(621029439375479713257 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10283899111043 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(6953273864243853381139 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10283899111043 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(7929552090284195248573 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10283899111043 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(92088367002658787047 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10283899111043 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(5462123687277067907423 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10283899111043 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(13483890514746875546159 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10283899111043 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10283899111043 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10283899111043 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_562_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_563_1 :
    Uω (aρ 1) (bρ 1) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(1121814209373083173601 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25537648372310497 / 40000000000000000 : ℝ) ≤
      (-(1121814209373083173601 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25537648372310497 / 40000000000000000 : ℝ) =
            (25537648372310497 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25537648372310497 / 20000000000000000 : ℝ) ≤
            (611053741376916826399 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6384386770795561 / 10000000000000000 : ℝ)) (q :=
      (25537648372310497 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_563_2 :
    Uω (aρ 2) (bρ 2) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(565597312504274044621 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25442006414350139 / 40000000000000000 : ℝ) ≤
      (-(565597312504274044621 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25442006414350139 / 40000000000000000 : ℝ) =
            (25442006414350139 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25442006414350139 / 20000000000000000 : ℝ) ≤
            (300836662870725955379 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3180167402162691 / 5000000000000000 : ℝ)) (q :=
      (25442006414350139 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_563_3 :
    Uω (aρ 3) (bρ 3) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(184009512553182304903 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25250745308928571 / 40000000000000000 : ℝ) ≤
      (-(184009512553182304903 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25250745308928571 / 40000000000000000 : ℝ) =
            (25250745308928571 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25250745308928571 / 20000000000000000 : ℝ) ≤
            (93249359566817695097 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3156050178982299 / 5000000000000000 : ℝ)) (q :=
      (25250745308928571 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_563_4 :
    Uω (aρ 4) (bρ 4) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(1181701895927001116443 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4986632254650801 / 8000000000000000 : ℝ) ≤
      (-(1181701895927001116443 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4986632254650801 / 8000000000000000 : ℝ) =
            (4986632254650801 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4986632254650801 / 4000000000000000 : ℝ) ≤
            (551166054822998883557 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1246320504238463 / 2000000000000000 : ℝ)) (q :=
      (4986632254650801 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_563_5 :
    Uω (aρ 5) (bρ 5) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(4922604025803230328569 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24449727025899473 / 40000000000000000 : ℝ) ≤
      (-(4922604025803230328569 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24449727025899473 / 40000000000000000 : ℝ) =
            (24449727025899473 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24449727025899473 / 20000000000000000 : ℝ) ≤
            (2008867777196769671431 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6108075316850049 / 10000000000000000 : ℝ)) (q :=
      (24449727025899473 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_563_6 :
    Uω (aρ 6) (bρ 6) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(2605039519011009743847 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23756865206856329 / 40000000000000000 : ℝ) ≤
      (-(2605039519011009743847 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23756865206856329 / 40000000000000000 : ℝ) =
            (23756865206856329 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23756865206856329 / 20000000000000000 : ℝ) ≤
            (860696382488990256153 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5928884782468477 / 10000000000000000 : ℝ)) (q :=
      (23756865206856329 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_563_7 :
    Uω (aρ 7) (bρ 7) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(1123133245324348551683 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22812595809258933 / 40000000000000000 : ℝ) ≤
      (-(1123133245324348551683 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22812595809258933 / 40000000000000000 : ℝ) =
            (22812595809258933 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22812595809258933 / 20000000000000000 : ℝ) ≤
            (263161115275651448317 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5680411464429779 / 10000000000000000 : ℝ)) (q :=
      (22812595809258933 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_563_8 :
    Uω (aρ 8) (bρ 8) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(6170020726299281010733 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21582383025250187 / 40000000000000000 : ℝ) ≤
      (-(6170020726299281010733 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21582383025250187 / 40000000000000000 : ℝ) =
            (21582383025250187 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21582383025250187 / 20000000000000000 : ℝ) ≤
            (761451076700718989267 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2674423361882703 / 5000000000000000 : ℝ)) (q :=
      (21582383025250187 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_563_9 :
    Uω (aρ 9) (bρ 9) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(3454742864578543876601 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20044020521875581 / 40000000000000000 : ℝ) ≤
      (-(3454742864578543876601 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20044020521875581 / 40000000000000000 : ℝ) =
            (20044020521875581 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 2
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20044020521875581 / 20000000000000000 : ℝ) ≤
            (10993036921456123399 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4920631100438103 / 10000000000000000 : ℝ)) (q :=
      (20044020521875581 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_563_10 :
    Uω (aρ 10) (bρ 10) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(1576072435054941454207 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18189476927450631 / 40000000000000000 : ℝ) ≤
      (-(1576072435054941454207 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (18189476927450631 / 40000000000000000 : ℝ) =
            (18189476927450631 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18189476927450631 / 10000000000000000 : ℝ) ≤
            (1196516286145058545793 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1095479584180157 / 2500000000000000 : ℝ)) (q :=
      (18189476927450631 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_563_11 :
    Uω (aρ 11) (bρ 11) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(9150780638360100323413 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16019414449549067 / 40000000000000000 : ℝ) ≤
      (-(9150780638360100323413 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (16019414449549067 / 40000000000000000 : ℝ) =
            (16019414449549067 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16019414449549067 / 10000000000000000 : ℝ) ≤
            (4712162967639899676587 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1857681861987423 / 5000000000000000 : ℝ)) (q :=
      (16019414449549067 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_563_12 :
    Uω (aρ 12) (bρ 12) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(542471460987771583411 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13516842921434643 / 40000000000000000 : ℝ) ≤
      (-(542471460987771583411 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13516842921434643 / 40000000000000000 : ℝ) =
            (13516842921434643 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13516842921434643 / 10000000000000000 : ℝ) ≤
            (150675719312228416589 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1443889028301317 / 5000000000000000 : ℝ)) (q :=
      (13516842921434643 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_563_13 :
    Uω (aρ 13) (bρ 13) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(2672410650574187809643 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2102729401588053 / 8000000000000000 : ℝ) ≤
      (-(2672410650574187809643 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2102729401588053 / 8000000000000000 : ℝ) =
            (2102729401588053 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2102729401588053 / 2000000000000000 : ℝ) ≤
            (100178070625812190357 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (357112368290089 / 2000000000000000 : ℝ)) (q :=
      (2102729401588053 / 8000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_563_14 :
    Uω (aρ 14) (bρ 14) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_563_15 :
    Uω (aρ 15) (bρ 15) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_563_16 :
    Uω (aρ 16) (bρ 16) (20636590827023 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_563 :
    Uρ (20636590827023 / 32000000000000 : ℝ) ≤
      (-(740272258788343837463 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20636590827023 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1121814209373083173601 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20636590827023 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(565597312504274044621 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20636590827023 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(184009512553182304903 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20636590827023 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1181701895927001116443 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20636590827023 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4922604025803230328569 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20636590827023 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(2605039519011009743847 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20636590827023 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1123133245324348551683 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20636590827023 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6170020726299281010733 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20636590827023 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(3454742864578543876601 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20636590827023 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1576072435054941454207 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20636590827023 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9150780638360100323413 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20636590827023 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(542471460987771583411 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20636590827023 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(2672410650574187809643 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20636590827023 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (20636590827023 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20636590827023 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_563_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_564_1 :
    Uω (aρ 1) (bρ 1) (517634585799 / 800000000000 : ℝ) ≤
      (-(4453641117210170942821 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6405909867100199 / 10000000000000000 : ℝ) ≤
      (-(4453641117210170942821 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6405909867100199 / 10000000000000000 : ℝ) =
            (6405909867100199 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6405909867100199 / 5000000000000000 : ℝ) ≤
            (2477830685789829057179 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3202942314898949 / 5000000000000000 : ℝ)) (q :=
      (6405909867100199 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_564_2 :
    Uω (aρ 2) (bρ 2) (517634585799 / 800000000000 : ℝ) ≤
      (-(4491035876755540387069 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3190999927253161 / 5000000000000000 : ℝ) ≤
      (-(4491035876755540387069 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3190999927253161 / 5000000000000000 : ℝ) =
            (3190999927253161 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3190999927253161 / 2500000000000000 : ℝ) ≤
            (2440435926244459612931 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (398864601070009 / 625000000000000 : ℝ)) (q :=
      (3190999927253161 / 5000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_564_3 :
    Uω (aρ 3) (bρ 3) (517634585799 / 800000000000 : ℝ) ≤
      (-(4566237788996584143217 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (395886625324303 / 625000000000000 : ℝ) ≤
      (-(4566237788996584143217 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (395886625324303 / 625000000000000 : ℝ) =
            (395886625324303 / 312500000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (395886625324303 / 312500000000000 : ℝ) ≤
            (2365234014003415856783 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1583400506208799 / 2500000000000000 : ℝ)) (q :=
      (395886625324303 / 625000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_564_4 :
    Uω (aρ 4) (bρ 4) (517634585799 / 800000000000 : ℝ) ≤
      (-(58654614175999811513 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6254793809870713 / 10000000000000000 : ℝ) ≤
      (-(58654614175999811513 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6254793809870713 / 10000000000000000 : ℝ) =
            (6254793809870713 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6254793809870713 / 5000000000000000 : ℝ) ≤
            (27988783361500188487 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3126555907631963 / 5000000000000000 : ℝ)) (q :=
      (6254793809870713 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_564_5 :
    Uω (aρ 5) (bρ 5) (517634585799 / 800000000000 : ℝ) ≤
      (-(977494076851752214137 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2995090197471 / 4882812500000 : ℝ) ≤
      (-(977494076851752214137 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show (2995090197471 / 4882812500000 : ℝ) = (2995090197471 / 2441406250000 : ℝ) / 2 ^ 1 by
          norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2995090197471 / 2441406250000 : ℝ) ≤
            (408800283748247785863 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1532400890924679 / 2500000000000000 : ℝ)) (q :=
      (2995090197471 / 4882812500000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_564_6 :
    Uω (aρ 6) (bρ 6) (517634585799 / 800000000000 : ℝ) ≤
      (-(5173885597877607211283 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11921502632982307 / 20000000000000000 : ℝ) ≤
      (-(5173885597877607211283 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11921502632982307 / 20000000000000000 : ℝ) =
            (11921502632982307 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11921502632982307 / 10000000000000000 : ℝ) ≤
            (1757586205122392788717 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5950457122979807 / 10000000000000000 : ℝ)) (q :=
      (11921502632982307 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_564_7 :
    Uω (aρ 7) (bρ 7) (517634585799 / 800000000000 : ℝ) ≤
      (-(1394473231557664473619 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (715591545793229 / 1250000000000000 : ℝ) ≤
      (-(1394473231557664473619 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (715591545793229 / 1250000000000000 : ℝ) =
            (715591545793229 / 625000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (715591545793229 / 625000000000000 : ℝ) ≤
            (338394719192335526381 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1425520150862291 / 2500000000000000 : ℝ)) (q :=
      (715591545793229 / 1250000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_564_8 :
    Uω (aρ 8) (bρ 8) (517634585799 / 800000000000 : ℝ) ≤
      (-(766238927205555868307 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5417280576956103 / 10000000000000000 : ℝ) ≤
      (-(766238927205555868307 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5417280576956103 / 10000000000000000 : ℝ) =
            (5417280576956103 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5417280576956103 / 5000000000000000 : ℝ) ≤
            (100195048169444131693 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2685359338004853 / 5000000000000000 : ℝ)) (q :=
      (5417280576956103 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_564_9 :
    Uω (aρ 9) (bρ 9) (517634585799 / 800000000000 : ℝ) ≤
      (-(6865895476826353308691 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (503289590483219 / 1000000000000000 : ℝ) ≤
      (-(6865895476826353308691 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (503289590483219 / 1000000000000000 : ℝ) =
            (503289590483219 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (503289590483219 / 500000000000000 : ℝ) ≤
            (65576326173646691309 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (123572874003047 / 250000000000000 : ℝ)) (q :=
      (503289590483219 / 1000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_564_10 :
    Uω (aρ 10) (bρ 10) (517634585799 / 800000000000 : ℝ) ≤
      (-(7831431128554380707361 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9139349024056447 / 20000000000000000 : ℝ) ≤
      (-(7831431128554380707361 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9139349024056447 / 20000000000000000 : ℝ) =
            (9139349024056447 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9139349024056447 / 5000000000000000 : ℝ) ≤
            (6031512477445619292639 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4405031208008947 / 10000000000000000 : ℝ)) (q :=
      (9139349024056447 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_564_11 :
    Uω (aρ 11) (bρ 11) (517634585799 / 800000000000 : ℝ) ≤
      (-(9093111557506252195301 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8056031916865501 / 20000000000000000 : ℝ) ≤
      (-(9093111557506252195301 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8056031916865501 / 20000000000000000 : ℝ) =
            (8056031916865501 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8056031916865501 / 5000000000000000 : ℝ) ≤
            (4769832048493747804699 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3740190727023001 / 10000000000000000 : ℝ)) (q :=
      (8056031916865501 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_564_12 :
    Uω (aρ 12) (bρ 12) (517634585799 / 800000000000 : ℝ) ≤
      (-(5387676966162376967213 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (136173410858717 / 400000000000000 : ℝ) ≤
      (-(5387676966162376967213 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (136173410858717 / 400000000000000 : ℝ) =
            (136173410858717 / 100000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (136173410858717 / 100000000000000 : ℝ) ≤
            (1543794836837623032787 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (58330588995567 / 200000000000000 : ℝ)) (q :=
      (136173410858717 / 400000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12]) (by norm_num [bρ_12])
      (by norm_num) (by norm_num [aρ_12, bρ_12]) (by norm_num [aρ_12, bρ_12]) hlg

lemma U_564_13 :
    Uω (aρ 13) (bρ 13) (517634585799 / 800000000000 : ℝ) ≤
      (-(3310758912492028501331 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5319762758207451 / 20000000000000000 : ℝ) ≤
      (-(3310758912492028501331 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5319762758207451 / 20000000000000000 : ℝ) =
            (5319762758207451 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5319762758207451 / 5000000000000000 : ℝ) ≤
            (154976989007971498669 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1827003406644951 / 10000000000000000 : ℝ)) (q :=
      (5319762758207451 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_564_14 :
    Uω (aρ 14) (bρ 14) (517634585799 / 800000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_564_15 :
    Uω (aρ 15) (bρ 15) (517634585799 / 800000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_564_16 :
    Uω (aρ 16) (bρ 16) (517634585799 / 800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_564 :
    Uρ (517634585799 / 800000000000 : ℝ) ≤
      (-(3680541795298583111983 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (517634585799 / 800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4453641117210170942821 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (517634585799 / 800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4491035876755540387069 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (517634585799 / 800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4566237788996584143217 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (517634585799 / 800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(58654614175999811513 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (517634585799 / 800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(977494076851752214137 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (517634585799 / 800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5173885597877607211283 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (517634585799 / 800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1394473231557664473619 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (517634585799 / 800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(766238927205555868307 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (517634585799 / 800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(6865895476826353308691 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (517634585799 / 800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(7831431128554380707361 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (517634585799 / 800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9093111557506252195301 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (517634585799 / 800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(5387676966162376967213 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (517634585799 / 800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(3310758912492028501331 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (517634585799 / 800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (517634585799 / 800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (517634585799 / 800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_564_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_565_1 :
    Uω (aρ 1) (bρ 1) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(11050345052480570479 / 25000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25709630562217229 / 40000000000000000 : ℝ) ≤
      (-(11050345052480570479 / 25000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25709630562217229 / 40000000000000000 : ℝ) =
            (25709630562217229 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25709630562217229 / 20000000000000000 : ℝ) ≤
            (6278334455019429521 / 25000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3213691243831651 / 5000000000000000 : ℝ)) (q :=
      (25709630562217229 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_565_2 :
    Uω (aρ 2) (bρ 2) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(4457406733048630161033 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25613992406609107 / 40000000000000000 : ℝ) ≤
      (-(4457406733048630161033 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25613992406609107 / 40000000000000000 : ℝ) =
            (25613992406609107 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25613992406609107 / 20000000000000000 : ℝ) ≤
            (2474065069951369838967 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6403332422369241 / 10000000000000000 : ℝ)) (q :=
      (25613992406609107 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_565_3 :
    Uω (aρ 3) (bρ 3) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(4532352993907169877393 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25422742678753341 / 40000000000000000 : ℝ) ≤
      (-(4532352993907169877393 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25422742678753341 / 40000000000000000 : ℝ) =
            (25422742678753341 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25422742678753341 / 20000000000000000 : ℝ) ≤
            (2399118809092830122607 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3177551832395679 / 5000000000000000 : ℝ)) (q :=
      (25422742678753341 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_565_4 :
    Uω (aρ 4) (bρ 4) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(232902447078791866397 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25105189046627263 / 40000000000000000 : ℝ) ≤
      (-(232902447078791866397 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25105189046627263 / 40000000000000000 : ℝ) =
            (25105189046627263 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25105189046627263 / 20000000000000000 : ℝ) ≤
            (113671143071208133603 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6274621029793319 / 10000000000000000 : ℝ)) (q :=
      (25105189046627263 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_565_5 :
    Uω (aρ 5) (bρ 5) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(4852459921577938326357 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24621830341973913 / 40000000000000000 : ℝ) ≤
      (-(4852459921577938326357 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24621830341973913 / 40000000000000000 : ℝ) =
            (24621830341973913 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24621830341973913 / 20000000000000000 : ℝ) ≤
            (2079011881422061673643 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1537782899200411 / 2500000000000000 : ℝ)) (q :=
      (24621830341973913 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_565_6 :
    Uω (aρ 6) (bρ 6) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(64222789149440470487 / 125000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4785828849661249 / 8000000000000000 : ℝ) ≤
      (-(64222789149440470487 / 125000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4785828849661249 / 8000000000000000 : ℝ) =
            (4785828849661249 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4785828849661249 / 4000000000000000 : ℝ) ≤
            (22420608388059529513 / 125000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (597202892510781 / 1000000000000000 : ℝ)) (q :=
      (4785828849661249 / 8000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_565_7 :
    Uω (aρ 7) (bρ 7) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(5540262896390538563607 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22985260535457379 / 40000000000000000 : ℝ) ≤
      (-(5540262896390538563607 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22985260535457379 / 40000000000000000 : ℝ) =
            (22985260535457379 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22985260535457379 / 20000000000000000 : ℝ) ≤
            (1391208906609461436393 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5723748449443377 / 10000000000000000 : ℝ)) (q :=
      (22985260535457379 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_565_8 :
    Uω (aρ 8) (bρ 8) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(6089965109248601034731 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21755855570410679 / 40000000000000000 : ℝ) ≤
      (-(6089965109248601034731 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21755855570410679 / 40000000000000000 : ℝ) =
            (21755855570410679 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21755855570410679 / 20000000000000000 : ℝ) ≤
            (841506693751398965269 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5392587618260027 / 10000000000000000 : ℝ)) (q :=
      (21755855570410679 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_565_9 :
    Uω (aρ 9) (bρ 9) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(213203164631554066227 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20219132852365427 / 40000000000000000 : ℝ) ≤
      (-(213203164631554066227 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20219132852365427 / 40000000000000000 : ℝ) =
            (20219132852365427 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20219132852365427 / 20000000000000000 : ℝ) ≤
            (3405329212195933773 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4965191887597401 / 10000000000000000 : ℝ)) (q :=
      (20219132852365427 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_565_10 :
    Uω (aρ 10) (bρ 10) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(3891378029483553701593 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18367886624975269 / 40000000000000000 : ℝ) ≤
      (-(3891378029483553701593 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (18367886624975269 / 40000000000000000 : ℝ) =
            (18367886624975269 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18367886624975269 / 10000000000000000 : ℝ) ≤
            (3040093773516446298407 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2214063903698661 / 5000000000000000 : ℝ)) (q :=
      (18367886624975269 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_565_11 :
    Uω (aρ 11) (bρ 11) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(9035823701220572399023 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16204631289860401 / 40000000000000000 : ℝ) ≤
      (-(9035823701220572399023 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (16204631289860401 / 40000000000000000 : ℝ) =
            (16204631289860401 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16204631289860401 / 10000000000000000 : ℝ) ≤
            (4827119904779427600977 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (470622095755611 / 1250000000000000 : ℝ)) (q :=
      (16204631289860401 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_565_12 :
    Uω (aρ 12) (bρ 12) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(5351001880761519242997 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13717591735961083 / 40000000000000000 : ℝ) ≤
      (-(5351001880761519242997 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13717591735961083 / 40000000000000000 : ℝ) =
            (13717591735961083 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13717591735961083 / 10000000000000000 : ℝ) ≤
            (1580469922238480757003 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2945157085780229 / 10000000000000000 : ℝ)) (q :=
      (13717591735961083 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_565_13 :
    Uω (aρ 13) (bρ 13) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(13126666327036419575017 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10764060149677171 / 40000000000000000 : ℝ) ≤
      (-(13126666327036419575017 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10764060149677171 / 40000000000000000 : ℝ) =
            (10764060149677171 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10764060149677171 / 10000000000000000 : ℝ) ≤
            (736277278963580424983 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1867773034233273 / 10000000000000000 : ℝ)) (q :=
      (10764060149677171 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_565_14 :
    Uω (aρ 14) (bρ 14) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_565_15 :
    Uω (aρ 15) (bρ 15) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_565_16 :
    Uω (aρ 16) (bρ 16) (20774176036897 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_565 :
    Uρ (20774176036897 / 32000000000000 : ℝ) ≤
      (-(457486403617067305977 / 625000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20774176036897 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(11050345052480570479 / 25000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20774176036897 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4457406733048630161033 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20774176036897 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(4532352993907169877393 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20774176036897 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(232902447078791866397 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20774176036897 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(4852459921577938326357 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20774176036897 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) * (-(64222789149440470487 / 125000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20774176036897 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(5540262896390538563607 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20774176036897 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6089965109248601034731 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20774176036897 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(213203164631554066227 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20774176036897 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3891378029483553701593 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20774176036897 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(9035823701220572399023 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20774176036897 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(5351001880761519242997 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20774176036897 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(13126666327036419575017 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20774176036897 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (20774176036897 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20774176036897 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_565_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_566_1 :
    Uω (aρ 1) (bρ 1) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(438674679669422764263 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12897810826891269 / 20000000000000000 : ℝ) ≤
      (-(438674679669422764263 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12897810826891269 / 20000000000000000 : ℝ) =
            (12897810826891269 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12897810826891269 / 10000000000000000 : ℝ) ≤
            (254472500630577235737 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (806110043050393 / 1250000000000000 : ℝ)) (q :=
      (12897810826891269 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_566_2 :
    Uω (aρ 2) (bρ 2) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(552986288518407495121 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12849992690126547 / 20000000000000000 : ℝ) ≤
      (-(552986288518407495121 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12849992690126547 / 20000000000000000 : ℝ) =
            (12849992690126547 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12849992690126547 / 10000000000000000 : ℝ) ≤
            (313447686856592504879 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3212415610074211 / 5000000000000000 : ℝ)) (q :=
      (12849992690126547 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_566_3 :
    Uω (aρ 3) (bρ 3) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(1124645662501160291839 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12754370641733471 / 20000000000000000 : ℝ) ≤
      (-(1124645662501160291839 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12754370641733471 / 20000000000000000 : ℝ) =
            (12754370641733471 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12754370641733471 / 10000000000000000 : ℝ) ≤
            (608222288248839708161 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3188302639052673 / 5000000000000000 : ℝ)) (q :=
      (12754370641733471 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_566_4 :
    Uω (aρ 4) (bρ 4) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(4623846196384515435809 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12595601348158829 / 20000000000000000 : ℝ) ≤
      (-(4623846196384515435809 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12595601348158829 / 20000000000000000 : ℝ) =
            (12595601348158829 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12595601348158829 / 10000000000000000 : ℝ) ≤
            (2307625606615484564191 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (787016270699463 / 1250000000000000 : ℝ)) (q :=
      (12595601348158829 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_566_5 :
    Uω (aρ 5) (bρ 5) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(963514355168254296311 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12353940681623363 / 20000000000000000 : ℝ) ≤
      (-(963514355168254296311 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12353940681623363 / 20000000000000000 : ℝ) =
            (12353940681623363 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12353940681623363 / 10000000000000000 : ℝ) ≤
            (422780005431745703689 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3086329709197619 / 5000000000000000 : ℝ)) (q :=
      (12353940681623363 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_566_6 :
    Uω (aρ 6) (bρ 6) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(5101890692535526692447 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6003820541376879 / 10000000000000000 : ℝ) ≤
      (-(5101890692535526692447 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6003820541376879 / 10000000000000000 : ℝ) =
            (6003820541376879 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6003820541376879 / 5000000000000000 : ℝ) ≤
            (1829581110464473307553 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5993600194665633 / 10000000000000000 : ℝ)) (q :=
      (6003820541376879 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_566_7 :
    Uω (aρ 7) (bρ 7) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(1375693761494647139359 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11535794524369811 / 20000000000000000 : ℝ) ≤
      (-(1375693761494647139359 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11535794524369811 / 20000000000000000 : ℝ) =
            (11535794524369811 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11535794524369811 / 10000000000000000 : ℝ) ≤
            (357174189255352860641 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2872707508520843 / 5000000000000000 : ℝ)) (q :=
      (11535794524369811 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_566_8 :
    Uω (aρ 8) (bρ 8) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(3025090229805417688551 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1092129144297653 / 2000000000000000 : ℝ) ≤
      (-(3025090229805417688551 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1092129144297653 / 2000000000000000 : ℝ) =
            (1092129144297653 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1092129144297653 / 1000000000000000 : ℝ) ≤
            (440645671694582311449 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1082890717397681 / 2000000000000000 : ℝ)) (q :=
      (1092129144297653 / 2000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_566_9 :
    Uω (aρ 9) (bρ 9) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(1355860257608270240147 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10153334203382703 / 20000000000000000 : ℝ) ≤
      (-(1355860257608270240147 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10153334203382703 / 20000000000000000 : ℝ) =
            (10153334203382703 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10153334203382703 / 10000000000000000 : ℝ) ≤
            (30434102991729759853 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2493730987877289 / 5000000000000000 : ℝ)) (q :=
      (10153334203382703 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_566_10 :
    Uω (aρ 10) (bρ 10) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(1933583531531276978283 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4614260791157823 / 10000000000000000 : ℝ) ≤
      (-(1933583531531276978283 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4614260791157823 / 10000000000000000 : ℝ) =
            (4614260791157823 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4614260791157823 / 2500000000000000 : ℝ) ≤
            (1532152369968723021717 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4451208388182521 / 10000000000000000 : ℝ)) (q :=
      (4614260791157823 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_566_11 :
    Uω (aρ 11) (bρ 11) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(140295491425674205323 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (407427960636177 / 1000000000000000 : ℝ) ≤
      (-(140295491425674205323 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (407427960636177 / 1000000000000000 : ℝ) =
            (407427960636177 / 250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (407427960636177 / 250000000000000 : ℝ) ≤
            (76313002418075794677 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (757944528959083 / 2000000000000000 : ℝ)) (q :=
      (407427960636177 / 1000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_566_12 :
    Uω (aρ 12) (bρ 12) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(10629361654901392404073 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (431800063131587 / 1250000000000000 : ℝ) ≤
      (-(10629361654901392404073 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (431800063131587 / 1250000000000000 : ℝ) =
            (431800063131587 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (431800063131587 / 312500000000000 : ℝ) ≤
            (3233581951098607595927 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2973664538862267 / 10000000000000000 : ℝ)) (q :=
      (431800063131587 / 1250000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12]) (by norm_num [bρ_12])
      (by norm_num) (by norm_num [aρ_12, bρ_12]) (by norm_num [aρ_12, bρ_12]) hlg

lemma U_566_13 :
    Uω (aρ 13) (bρ 13) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(13012790773802567949037 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5443668529638587 / 20000000000000000 : ℝ) ≤
      (-(13012790773802567949037 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5443668529638587 / 20000000000000000 : ℝ) =
            (5443668529638587 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5443668529638587 / 5000000000000000 : ℝ) ≤
            (850152832197432050963 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (953956899995231 / 5000000000000000 : ℝ)) (q :=
      (5443668529638587 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_566_14 :
    Uω (aρ 14) (bρ 14) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_566_15 :
    Uω (aρ 15) (bρ 15) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_566_16 :
    Uω (aρ 16) (bρ 16) (10421484320917 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_566 :
    Uρ (10421484320917 / 16000000000000 : ℝ) ≤
      (-(3639403798061565336769 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (10421484320917 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(438674679669422764263 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (10421484320917 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(552986288518407495121 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (10421484320917 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1124645662501160291839 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (10421484320917 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(4623846196384515435809 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (10421484320917 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(963514355168254296311 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (10421484320917 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5101890692535526692447 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (10421484320917 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1375693761494647139359 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (10421484320917 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(3025090229805417688551 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (10421484320917 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1355860257608270240147 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (10421484320917 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1933583531531276978283 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (10421484320917 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(140295491425674205323 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (10421484320917 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(10629361654901392404073 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (10421484320917 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(13012790773802567949037 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (10421484320917 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (10421484320917 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (10421484320917 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_566_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_567_1 :
    Uω (aρ 1) (bρ 1) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(4353466699681521755969 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25881612743119157 / 40000000000000000 : ℝ) ≤
      (-(4353466699681521755969 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25881612743119157 / 40000000000000000 : ℝ) =
            (25881612743119157 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25881612743119157 / 20000000000000000 : ℝ) ≤
            (2578005103318478244031 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6470378200028641 / 10000000000000000 : ℝ)) (q :=
      (25881612743119157 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_567_2 :
    Uω (aρ 2) (bρ 2) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(4390485848910326832271 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25785978339106719 / 40000000000000000 : ℝ) ≤
      (-(4390485848910326832271 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25785978339106719 / 40000000000000000 : ℝ) =
            (25785978339106719 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25785978339106719 / 20000000000000000 : ℝ) ≤
            (2540985954089673167729 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3223165005266211 / 5000000000000000 : ℝ)) (q :=
      (25785978339106719 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_567_3 :
    Uω (aρ 3) (bρ 3) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(558115748324716916001 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25594739835433403 / 40000000000000000 : ℝ) ≤
      (-(558115748324716916001 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25594739835433403 / 40000000000000000 : ℝ) =
            (25594739835433403 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25594739835433403 / 20000000000000000 : ℝ) ≤
            (308318227050283083999 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1599526716261441 / 2500000000000000 : ℝ)) (q :=
      (25594739835433403 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_567_4 :
    Uω (aρ 4) (bρ 4) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(1147440024247301742847 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25277216190162251 / 40000000000000000 : ℝ) ≤
      (-(1147440024247301742847 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25277216190162251 / 40000000000000000 : ℝ) =
            (25277216190162251 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25277216190162251 / 20000000000000000 : ℝ) ≤
            (585427926502698257153 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1579409805868797 / 2500000000000000 : ℝ)) (q :=
      (25277216190162251 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_567_5 :
    Uω (aρ 5) (bρ 5) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(239140254707843448427 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24793931965911463 / 40000000000000000 : ℝ) ≤
      (-(239140254707843448427 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24793931965911463 / 40000000000000000 : ℝ) =
            (24793931965911463 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24793931965911463 / 20000000000000000 : ℝ) ≤
            (107433335442156551573 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3097093515342397 / 5000000000000000 : ℝ)) (q :=
      (24793931965911463 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_567_6 :
    Uω (aρ 6) (bρ 6) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(5066087342182747444541 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24101419029027671 / 40000000000000000 : ℝ) ≤
      (-(5066087342182747444541 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24101419029027671 / 40000000000000000 : ℝ) =
            (24101419029027671 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24101419029027671 / 20000000000000000 : ℝ) ≤
            (1865384460817252555459 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3007585468691449 / 5000000000000000 : ℝ)) (q :=
      (24101419029027671 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_567_7 :
    Uω (aρ 7) (bρ 7) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(2732714148191447201139 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23157915034047183 / 40000000000000000 : ℝ) ≤
      (-(2732714148191447201139 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23157915034047183 / 40000000000000000 : ℝ) =
            (23157915034047183 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23157915034047183 / 20000000000000000 : ℝ) ≤
            (733021753308552798861 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2883540160326327 / 5000000000000000 : ℝ)) (q :=
      (23157915034047183 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_567_8 :
    Uω (aρ 8) (bρ 8) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(6010556143983057996553 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21929304326212211 / 40000000000000000 : ℝ) ≤
      (-(6010556143983057996553 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21929304326212211 / 40000000000000000 : ℝ) =
            (21929304326212211 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21929304326212211 / 20000000000000000 : ℝ) ≤
            (920915659016942003447 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (169884894314849 / 312500000000000 : ℝ)) (q :=
      (21929304326212211 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_567_9 :
    Uω (aρ 9) (bρ 9) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(168407343672909906301 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20394190464948549 / 40000000000000000 : ℝ) ≤
      (-(168407343672909906301 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20394190464948549 / 40000000000000000 : ℝ) =
            (20394190464948549 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20394190464948549 / 20000000000000000 : ℝ) ≤
            (4879451402090093699 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5009725315803337 / 10000000000000000 : ℝ)) (q :=
      (20394190464948549 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_567_10 :
    Uω (aρ 10) (bρ 10) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(1921540634794681486427 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (18546168162873673 / 40000000000000000 : ℝ) ≤
      (-(1921540634794681486427 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (18546168162873673 / 40000000000000000 : ℝ) =
            (18546168162873673 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (18546168162873673 / 10000000000000000 : ℝ) ≤
            (1544195266705318513573 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4474273198260899 / 10000000000000000 : ℝ)) (q :=
      (18546168162873673 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_567_11 :
    Uω (aρ 11) (bρ 11) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(892236932291373259771 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3277905360743043 / 8000000000000000 : ℝ) ≤
      (-(892236932291373259771 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3277905360743043 / 8000000000000000 : ℝ) =
            (3277905360743043 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3277905360743043 / 2000000000000000 : ℝ) ≤
            (494057428308626740229 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (381442914488667 / 1000000000000000 : ℝ)) (q :=
      (3277905360743043 / 8000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_567_12 :
    Uω (aρ 12) (bρ 12) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(10557411220120595044881 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13917378786151519 / 40000000000000000 : ℝ) ≤
      (-(10557411220120595044881 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13917378786151519 / 40000000000000000 : ℝ) =
            (13917378786151519 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13917378786151519 / 10000000000000000 : ℝ) ≤
            (3305532385879404955119 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1501027616394911 / 5000000000000000 : ℝ)) (q :=
      (13917378786151519 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_567_13 :
    Uω (aρ 13) (bρ 13) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(3225317275922843369361 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11009434017866411 / 40000000000000000 : ℝ) ≤
      (-(3225317275922843369361 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11009434017866411 / 40000000000000000 : ℝ) =
            (11009434017866411 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11009434017866411 / 10000000000000000 : ℝ) ≤
            (240418625577156630639 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (486866147560567 / 2500000000000000 : ℝ)) (q :=
      (11009434017866411 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_567_14 :
    Uω (aρ 14) (bρ 14) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_14]) (by norm_num [bρ_14])]; exact Lmid_14

lemma U_567_15 :
    Uω (aρ 15) (bρ 15) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_15]) (by norm_num [bρ_15])]; exact Lmid_15

lemma U_567_16 :
    Uω (aρ 16) (bρ 16) (20911761246771 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_567 :
    Uρ (20911761246771 / 32000000000000 : ℝ) ≤
      (-(7238148340803391625791 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (20911761246771 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(4353466699681521755969 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (20911761246771 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(4390485848910326832271 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (20911761246771 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(558115748324716916001 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (20911761246771 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1147440024247301742847 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (20911761246771 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(239140254707843448427 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (20911761246771 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(5066087342182747444541 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (20911761246771 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2732714148191447201139 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (20911761246771 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(6010556143983057996553 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (20911761246771 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(168407343672909906301 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (20911761246771 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1921540634794681486427 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (20911761246771 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(892236932291373259771 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (20911761246771 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(10557411220120595044881 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (20911761246771 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(3225317275922843369361 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (20911761246771 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(8977612329965299982791 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (20911761246771 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(268788866070650094343 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (20911761246771 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_567_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
