/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U51) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_616_1 :
    Uω (aρ 1) (bρ 1) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(106318913346585029177 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7116133783633341 / 10000000000000000 : ℝ) ≤
      (-(106318913346585029177 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7116133783633341 / 10000000000000000 : ℝ) =
            (7116133783633341 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7116133783633341 / 5000000000000000 : ℝ) ≤
            (110289580497164970823 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7116111065133557 / 10000000000000000 : ℝ)) (q :=
      (7116133783633341 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_616_2 :
    Uω (aρ 2) (bρ 2) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(3435841602808840498403 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14184475799498081 / 20000000000000000 : ℝ) ≤
      (-(3435841602808840498403 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14184475799498081 / 20000000000000000 : ℝ) =
            (14184475799498081 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14184475799498081 / 10000000000000000 : ℝ) ≤
            (3495630200191159501597 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1773022077468739 / 2500000000000000 : ℝ)) (q :=
      (14184475799498081 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_616_3 :
    Uω (aρ 3) (bρ 3) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(3503427083001394159311 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1761116571139903 / 2500000000000000 : ℝ) ≤
      (-(3503427083001394159311 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1761116571139903 / 2500000000000000 : ℝ) =
            (1761116571139903 / 1250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1761116571139903 / 1250000000000000 : ℝ) ≤
            (3428044719998605840689 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7043941185846099 / 10000000000000000 : ℝ)) (q :=
      (1761116571139903 / 2500000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_616_4 :
    Uω (aρ 4) (bρ 4) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(904151680374748223911 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13930373515006951 / 20000000000000000 : ℝ) ≤
      (-(904151680374748223911 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (13930373515006951 / 20000000000000000 : ℝ) =
            (13930373515006951 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13930373515006951 / 10000000000000000 : ℝ) ≤
            (828716270375251776089 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3481838156399413 / 5000000000000000 : ℝ)) (q :=
      (13930373515006951 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_616_5 :
    Uω (aρ 5) (bρ 5) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(3791226089629521932043 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1368923372411711 / 2000000000000000 : ℝ) ≤
      (-(3791226089629521932043 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1368923372411711 / 2000000000000000 : ℝ) =
            (1368923372411711 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1368923372411711 / 1000000000000000 : ℝ) ≤
            (3140245713370478067957 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1368145288248797 / 2000000000000000 : ℝ)) (q :=
      (1368923372411711 / 2000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_616_6 :
    Uω (aρ 6) (bρ 6) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(202327453614113887511 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3336035096403903 / 5000000000000000 : ℝ) ≤
      (-(202327453614113887511 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3336035096403903 / 5000000000000000 : ℝ) =
            (3336035096403903 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3336035096403903 / 2500000000000000 : ℝ) ≤
            (144246136535886112489 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6662873477882487 / 10000000000000000 : ℝ)) (q :=
      (3336035096403903 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_616_7 :
    Uω (aρ 7) (bρ 7) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(2202253901422898501509 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1609365418549547 / 2500000000000000 : ℝ) ≤
      (-(2202253901422898501509 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1609365418549547 / 2500000000000000 : ℝ) =
            (1609365418549547 / 1250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1609365418549547 / 1250000000000000 : ℝ) ≤
            (1263482000077101498491 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6417317821423251 / 10000000000000000 : ℝ)) (q :=
      (1609365418549547 / 2500000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_616_8 :
    Uω (aρ 8) (bρ 8) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(4889116153186919824119 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3066467650961623 / 5000000000000000 : ℝ) ≤
      (-(4889116153186919824119 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3066467650961623 / 5000000000000000 : ℝ) =
            (3066467650961623 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3066467650961623 / 2500000000000000 : ℝ) ≤
            (2042355649813080175881 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6091806728213367 / 10000000000000000 : ℝ)) (q :=
      (3066467650961623 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_616_9 :
    Uω (aρ 9) (bρ 9) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(1105240842738283865227 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2877199688669567 / 5000000000000000 : ℝ) ≤
      (-(1105240842738283865227 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2877199688669567 / 5000000000000000 : ℝ) =
            (2877199688669567 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2877199688669567 / 2500000000000000 : ℝ) ≤
            (281053517861716134773 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5675700507405143 / 10000000000000000 : ℝ)) (q :=
      (2877199688669567 / 5000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_616_10 :
    Uω (aρ 10) (bρ 10) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(6343775738609869476143 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10605308731064837 / 20000000000000000 : ℝ) ≤
      (-(6343775738609869476143 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10605308731064837 / 20000000000000000 : ℝ) =
            (10605308731064837 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10605308731064837 / 10000000000000000 : ℝ) ≤
            (587696064390130523857 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (645096189660839 / 1250000000000000 : ℝ)) (q :=
      (10605308731064837 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_616_11 :
    Uω (aρ 11) (bρ 11) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(3686848114669659335923 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9567411135391271 / 20000000000000000 : ℝ) ≤
      (-(3686848114669659335923 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9567411135391271 / 20000000000000000 : ℝ) =
            (9567411135391271 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9567411135391271 / 5000000000000000 : ℝ) ≤
            (3244623688330340664077 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2270674273909073 / 5000000000000000 : ℝ)) (q :=
      (9567411135391271 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_616_12 :
    Uω (aρ 12) (bρ 12) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(4328354908750573873291 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2103845646309407 / 5000000000000000 : ℝ) ≤
      (-(4328354908750573873291 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2103845646309407 / 5000000000000000 : ℝ) =
            (2103845646309407 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2103845646309407 / 1250000000000000 : ℝ) ≤
            (2603116894249426126709 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3813020094349503 / 10000000000000000 : ℝ)) (q :=
      (2103845646309407 / 5000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_616_13 :
    Uω (aρ 13) (bρ 13) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(10258168058087591677167 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (286802814271449 / 800000000000000 : ℝ) ≤
      (-(10258168058087591677167 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (286802814271449 / 800000000000000 : ℝ) =
            (286802814271449 / 200000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (286802814271449 / 200000000000000 : ℝ) ≤
            (3604775547912408322833 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (29670896074931 / 100000000000000 : ℝ)) (q :=
      (286802814271449 / 800000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13]) (by norm_num [bρ_13])
      (by norm_num) (by norm_num [aρ_13, bρ_13]) (by norm_num [aρ_13, bρ_13]) hlg

lemma U_616_14 :
    Uω (aρ 14) (bρ 14) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(6167965695391489451341 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2912442142317699 / 10000000000000000 : ℝ) ≤
      (-(6167965695391489451341 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2912442142317699 / 10000000000000000 : ℝ) =
            (2912442142317699 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2912442142317699 / 2500000000000000 : ℝ) ≤
            (763506107608510548659 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1965830820387273 / 10000000000000000 : ℝ)) (q :=
      (2912442142317699 / 10000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_616_15 :
    Uω (aρ 15) (bρ 15) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(16171439084303750819383 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1984647236594003 / 10000000000000000 : ℝ) ≤
      (-(16171439084303750819383 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1984647236594003 / 10000000000000000 : ℝ) =
            (1984647236594003 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1984647236594003 / 1250000000000000 : ℝ) ≤
            (4622976324696249180617 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (369814286354881 / 10000000000000000 : ℝ)) (q :=
      (1984647236594003 / 10000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_616_16 :
    Uω (aρ 16) (bρ 16) (11489045952349 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_616 :
    Uρ (11489045952349 / 16000000000000 : ℝ) ≤
      (-(292500798363171186281 / 500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11489045952349 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(106318913346585029177 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11489045952349 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3435841602808840498403 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11489045952349 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3503427083001394159311 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11489045952349 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(904151680374748223911 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11489045952349 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3791226089629521932043 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11489045952349 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(202327453614113887511 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11489045952349 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2202253901422898501509 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11489045952349 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4889116153186919824119 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11489045952349 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1105240842738283865227 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11489045952349 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6343775738609869476143 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11489045952349 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3686848114669659335923 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11489045952349 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(4328354908750573873291 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11489045952349 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(10258168058087591677167 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11489045952349 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(6167965695391489451341 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11489045952349 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(16171439084303750819383 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11489045952349 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_616_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_617_1 :
    Uω (aρ 1) (bρ 1) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(847207624102700801571 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28502631154189897 / 40000000000000000 : ℝ) ≤
      (-(847207624102700801571 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28502631154189897 / 40000000000000000 : ℝ) =
            (28502631154189897 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28502631154189897 / 20000000000000000 : ℝ) ≤
            (885660326647299198429 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7125635100412761 / 10000000000000000 : ℝ)) (q :=
      (28502631154189897 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_617_2 :
    Uω (aρ 2) (bρ 2) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(3422421599130554510801 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5681409659930501 / 8000000000000000 : ℝ) ≤
      (-(3422421599130554510801 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5681409659930501 / 8000000000000000 : ℝ) =
            (5681409659930501 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5681409659930501 / 4000000000000000 : ℝ) ≤
            (3509050203869445489199 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1420322537130813 / 2000000000000000 : ℝ)) (q :=
      (5681409659930501 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_617_3 :
    Uω (aρ 3) (bρ 3) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(109059856659853529079 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28215963872502457 / 40000000000000000 : ℝ) ≤
      (-(109059856659853529079 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28215963872502457 / 40000000000000000 : ℝ) =
            (28215963872502457 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28215963872502457 / 20000000000000000 : ℝ) ≤
            (107548637183896470921 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7053466578429041 / 10000000000000000 : ℝ)) (q :=
      (28215963872502457 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_617_4 :
    Uω (aρ 4) (bρ 4) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(3602939422167406557651 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27898851180049809 / 40000000000000000 : ℝ) ≤
      (-(3602939422167406557651 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27898851180049809 / 40000000000000000 : ℝ) =
            (27898851180049809 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27898851180049809 / 20000000000000000 : ℝ) ≤
            (3328532380832593442349 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6973204413267717 / 10000000000000000 : ℝ)) (q :=
      (27898851180049809 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_617_5 :
    Uω (aρ 5) (bρ 5) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(1888656661307937322841 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27416584981983811 / 40000000000000000 : ℝ) ≤
      (-(1888656661307937322841 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27416584981983811 / 40000000000000000 : ℝ) =
            (27416584981983811 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27416584981983811 / 20000000000000000 : ℝ) ≤
            (1577079240192062677159 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3425130616784859 / 5000000000000000 : ℝ)) (q :=
      (27416584981983811 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_617_6 :
    Uω (aρ 6) (bρ 6) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(1008066302970724523623 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26726429177754317 / 40000000000000000 : ℝ) ≤
      (-(1008066302970724523623 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (26726429177754317 / 40000000000000000 : ℝ) =
            (26726429177754317 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26726429177754317 / 20000000000000000 : ℝ) ≤
            (724801647779275476377 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6672423706594971 / 10000000000000000 : ℝ)) (q :=
      (26726429177754317 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_617_7 :
    Uω (aρ 7) (bρ 7) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(1097419455511665411643 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25788061999608657 / 40000000000000000 : ℝ) ≤
      (-(1097419455511665411643 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25788061999608657 / 40000000000000000 : ℝ) =
            (25788061999608657 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25788061999608657 / 20000000000000000 : ℝ) ≤
            (635448495238334588357 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6426901498282141 / 10000000000000000 : ℝ)) (q :=
      (25788061999608657 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_617_8 :
    Uω (aρ 8) (bρ 8) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(2436747227048758859281 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24570093904536439 / 40000000000000000 : ℝ) ≤
      (-(2436747227048758859281 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24570093904536439 / 40000000000000000 : ℝ) =
            (24570093904536439 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24570093904536439 / 20000000000000000 : ℝ) ≤
            (1028988674451241140719 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (381341193880377 / 625000000000000 : ℝ)) (q :=
      (24570093904536439 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_617_9 :
    Uω (aρ 9) (bρ 9) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(1377359600808868290677 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23056220745501421 / 40000000000000000 : ℝ) ≤
      (-(1377359600808868290677 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23056220745501421 / 40000000000000000 : ℝ) =
            (23056220745501421 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23056220745501421 / 20000000000000000 : ℝ) ≤
            (355508349941131709323 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5685488150928523 / 10000000000000000 : ℝ)) (q :=
      (23056220745501421 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_617_10 :
    Uω (aρ 10) (bρ 10) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(158133477903931247259 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21249758747311093 / 40000000000000000 : ℝ) ≤
      (-(158133477903931247259 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21249758747311093 / 40000000000000000 : ℝ) =
            (21249758747311093 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21249758747311093 / 20000000000000000 : ℝ) ≤
            (15153317171068752741 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5170816185328359 / 10000000000000000 : ℝ)) (q :=
      (21249758747311093 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_617_11 :
    Uω (aρ 11) (bρ 11) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(3676374418941192739521 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19174946742517903 / 40000000000000000 : ℝ) ≤
      (-(3676374418941192739521 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19174946742517903 / 40000000000000000 : ℝ) =
            (19174946742517903 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19174946742517903 / 10000000000000000 : ℝ) ≤
            (3255097384058807260479 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1137971702284191 / 2500000000000000 : ℝ)) (q :=
      (19174946742517903 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_617_12 :
    Uω (aρ 12) (bρ 12) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(431588493602501169943 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16872793394296307 / 40000000000000000 : ℝ) ≤
      (-(431588493602501169943 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (16872793394296307 / 40000000000000000 : ℝ) =
            (16872793394296307 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16872793394296307 / 10000000000000000 : ℝ) ≤
            (261558686697498830057 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1912255115855483 / 5000000000000000 : ℝ)) (q :=
      (16872793394296307 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_617_13 :
    Uω (aρ 13) (bρ 13) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(10226142048473857112987 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14386140081501321 / 40000000000000000 : ℝ) ≤
      (-(10226142048473857112987 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14386140081501321 / 40000000000000000 : ℝ) =
            (14386140081501321 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14386140081501321 / 10000000000000000 : ℝ) ≤
            (3636801557526142887013 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2980565316908473 / 10000000000000000 : ℝ)) (q :=
      (14386140081501321 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_617_14 :
    Uω (aρ 14) (bρ 14) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(12287712213345314582721 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11706078446739869 / 40000000000000000 : ℝ) ≤
      (-(12287712213345314582721 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11706078446739869 / 40000000000000000 : ℝ) =
            (11706078446739869 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11706078446739869 / 10000000000000000 : ℝ) ≤
            (1575231392654685417279 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1984461784572747 / 10000000000000000 : ℝ)) (q :=
      (11706078446739869 / 40000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_617_15 :
    Uω (aρ 15) (bρ 15) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(15939995460286118426859 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8124465222703667 / 40000000000000000 : ℝ) ≤
      (-(15939995460286118426859 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8124465222703667 / 40000000000000000 : ℝ) =
            (8124465222703667 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8124465222703667 / 5000000000000000 : ℝ) ≤
            (4854419948713881573141 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (226614224984823 / 5000000000000000 : ℝ)) (q :=
      (8124465222703667 / 40000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_617_16 :
    Uω (aρ 16) (bρ 16) (4601713724651 / 6400000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_617 :
    Uρ (4601713724651 / 6400000000000 : ℝ) ≤
      (-(728229669929658414691 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (4601713724651 / 6400000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(847207624102700801571 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (4601713724651 / 6400000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3422421599130554510801 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (4601713724651 / 6400000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(109059856659853529079 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (4601713724651 / 6400000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3602939422167406557651 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (4601713724651 / 6400000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1888656661307937322841 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (4601713724651 / 6400000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1008066302970724523623 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (4601713724651 / 6400000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(1097419455511665411643 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (4601713724651 / 6400000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2436747227048758859281 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (4601713724651 / 6400000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1377359600808868290677 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (4601713724651 / 6400000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(158133477903931247259 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (4601713724651 / 6400000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3676374418941192739521 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (4601713724651 / 6400000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(431588493602501169943 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (4601713724651 / 6400000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(10226142048473857112987 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (4601713724651 / 6400000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(12287712213345314582721 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (4601713724651 / 6400000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(15939995460286118426859 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (4601713724651 / 6400000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_617_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_618_1 :
    Uω (aρ 1) (bρ 1) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(337547363029600780631 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1427036358676109 / 2000000000000000 : ℝ) ≤
      (-(337547363029600780631 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1427036358676109 / 2000000000000000 : ℝ) =
            (1427036358676109 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1427036358676109 / 1000000000000000 : ℝ) ≤
            (355599817270399219369 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (89189489194123 / 125000000000000 : ℝ)) (q :=
      (1427036358676109 / 2000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_618_2 :
    Uω (aρ 2) (bρ 2) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(3409019581723940330361 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14222572499079663 / 20000000000000000 : ℝ) ≤
      (-(3409019581723940330361 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14222572499079663 / 20000000000000000 : ℝ) =
            (14222572499079663 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14222572499079663 / 10000000000000000 : ℝ) ≤
            (3522452221276059669639 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7111137060358413 / 10000000000000000 : ℝ)) (q :=
      (14222572499079663 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_618_3 :
    Uω (aρ 3) (bρ 3) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(173821098891361459987 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14127031299558699 / 20000000000000000 : ℝ) ≤
      (-(173821098891361459987 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14127031299558699 / 20000000000000000 : ℝ) =
            (14127031299558699 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14127031299558699 / 10000000000000000 : ℝ) ≤
            (172752491258638540013 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7062991967187449 / 10000000000000000 : ℝ)) (q :=
      (14127031299558699 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_618_4 :
    Uω (aρ 4) (bρ 4) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(179464539245497928923 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1396847765378547 / 2000000000000000 : ℝ) ≤
      (-(179464539245497928923 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1396847765378547 / 2000000000000000 : ℝ) =
            (1396847765378547 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1396847765378547 / 1000000000000000 : ℝ) ≤
            (167109050904502071077 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (349136625123961 / 500000000000000 : ℝ)) (q :=
      (1396847765378547 / 2000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_618_5 :
    Uω (aρ 5) (bρ 5) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(940854976778895516571 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13727351227811363 / 20000000000000000 : ℝ) ≤
      (-(940854976778895516571 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (13727351227811363 / 20000000000000000 : ℝ) =
            (13727351227811363 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13727351227811363 / 10000000000000000 : ℝ) ≤
            (792012973971104483429 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6859795995840113 / 10000000000000000 : ℝ)) (q :=
      (13727351227811363 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_618_6 :
    Uω (aρ 6) (bρ 6) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(803600356250984112259 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3345572179298549 / 5000000000000000 : ℝ) ≤
      (-(803600356250984112259 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3345572179298549 / 5000000000000000 : ℝ) =
            (3345572179298549 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3345572179298549 / 2500000000000000 : ℝ) ≤
            (582694004349015887741 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3340986930181473 / 5000000000000000 : ℝ)) (q :=
      (3345572179298549 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_618_7 :
    Uω (aρ 7) (bρ 7) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(2187434969384649431987 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2582627694795441 / 4000000000000000 : ℝ) ≤
      (-(2187434969384649431987 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2582627694795441 / 4000000000000000 : ℝ) =
            (2582627694795441 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2582627694795441 / 2000000000000000 : ℝ) ≤
            (1278300932115350568013 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1287296999581191 / 2000000000000000 : ℝ)) (q :=
      (2582627694795441 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_618_8 :
    Uω (aρ 8) (bρ 8) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(1214474362038736148431 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12304222897779567 / 20000000000000000 : ℝ) ≤
      (-(1214474362038736148431 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12304222897779567 / 20000000000000000 : ℝ) =
            (12304222897779567 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12304222897779567 / 10000000000000000 : ℝ) ≤
            (518393588711263851569 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6111111073048317 / 10000000000000000 : ℝ)) (q :=
      (12304222897779567 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_618_9 :
    Uω (aρ 9) (bρ 9) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(1373175357305435607103 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11547421096770763 / 20000000000000000 : ℝ) ≤
      (-(1373175357305435607103 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11547421096770763 / 20000000000000000 : ℝ) =
            (11547421096770763 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11547421096770763 / 10000000000000000 : ℝ) ≤
            (359692593444564392897 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5695274900399513 / 10000000000000000 : ℝ)) (q :=
      (11547421096770763 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_618_10 :
    Uω (aρ 10) (bρ 10) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(3153469138497098411407 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2128889608355591 / 4000000000000000 : ℝ) ≤
      (-(3153469138497098411407 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2128889608355591 / 4000000000000000 : ℝ) =
            (2128889608355591 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2128889608355591 / 2000000000000000 : ℝ) ≤
            (312266763002901588593 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1036172175780341 / 2000000000000000 : ℝ)) (q :=
      (2128889608355591 / 4000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_618_11 :
    Uω (aρ 11) (bρ 11) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(7331849876332865554959 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4803765573513503 / 10000000000000000 : ℝ) ≤
      (-(7331849876332865554959 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4803765573513503 / 10000000000000000 : ℝ) =
            (4803765573513503 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4803765573513503 / 2500000000000000 : ℝ) ≤
            (6531093729667134445041 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1140605152588939 / 2500000000000000 : ℝ)) (q :=
      (4803765573513503 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_618_12 :
    Uω (aρ 12) (bρ 12) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(8606904707458635042521 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1057175004768303 / 2500000000000000 : ℝ) ≤
      (-(8606904707458635042521 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1057175004768303 / 2500000000000000 : ℝ) =
            (1057175004768303 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1057175004768303 / 625000000000000 : ℝ) ≤
            (5256038898541364957479 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1917994799080087 / 5000000000000000 : ℝ)) (q :=
      (1057175004768303 / 2500000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_618_13 :
    Uω (aρ 13) (bρ 13) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(2038852069256468634701 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7216039368045631 / 20000000000000000 : ℝ) ≤
      (-(2038852069256468634701 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7216039368045631 / 20000000000000000 : ℝ) =
            (7216039368045631 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7216039368045631 / 5000000000000000 : ℝ) ≤
            (733736651943531365299 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2994010669654381 / 10000000000000000 : ℝ)) (q :=
      (7216039368045631 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_618_14 :
    Uω (aρ 14) (bρ 14) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(3059985522729845712219 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5881066152590859 / 20000000000000000 : ℝ) ≤
      (-(3059985522729845712219 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5881066152590859 / 20000000000000000 : ℝ) =
            (5881066152590859 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5881066152590859 / 5000000000000000 : ℝ) ≤
            (405750378770154287781 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2002964739244609 / 10000000000000000 : ℝ)) (q :=
      (5881066152590859 / 20000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_618_15 :
    Uω (aρ 15) (bρ 15) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(15745009285213127229491 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (517777224673183 / 2500000000000000 : ℝ) ≤
      (-(15745009285213127229491 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (517777224673183 / 2500000000000000 : ℝ) =
            (517777224673183 / 312500000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (517777224673183 / 312500000000000 : ℝ) ≤
            (5049406123786872770509 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (261844830727107 / 5000000000000000 : ℝ)) (q :=
      (517777224673183 / 2500000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15]) (by norm_num [bρ_15])
      (by norm_num) (by norm_num [aρ_15, bρ_15]) (by norm_num [aρ_15, bρ_15]) hlg

lemma U_618_16 :
    Uω (aρ 16) (bρ 16) (5759761335453 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_618 :
    Uρ (5759761335453 / 8000000000000 : ℝ) ≤
      (-(580282206778786842289 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5759761335453 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(337547363029600780631 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5759761335453 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3409019581723940330361 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5759761335453 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(173821098891361459987 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5759761335453 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(179464539245497928923 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5759761335453 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(940854976778895516571 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5759761335453 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(803600356250984112259 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5759761335453 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2187434969384649431987 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5759761335453 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1214474362038736148431 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5759761335453 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1373175357305435607103 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5759761335453 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3153469138497098411407 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5759761335453 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(7331849876332865554959 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5759761335453 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(8606904707458635042521 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5759761335453 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(2038852069256468634701 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5759761335453 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(3059985522729845712219 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5759761335453 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(15745009285213127229491 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5759761335453 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_618_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_619_1 :
    Uω (aρ 1) (bρ 1) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(840533645271613096197 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28578823192531509 / 40000000000000000 : ℝ) ≤
      (-(840533645271613096197 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28578823192531509 / 40000000000000000 : ℝ) =
            (28578823192531509 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28578823192531509 / 20000000000000000 : ℝ) ≤
            (892334305478386903803 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3572341585242721 / 5000000000000000 : ℝ)) (q :=
      (28578823192531509 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_619_2 :
    Uω (aρ 2) (bρ 2) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(1697817751219501552147 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28483241694525251 / 40000000000000000 : ℝ) ≤
      (-(1697817751219501552147 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28483241694525251 / 40000000000000000 : ℝ) =
            (28483241694525251 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28483241694525251 / 20000000000000000 : ℝ) ≤
            (1767918150280498447853 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7120661433992313 / 10000000000000000 : ℝ)) (q :=
      (28483241694525251 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_619_3 :
    Uω (aρ 3) (bρ 3) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(3462946727979391038407 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28292161318114177 / 40000000000000000 : ℝ) ≤
      (-(3462946727979391038407 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28292161318114177 / 40000000000000000 : ℝ) =
            (28292161318114177 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28292161318114177 / 20000000000000000 : ℝ) ≤
            (3468525075020608961593 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (884064669017097 / 1250000000000000 : ℝ)) (q :=
      (28292161318114177 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_619_4 :
    Uω (aρ 4) (bρ 4) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(3575660758809798843429 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5595011882533867 / 8000000000000000 : ℝ) ≤
      (-(3575660758809798843429 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5595011882533867 / 8000000000000000 : ℝ) =
            (5595011882533867 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5595011882533867 / 4000000000000000 : ℝ) ≤
            (3355811044190201156571 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1398452116095871 / 2000000000000000 : ℝ)) (q :=
      (5595011882533867 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_619_5 :
    Uω (aρ 5) (bρ 5) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(3749545789310065404481 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27492819869401271 / 40000000000000000 : ℝ) ≤
      (-(3749545789310065404481 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27492819869401271 / 40000000000000000 : ℝ) =
            (27492819869401271 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27492819869401271 / 20000000000000000 : ℝ) ≤
            (3181926013689934595519 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6869330728180323 / 10000000000000000 : ℝ)) (q :=
      (27492819869401271 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_619_6 :
    Uω (aρ 6) (bρ 6) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(4003758721882345394807 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5360545108355043 / 8000000000000000 : ℝ) ≤
      (-(4003758721882345394807 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5360545108355043 / 8000000000000000 : ℝ) =
            (5360545108355043 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5360545108355043 / 4000000000000000 : ℝ) ≤
            (2927713081117654605193 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1338304787901459 / 2000000000000000 : ℝ)) (q :=
      (5360545108355043 / 8000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_619_7 :
    Uω (aρ 7) (bρ 7) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(872016817370518790959 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25864491543411003 / 40000000000000000 : ℝ) ≤
      (-(872016817370518790959 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25864491543411003 / 40000000000000000 : ℝ) =
            (25864491543411003 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25864491543411003 / 20000000000000000 : ℝ) ≤
            (514277543229481209041 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6446068321085189 / 10000000000000000 : ℝ)) (q :=
      (25864491543411003 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_619_8 :
    Uω (aρ 8) (bρ 8) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(4842325056394238771433 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24646796884573221 / 40000000000000000 : ℝ) ≤
      (-(4842325056394238771433 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24646796884573221 / 40000000000000000 : ℝ) =
            (24646796884573221 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24646796884573221 / 20000000000000000 : ℝ) ≤
            (2089146746605761228567 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3060381321503149 / 5000000000000000 : ℝ)) (q :=
      (24646796884573221 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_619_9 :
    Uω (aρ 9) (bρ 9) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(5475993190011855433897 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23133461862679071 / 40000000000000000 : ℝ) ≤
      (-(5475993190011855433897 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23133461862679071 / 40000000000000000 : ℝ) =
            (23133461862679071 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23133461862679071 / 20000000000000000 : ℝ) ≤
            (1455478612988144566103 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5705060760419223 / 10000000000000000 : ℝ)) (q :=
      (23133461862679071 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_619_10 :
    Uω (aρ 10) (bρ 10) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(6288573075515474583353 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (170624235950307 / 320000000000000 : ℝ) ≤
      (-(6288573075515474583353 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (170624235950307 / 320000000000000 : ℝ) =
            (170624235950307 / 160000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (170624235950307 / 160000000000000 : ℝ) ≤
            (642898727484525416647 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (41527228875751 / 80000000000000 : ℝ)) (q :=
      (170624235950307 / 320000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_619_11 :
    Uω (aρ 11) (bρ 11) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(1827749775245038889841 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19255168987033969 / 40000000000000000 : ℝ) ≤
      (-(1827749775245038889841 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19255168987033969 / 40000000000000000 : ℝ) =
            (19255168987033969 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19255168987033969 / 10000000000000000 : ℝ) ≤
            (1637986126254961110159 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (142904686946771 / 312500000000000 : ℝ)) (q :=
      (19255168987033969 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_619_12 :
    Uω (aρ 12) (bρ 12) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(343284552296869609383 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (16956785409282959 / 40000000000000000 : ℝ) ≤
      (-(343284552296869609383 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (16956785409282959 / 40000000000000000 : ℝ) =
            (16956785409282959 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (16956785409282959 / 10000000000000000 : ℝ) ≤
            (211233191943130390617 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3847458290106167 / 10000000000000000 : ℝ)) (q :=
      (16956785409282959 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_619_13 :
    Uω (aρ 13) (bρ 13) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(1016252133793236407923 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14477957491638911 / 40000000000000000 : ℝ) ≤
      (-(1016252133793236407923 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14477957491638911 / 40000000000000000 : ℝ) =
            (14477957491638911 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14477957491638911 / 10000000000000000 : ℝ) ≤
            (370042226806763592077 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3007426072879143 / 10000000000000000 : ℝ)) (q :=
      (14477957491638911 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_619_14 :
    Uω (aρ 14) (bρ 14) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(12192609767079604075557 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (472717487009481 / 1600000000000000 : ℝ) ≤
      (-(12192609767079604075557 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (472717487009481 / 1600000000000000 : ℝ) =
            (472717487009481 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (472717487009481 / 400000000000000 : ℝ) ≤
            (1670333838920395924443 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1263339499827 / 6250000000000 : ℝ)) (q :=
      (472717487009481 / 1600000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14]) (by norm_num [bρ_14])
      (by norm_num) (by norm_num [aρ_14, bρ_14]) (by norm_num [aρ_14, bρ_14]) hlg

lemma U_619_15 :
    Uω (aρ 15) (bρ 15) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(3893334229564846221071 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8427884246986999 / 40000000000000000 : ℝ) ≤
      (-(3893334229564846221071 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8427884246986999 / 40000000000000000 : ℝ) =
            (8427884246986999 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8427884246986999 / 5000000000000000 : ℝ) ≤
            (1305269622685153778929 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (585890013013187 / 10000000000000000 : ℝ)) (q :=
      (8427884246986999 / 40000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_619_16 :
    Uω (aρ 16) (bρ 16) (23069522060369 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_619 :
    Uρ (23069522060369 / 32000000000000 : ℝ) ≤
      (-(5780568999489780155329 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23069522060369 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(840533645271613096197 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23069522060369 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1697817751219501552147 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23069522060369 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3462946727979391038407 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23069522060369 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3575660758809798843429 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23069522060369 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3749545789310065404481 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23069522060369 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(4003758721882345394807 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23069522060369 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(872016817370518790959 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23069522060369 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4842325056394238771433 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23069522060369 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5475993190011855433897 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23069522060369 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6288573075515474583353 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23069522060369 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1827749775245038889841 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23069522060369 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(343284552296869609383 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23069522060369 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(1016252133793236407923 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23069522060369 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(12192609767079604075557 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23069522060369 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(3893334229564846221071 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23069522060369 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_619_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_620_1 :
    Uω (aρ 1) (bρ 1) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(133952532052508978969 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3577114901402397 / 5000000000000000 : ℝ) ≤
      (-(133952532052508978969 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3577114901402397 / 5000000000000000 : ℝ) =
            (3577114901402397 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3577114901402397 / 2500000000000000 : ℝ) ≤
            (143306340067491021031 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7154207205280213 / 10000000000000000 : ℝ)) (q :=
      (3577114901402397 / 5000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_620_2 :
    Uω (aρ 2) (bρ 2) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(3382269313318846887479 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1426066919437943 / 2000000000000000 : ℝ) ≤
      (-(3382269313318846887479 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1426066919437943 / 2000000000000000 : ℝ) =
            (1426066919437943 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1426066919437943 / 1000000000000000 : ℝ) ≤
            (3549202489681153112521 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1426037161312011 / 2000000000000000 : ℝ)) (q :=
      (1426066919437943 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_620_3 :
    Uω (aρ 3) (bρ 3) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(1724744807306295194459 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1770641251845221 / 2500000000000000 : ℝ) ≤
      (-(1724744807306295194459 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1770641251845221 / 2500000000000000 : ℝ) =
            (1770641251845221 / 1250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1770641251845221 / 1250000000000000 : ℝ) ≤
            (1740991094193704805541 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7082042733292393 / 10000000000000000 : ℝ)) (q :=
      (1770641251845221 / 2500000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_620_4 :
    Uω (aρ 4) (bρ 4) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(1781024646579131442769 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2801316349543653 / 4000000000000000 : ℝ) ≤
      (-(1781024646579131442769 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2801316349543653 / 4000000000000000 : ℝ) =
            (2801316349543653 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2801316349543653 / 2000000000000000 : ℝ) ≤
            (1684711254920868557231 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (700178864731389 / 1000000000000000 : ℝ)) (q :=
      (2801316349543653 / 4000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_620_5 :
    Uω (aρ 5) (bρ 5) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(233480682225324909683 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13765468611784181 / 20000000000000000 : ℝ) ≤
      (-(233480682225324909683 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (13765468611784181 / 20000000000000000 : ℝ) =
            (13765468611784181 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13765468611784181 / 10000000000000000 : ℝ) ≤
            (199736305462175090317 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3439432715357403 / 5000000000000000 : ℝ)) (q :=
      (13765468611784181 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_620_6 :
    Uω (aρ 6) (bρ 6) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(124672999234403041657 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2684087350055289 / 4000000000000000 : ℝ) ≤
      (-(124672999234403041657 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2684087350055289 / 4000000000000000 : ℝ) =
            (2684087350055289 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2684087350055289 / 2000000000000000 : ℝ) ≤
            (91935494609346958343 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (670107394434707 / 1000000000000000 : ℝ)) (q :=
      (2684087350055289 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_620_7 :
    Uω (aρ 7) (bρ 7) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(543165025054239187137 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (404729777930469 / 625000000000000 : ℝ) ≤
      (-(543165025054239187137 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (404729777930469 / 625000000000000 : ℝ) =
            (404729777930469 / 312500000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (404729777930469 / 312500000000000 : ℝ) ≤
            (323268950320760812863 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6455651468605633 / 10000000000000000 : ℝ)) (q :=
      (404729777930469 / 625000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_620_8 :
    Uω (aρ 8) (bρ 8) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(2413388600116685197157 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12342573587683343 / 20000000000000000 : ℝ) ≤
      (-(2413388600116685197157 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12342573587683343 / 20000000000000000 : ℝ) =
            (12342573587683343 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12342573587683343 / 10000000000000000 : ℝ) ≤
            (1052347301383314802843 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (383150863365873 / 625000000000000 : ℝ)) (q :=
      (12342573587683343 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_620_9 :
    Uω (aρ 9) (bρ 9) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(1364828396129223884731 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11586039881026203 / 20000000000000000 : ℝ) ≤
      (-(1364828396129223884731 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11586039881026203 / 20000000000000000 : ℝ) =
            (11586039881026203 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11586039881026203 / 10000000000000000 : ℝ) ≤
            (368039554620776115269 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1428711433889207 / 2500000000000000 : ℝ)) (q :=
      (11586039881026203 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_620_10 :
    Uω (aρ 10) (bρ 10) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(3135121683520498290713 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10683579500375607 / 20000000000000000 : ℝ) ≤
      (-(3135121683520498290713 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10683579500375607 / 20000000000000000 : ℝ) =
            (10683579500375607 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10683579500375607 / 10000000000000000 : ℝ) ≤
            (330614217979501709287 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (325059024275077 / 625000000000000 : ℝ)) (q :=
      (10683579500375607 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_620_11 :
    Uω (aρ 11) (bρ 11) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(3645098135037624419509 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9647633441254317 / 20000000000000000 : ℝ) ≤
      (-(3645098135037624419509 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9647633441254317 / 20000000000000000 : ℝ) =
            (9647633441254317 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9647633441254317 / 5000000000000000 : ℝ) ≤
            (3286373667962375580491 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2291737477742471 / 5000000000000000 : ℝ)) (q :=
      (9647633441254317 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_620_12 :
    Uω (aρ 12) (bρ 12) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(8557396661480946125929 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8499374791807127 / 20000000000000000 : ℝ) ≤
      (-(8557396661480946125929 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8499374791807127 / 20000000000000000 : ℝ) =
            (8499374791807127 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8499374791807127 / 5000000000000000 : ℝ) ≤
            (5305546944519053874071 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (60295568792543 / 156250000000000 : ℝ)) (q :=
      (8499374791807127 / 20000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_620_13 :
    Uω (aρ 13) (bρ 13) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(506546171996047407941 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7261888573088961 / 20000000000000000 : ℝ) ≤
      (-(506546171996047407941 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7261888573088961 / 20000000000000000 : ℝ) =
            (7261888573088961 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7261888573088961 / 5000000000000000 : ℝ) ≤
            (186601008303952592059 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1510405962799793 / 5000000000000000 : ℝ)) (q :=
      (7261888573088961 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_620_14 :
    Uω (aρ 14) (bρ 14) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(12145704453235629212067 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5936749893837629 / 20000000000000000 : ℝ) ≤
      (-(12145704453235629212067 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5936749893837629 / 20000000000000000 : ℝ) =
            (5936749893837629 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5936749893837629 / 5000000000000000 : ℝ) ≤
            (1717239152764370787933 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1019800265696627 / 5000000000000000 : ℝ)) (q :=
      (5936749893837629 / 20000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_620_15 :
    Uω (aρ 15) (bρ 15) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(15418235905060781715109 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4279810283251159 / 20000000000000000 : ℝ) ≤
      (-(15418235905060781715109 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4279810283251159 / 20000000000000000 : ℝ) =
            (4279810283251159 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4279810283251159 / 2500000000000000 : ℝ) ≤
            (5376179503939218284891 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (80279274777723 / 1250000000000000 : ℝ)) (q :=
      (4279810283251159 / 20000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_620_16 :
    Uω (aρ 16) (bρ 16) (11549999389463 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_620 :
    Uρ (11549999389463 / 16000000000000 : ℝ) ≤
      (-(71985901044622510087 / 125000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11549999389463 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(133952532052508978969 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11549999389463 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3382269313318846887479 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11549999389463 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1724744807306295194459 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11549999389463 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1781024646579131442769 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11549999389463 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(233480682225324909683 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11549999389463 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(124672999234403041657 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11549999389463 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(543165025054239187137 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11549999389463 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2413388600116685197157 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11549999389463 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1364828396129223884731 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11549999389463 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(3135121683520498290713 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11549999389463 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3645098135037624419509 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11549999389463 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(8557396661480946125929 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11549999389463 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) * (-(506546171996047407941 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11549999389463 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(12145704453235629212067 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11549999389463 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(15418235905060781715109 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11549999389463 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_620_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_621_1 :
    Uω (aρ 1) (bρ 1) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(667101948738974140143 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28655015229586461 / 40000000000000000 : ℝ) ≤
      (-(667101948738974140143 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28655015229586461 / 40000000000000000 : ℝ) =
            (28655015229586461 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28655015229586461 / 20000000000000000 : ℝ) ≤
            (719192411861025859857 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7163731239914793 / 10000000000000000 : ℝ)) (q :=
      (28655015229586461 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_621_2 :
    Uω (aρ 2) (bρ 2) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(3368920966598643556611 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28559435080868687 / 40000000000000000 : ℝ) ≤
      (-(3368920966598643556611 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28559435080868687 / 40000000000000000 : ℝ) =
            (28559435080868687 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28559435080868687 / 20000000000000000 : ℝ) ≤
            (3562550836401356443389 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3569855089032953 / 5000000000000000 : ℝ)) (q :=
      (28559435080868687 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_621_3 :
    Uω (aρ 3) (bρ 3) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(214753161810318558973 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28368358733376049 / 40000000000000000 : ℝ) ≤
      (-(214753161810318558973 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28368358733376049 / 40000000000000000 : ℝ) =
            (28368358733376049 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28368358733376049 / 20000000000000000 : ℝ) ≤
            (218463825877181441027 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7091568110669587 / 10000000000000000 : ℝ)) (q :=
      (28368358733376049 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_621_4 :
    Uω (aρ 4) (bρ 4) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(709691267490747128891 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28051267555963567 / 40000000000000000 : ℝ) ≤
      (-(709691267490747128891 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28051267555963567 / 40000000000000000 : ℝ) =
            (28051267555963567 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28051267555963567 / 20000000000000000 : ℝ) ≤
            (676603093109252871109 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3505658351514173 / 5000000000000000 : ℝ)) (q :=
      (28051267555963567 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_621_5 :
    Uω (aρ 5) (bρ 5) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(3721855232630060188191 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5513810903674307 / 8000000000000000 : ℝ) ≤
      (-(3721855232630060188191 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5513810903674307 / 8000000000000000 : ℝ) =
            (5513810903674307 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5513810903674307 / 4000000000000000 : ℝ) ≤
            (3209616570369939811809 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (688840010356733 / 1000000000000000 : ℝ)) (q :=
      (5513810903674307 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_621_6 :
    Uω (aρ 6) (bρ 6) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(1987666742048291147841 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26879021311355879 / 40000000000000000 : ℝ) ≤
      (-(1987666742048291147841 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (26879021311355879 / 40000000000000000 : ℝ) =
            (26879021311355879 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26879021311355879 / 20000000000000000 : ℝ) ≤
            (1478069159451708852159 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3355311937599751 / 5000000000000000 : ℝ)) (q :=
      (26879021311355879 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_621_7 :
    Uω (aρ 7) (bρ 7) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(4330578213947306030187 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25940919681933677 / 40000000000000000 : ℝ) ≤
      (-(4330578213947306030187 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25940919681933677 / 40000000000000000 : ℝ) =
            (25940919681933677 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25940919681933677 / 20000000000000000 : ℝ) ≤
            (2600893589052693969813 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6465234441248401 / 10000000000000000 : ℝ)) (q :=
      (25940919681933677 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_621_8 :
    Uω (aρ 8) (bρ 8) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(4811253801470739519341 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24723496671703543 / 40000000000000000 : ℝ) ≤
      (-(4811253801470739519341 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24723496671703543 / 40000000000000000 : ℝ) =
            (24723496671703543 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24723496671703543 / 20000000000000000 : ℝ) ≤
            (2120218001529260480659 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3070032293736667 / 5000000000000000 : ℝ)) (q :=
      (24723496671703543 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_621_9 :
    Uω (aρ 9) (bρ 9) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(1360665628048339499749 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23210695900736581 / 40000000000000000 : ℝ) ≤
      (-(1360665628048339499749 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23210695900736581 / 40000000000000000 : ℝ) =
            (23210695900736581 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23210695900736581 / 20000000000000000 : ℝ) ≤
            (372202322701660500251 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5724629830349853 / 10000000000000000 : ℝ)) (q :=
      (23210695900736581 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_621_10 :
    Uω (aρ 10) (bρ 10) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(1562987251951932787287 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21406284627007463 / 40000000000000000 : ℝ) ≤
      (-(1562987251951932787287 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21406284627007463 / 40000000000000000 : ℝ) =
            (21406284627007463 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21406284627007463 / 20000000000000000 : ℝ) ≤
            (169880698798067212713 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2605491613490147 / 5000000000000000 : ℝ)) (q :=
      (21406284627007463 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_621_11 :
    Uω (aρ 11) (bρ 11) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(726944114380871616587 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19335356040944007 / 40000000000000000 : ℝ) ≤
      (-(726944114380871616587 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19335356040944007 / 40000000000000000 : ℝ) =
            (19335356040944007 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19335356040944007 / 10000000000000000 : ℝ) ≤
            (659350246219128383413 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2296997780076783 / 5000000000000000 : ℝ)) (q :=
      (19335356040944007 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_621_12 :
    Uω (aρ 12) (bρ 12) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(8532752764931727160707 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17040692787205723 / 40000000000000000 : ℝ) ≤
      (-(8532752764931727160707 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17040692787205723 / 40000000000000000 : ℝ) =
            (17040692787205723 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17040692787205723 / 10000000000000000 : ℝ) ≤
            (5330190841068272839293 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (241897751873089 / 625000000000000 : ℝ)) (q :=
      (17040692787205723 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_621_13 :
    Uω (aρ 13) (bρ 13) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(5049732549018707484119 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14569538481916747 / 40000000000000000 : ℝ) ≤
      (-(5049732549018707484119 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14569538481916747 / 40000000000000000 : ℝ) =
            (14569538481916747 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14569538481916747 / 10000000000000000 : ℝ) ≤
            (1881739253981292515881 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1481527645957 / 4882812500000 : ℝ)) (q :=
      (14569538481916747 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_621_14 :
    Uω (aρ 14) (bρ 14) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(12099215801753549008383 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11928826590805561 / 40000000000000000 : ℝ) ≤
      (-(12099215801753549008383 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (11928826590805561 / 40000000000000000 : ℝ) =
            (11928826590805561 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11928826590805561 / 10000000000000000 : ℝ) ≤
            (1763727804246450991617 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2057739958409343 / 10000000000000000 : ℝ)) (q :=
      (11928826590805561 / 40000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_621_15 :
    Uω (aρ 15) (bρ 15) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(1909462497718683193977 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1736499912346799 / 8000000000000000 : ℝ) ≤
      (-(1909462497718683193977 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (1736499912346799 / 8000000000000000 : ℝ) =
            (1736499912346799 / 1000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1736499912346799 / 1000000000000000 : ℝ) ≤
            (689839428406316806023 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (8676871516107 / 125000000000000 : ℝ)) (q :=
      (1736499912346799 / 8000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_621_16 :
    Uω (aρ 16) (bρ 16) (23130475497483 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_621 :
    Uρ (23130475497483 / 32000000000000 : ℝ) ≤
      (-(1147521724675301463431 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23130475497483 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(667101948738974140143 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23130475497483 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3368920966598643556611 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23130475497483 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(214753161810318558973 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23130475497483 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(709691267490747128891 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23130475497483 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3721855232630060188191 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23130475497483 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1987666742048291147841 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23130475497483 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4330578213947306030187 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23130475497483 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4811253801470739519341 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23130475497483 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1360665628048339499749 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23130475497483 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1562987251951932787287 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23130475497483 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(726944114380871616587 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23130475497483 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(8532752764931727160707 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23130475497483 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(5049732549018707484119 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23130475497483 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(12099215801753549008383 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23130475497483 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(1909462497718683193977 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23130475497483 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_621_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_622_1 :
    Uω (aρ 1) (bρ 1) (579023805401 / 800000000000 : ℝ) ≤
      (-(664444772228277286747 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14346555623817321 / 20000000000000000 : ℝ) ≤
      (-(664444772228277286747 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14346555623817321 / 20000000000000000 : ℝ) =
            (14346555623817321 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14346555623817321 / 10000000000000000 : ℝ) ≤
            (721849588371722713253 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7173255274389821 / 10000000000000000 : ℝ)) (q :=
      (14346555623817321 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_622_2 :
    Uω (aρ 2) (bρ 2) (579023805401 / 800000000000 : ℝ) ≤
      (-(1677795207352304648309 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14298765885431609 / 20000000000000000 : ℝ) ≤
      (-(1677795207352304648309 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14298765885431609 / 20000000000000000 : ℝ) =
            (14298765885431609 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14298765885431609 / 10000000000000000 : ℝ) ≤
            (1787940694147695351691 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7149234548514109 / 10000000000000000 : ℝ)) (q :=
      (14298765885431609 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_622_3 :
    Uω (aρ 3) (bρ 3) (579023805401 / 800000000000 : ℝ) ≤
      (-(3422629602471597769299 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14203228714851061 / 20000000000000000 : ℝ) ≤
      (-(3422629602471597769299 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14203228714851061 / 20000000000000000 : ℝ) =
            (14203228714851061 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14203228714851061 / 10000000000000000 : ℝ) ≤
            (3508842200528402230701 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7101093484283561 / 10000000000000000 : ℝ)) (q :=
      (14203228714851061 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_622_4 :
    Uω (aρ 4) (bρ 4) (579023805401 / 800000000000 : ℝ) ≤
      (-(17674409207002628977 / 50000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7022342898585249 / 10000000000000000 : ℝ) ≤
      (-(17674409207002628977 / 50000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7022342898585249 / 10000000000000000 : ℝ) =
            (7022342898585249 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7022342898585249 / 5000000000000000 : ℝ) ≤
            (16982949807997371023 / 50000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3510422373833999 / 5000000000000000 : ℝ)) (q :=
      (7022342898585249 / 10000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_622_5 :
    Uω (aρ 5) (bρ 5) (579023805401 / 800000000000 : ℝ) ≤
      (-(23175241795223090519 / 62500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6901792938514239 / 10000000000000000 : ℝ) ≤
      (-(23175241795223090519 / 62500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6901792938514239 / 10000000000000000 : ℝ) =
            (6901792938514239 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6901792938514239 / 5000000000000000 : ℝ) ≤
            (20146456973526909481 / 62500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3448967373430489 / 5000000000000000 : ℝ)) (q :=
      (6901792938514239 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_622_6 :
    Uω (aρ 6) (bρ 6) (579023805401 / 800000000000 : ℝ) ≤
      (-(1980575594952124207391 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13458584487407519 / 20000000000000000 : ℝ) ≤
      (-(1980575594952124207391 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (13458584487407519 / 20000000000000000 : ℝ) =
            (13458584487407519 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13458584487407519 / 10000000000000000 : ℝ) ≤
            (1485160306547875792609 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6720173732380019 / 10000000000000000 : ℝ)) (q :=
      (13458584487407519 / 20000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_622_7 :
    Uω (aρ 7) (bρ 7) (579023805401 / 800000000000 : ℝ) ≤
      (-(4315858062121709975551 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12989566614057469 / 20000000000000000 : ℝ) ≤
      (-(4315858062121709975551 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12989566614057469 / 20000000000000000 : ℝ) =
            (12989566614057469 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12989566614057469 / 10000000000000000 : ℝ) ≤
            (2615613740878290024449 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6474817239789969 / 10000000000000000 : ℝ)) (q :=
      (12989566614057469 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_622_8 :
    Uω (aρ 8) (bρ 8) (579023805401 / 800000000000 : ℝ) ≤
      (-(119893869557067372297 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12380922688662013 / 20000000000000000 : ℝ) ≤
      (-(119893869557067372297 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12380922688662013 / 20000000000000000 : ℝ) =
            (12380922688662013 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12380922688662013 / 10000000000000000 : ℝ) ≤
            (53392925517932627703 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6149714965734513 / 10000000000000000 : ℝ)) (q :=
      (12380922688662013 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_622_9 :
    Uω (aρ 9) (bρ 9) (579023805401 / 800000000000 : ℝ) ≤
      (-(5426039873039151492967 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11624655143871947 / 20000000000000000 : ℝ) ≤
      (-(5426039873039151492967 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11624655143871947 / 20000000000000000 : ℝ) =
            (11624655143871947 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11624655143871947 / 10000000000000000 : ℝ) ≤
            (1505431929960848507033 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5734413049304447 / 10000000000000000 : ℝ)) (q :=
      (11624655143871947 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_622_10 :
    Uω (aρ 10) (bρ 10) (579023805401 / 800000000000 : ℝ) ≤
      (-(6233689854961697792241 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (536135159873557 / 1000000000000000 : ℝ) ≤
      (-(6233689854961697792241 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (536135159873557 / 1000000000000000 : ℝ) =
            (536135159873557 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (536135159873557 / 500000000000000 : ℝ) ≤
            (697781948038302207759 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (65262751704983 / 125000000000000 : ℝ)) (q :=
      (536135159873557 / 1000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_622_11 :
    Uω (aρ 11) (bρ 11) (579023805401 / 800000000000 : ℝ) ≤
      (-(906091685536126654847 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9687718261114239 / 20000000000000000 : ℝ) ≤
      (-(906091685536126654847 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9687718261114239 / 20000000000000000 : ℝ) =
            (9687718261114239 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9687718261114239 / 5000000000000000 : ℝ) ≤
            (826776265213873345153 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4604511826246739 / 10000000000000000 : ℝ)) (q :=
      (9687718261114239 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_622_12 :
    Uω (aρ 12) (bρ 12) (579023805401 / 800000000000 : ℝ) ≤
      (-(1063522702341544572123 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1708261520558867 / 4000000000000000 : ℝ) ≤
      (-(1063522702341544572123 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1708261520558867 / 4000000000000000 : ℝ) =
            (1708261520558867 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1708261520558867 / 1000000000000000 : ℝ) ≤
            (669345248408455427877 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (776360252922367 / 2000000000000000 : ℝ)) (q :=
      (1708261520558867 / 4000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_622_13 :
    Uω (aρ 13) (bρ 13) (579023805401 / 800000000000 : ℝ) ≤
      (-(10068144786604213098637 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7307621132830777 / 20000000000000000 : ℝ) ≤
      (-(10068144786604213098637 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7307621132830777 / 20000000000000000 : ℝ) =
            (7307621132830777 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7307621132830777 / 5000000000000000 : ℝ) ≤
            (3794798819395786901363 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3047496536243277 / 10000000000000000 : ℝ)) (q :=
      (7307621132830777 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_622_14 :
    Uω (aρ 14) (bρ 14) (579023805401 / 800000000000 : ℝ) ≤
      (-(753320867564564560021 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5991961883306781 / 20000000000000000 : ℝ) ≤
      (-(753320867564564560021 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5991961883306781 / 20000000000000000 : ℝ) =
            (5991961883306781 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5991961883306781 / 5000000000000000 : ℝ) ≤
            (113113107810435439979 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2075764571764281 / 10000000000000000 : ℝ)) (q :=
      (5991961883306781 / 20000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_622_15 :
    Uω (aρ 15) (bρ 15) (579023805401 / 800000000000 : ℝ) ≤
      (-(15143118237455441992627 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2199595035106191 / 10000000000000000 : ℝ) ≤
      (-(15143118237455441992627 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2199595035106191 / 10000000000000000 : ℝ) =
            (2199595035106191 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2199595035106191 / 1250000000000000 : ℝ) ≤
            (5651297171544558007373 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (371283018042441 / 5000000000000000 : ℝ)) (q :=
      (2199595035106191 / 10000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_622_16 :
    Uω (aρ 16) (bρ 16) (579023805401 / 800000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_622 :
    Uρ (579023805401 / 800000000000 : ℝ) ≤
      (-(1429174612416460317899 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (579023805401 / 800000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(664444772228277286747 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (579023805401 / 800000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1677795207352304648309 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (579023805401 / 800000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3422629602471597769299 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (579023805401 / 800000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) * (-(17674409207002628977 / 50000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (579023805401 / 800000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(23175241795223090519 / 62500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (579023805401 / 800000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1980575594952124207391 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (579023805401 / 800000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4315858062121709975551 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (579023805401 / 800000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(119893869557067372297 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (579023805401 / 800000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5426039873039151492967 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (579023805401 / 800000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6233689854961697792241 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (579023805401 / 800000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(906091685536126654847 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (579023805401 / 800000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1063522702341544572123 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (579023805401 / 800000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(10068144786604213098637 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (579023805401 / 800000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) * (-(753320867564564560021 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (579023805401 / 800000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(15143118237455441992627 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (579023805401 / 800000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_622_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_623_1 :
    Uω (aρ 1) (bρ 1) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(3308955606748218408403 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28731207265364987 / 40000000000000000 : ℝ) ≤
      (-(3308955606748218408403 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28731207265364987 / 40000000000000000 : ℝ) =
            (28731207265364987 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28731207265364987 / 20000000000000000 : ℝ) ≤
            (3622516196251781591597 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7182779308705931 / 10000000000000000 : ℝ)) (q :=
      (28731207265364987 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_623_2 :
    Uω (aρ 2) (bρ 2) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(835569402563246451051 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5727125691750179 / 8000000000000000 : ℝ) ≤
      (-(835569402563246451051 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5727125691750179 / 8000000000000000 : ℝ) =
            (5727125691750179 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5727125691750179 / 4000000000000000 : ℝ) ≤
            (897298548186753548949 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1431751783581777 / 2000000000000000 : ℝ)) (q :=
      (5727125691750179 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_623_3 :
    Uω (aρ 3) (bρ 3) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(3409226606762139118281 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28444556118532007 / 40000000000000000 : ℝ) ≤
      (-(3409226606762139118281 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28444556118532007 / 40000000000000000 : ℝ) =
            (28444556118532007 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28444556118532007 / 20000000000000000 : ℝ) ≤
            (3522245196237860881719 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7110618854149441 / 10000000000000000 : ℝ)) (q :=
      (28444556118532007 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_623_4 :
    Uω (aρ 4) (bρ 4) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(3521325754907749846863 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28127475610658871 / 40000000000000000 : ℝ) ≤
      (-(3521325754907749846863 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28127475610658871 / 40000000000000000 : ℝ) =
            (28127475610658871 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28127475610658871 / 20000000000000000 : ℝ) ≤
            (3410146048092250153137 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7030372781277873 / 10000000000000000 : ℝ)) (q :=
      (28127475610658871 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_623_5 :
    Uω (aρ 5) (bρ 5) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(461780153311734872569 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5529057786173887 / 8000000000000000 : ℝ) ≤
      (-(461780153311734872569 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5529057786173887 / 8000000000000000 : ℝ) =
            (5529057786173887 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5529057786173887 / 4000000000000000 : ℝ) ≤
            (404653822063265127431 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1381493872143631 / 2000000000000000 : ℝ)) (q :=
      (5529057786173887 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_623_6 :
    Uω (aρ 6) (bρ 6) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(3946989035406164734171 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26955316491557633 / 40000000000000000 : ℝ) ≤
      (-(3946989035406164734171 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (26955316491557633 / 40000000000000000 : ℝ) =
            (26955316491557633 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26955316491557633 / 20000000000000000 : ℝ) ≤
            (2984482767593835265829 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3364861758101127 / 5000000000000000 : ℝ)) (q :=
      (26955316491557633 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_623_7 :
    Uω (aρ 7) (bρ 7) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(4301159679979176426909 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26017346427637547 / 40000000000000000 : ℝ) ≤
      (-(4301159679979176426909 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (26017346427637547 / 40000000000000000 : ℝ) =
            (26017346427637547 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26017346427637547 / 20000000000000000 : ℝ) ≤
            (2630312123020823573091 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6484399865002211 / 10000000000000000 : ℝ)) (q :=
      (26017346427637547 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_623_8 :
    Uω (aρ 8) (bρ 8) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(4780280065221076428117 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24800193295944771 / 40000000000000000 : ℝ) ≤
      (-(4780280065221076428117 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24800193295944771 / 40000000000000000 : ℝ) =
            (24800193295944771 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24800193295944771 / 20000000000000000 : ℝ) ≤
            (2151191737778923571883 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6159364950495823 / 10000000000000000 : ℝ)) (q :=
      (24800193295944771 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_623_9 :
    Uω (aρ 9) (bρ 9) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(5409445567589630971793 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23287922932024447 / 40000000000000000 : ℝ) ≤
      (-(5409445567589630971793 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23287922932024447 / 40000000000000000 : ℝ) =
            (23287922932024447 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23287922932024447 / 20000000000000000 : ℝ) ≤
            (1522026235410369028207 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5744195396895661 / 10000000000000000 : ℝ)) (q :=
      (23287922932024447 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_623_10 :
    Uω (aρ 10) (bρ 10) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(6215465766550052784111 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4296904865352947 / 8000000000000000 : ℝ) ≤
      (-(6215465766550052784111 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4296904865352947 / 8000000000000000 : ℝ) =
            (4296904865352947 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4296904865352947 / 4000000000000000 : ℝ) ≤
            (716006036449947215889 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1046211025552161 / 2000000000000000 : ℝ)) (q :=
      (4296904865352947 / 8000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_623_11 :
    Uω (aρ 11) (bρ 11) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(903509131940136337699 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3883101677135997 / 8000000000000000 : ℝ) ≤
      (-(903509131940136337699 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3883101677135997 / 8000000000000000 : ℝ) =
            (3883101677135997 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3883101677135997 / 2000000000000000 : ℝ) ≤
            (829358818809863662301 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (461502378342343 / 1000000000000000 : ℝ)) (q :=
      (3883101677135997 / 8000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_623_12 :
    Uω (aρ 12) (bρ 12) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(848368272941469264369 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17124517021946789 / 40000000000000000 : ℝ) ≤
      (-(848368272941469264369 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17124517021946789 / 40000000000000000 : ℝ) =
            (17124517021946789 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17124517021946789 / 10000000000000000 : ℝ) ≤
            (537926087658530735631 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (486653524780229 / 1250000000000000 : ℝ)) (q :=
      (17124517021946789 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_623_13 :
    Uω (aρ 13) (bρ 13) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(5018480503871485516127 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14660889249224863 / 40000000000000000 : ℝ) ≤
      (-(5018480503871485516127 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14660889249224863 / 40000000000000000 : ℝ) =
            (14660889249224863 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14660889249224863 / 10000000000000000 : ℝ) ≤
            (1912991299128514483873 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3060796053475869 / 10000000000000000 : ℝ)) (q :=
      (14660889249224863 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_623_14 :
    Uω (aρ 14) (bρ 14) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(12007449152369101586589 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12038797245736077 / 40000000000000000 : ℝ) ≤
      (-(12007449152369101586589 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12038797245736077 / 40000000000000000 : ℝ) =
            (12038797245736077 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12038797245736077 / 10000000000000000 : ℝ) ≤
            (1855494453630898413411 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (523419334194119 / 2500000000000000 : ℝ)) (q :=
      (12038797245736077 / 40000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_623_15 :
    Uω (aρ 15) (bρ 15) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(15018676704649794032253 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8908552611326413 / 40000000000000000 : ℝ) ≤
      (-(15018676704649794032253 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (8908552611326413 / 40000000000000000 : ℝ) =
            (8908552611326413 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8908552611326413 / 5000000000000000 : ℝ) ≤
            (5775738704350205967747 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (197032074246661 / 2500000000000000 : ℝ)) (q :=
      (8908552611326413 / 40000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_623_16 :
    Uω (aρ 16) (bρ 16) (23191428934597 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_623 :
    Uρ (23191428934597 / 32000000000000 : ℝ) ≤
      (-(5696085690247323872273 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23191428934597 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3308955606748218408403 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23191428934597 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(835569402563246451051 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23191428934597 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3409226606762139118281 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23191428934597 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3521325754907749846863 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23191428934597 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(461780153311734872569 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23191428934597 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3946989035406164734171 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23191428934597 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4301159679979176426909 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23191428934597 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4780280065221076428117 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23191428934597 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5409445567589630971793 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23191428934597 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6215465766550052784111 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23191428934597 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(903509131940136337699 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23191428934597 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(848368272941469264369 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23191428934597 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(5018480503871485516127 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23191428934597 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(12007449152369101586589 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23191428934597 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(15018676704649794032253 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23191428934597 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_623_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_624_1 :
    Uω (aρ 1) (bρ 1) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(3295704933797769085771 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (719232582069469 / 1000000000000000 : ℝ) ≤
      (-(3295704933797769085771 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (719232582069469 / 1000000000000000 : ℝ) =
            (719232582069469 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (719232582069469 / 500000000000000 : ℝ) ≤
            (3635766869202230914229 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1438460668572751 / 2000000000000000 : ℝ)) (q :=
      (719232582069469 / 1000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_624_2 :
    Uω (aρ 2) (bρ 2) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(665796501209805653239 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (716843128613503 / 1000000000000000 : ℝ) ≤
      (-(665796501209805653239 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (716843128613503 / 1000000000000000 : ℝ) =
            (716843128613503 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (716843128613503 / 500000000000000 : ℝ) ≤
            (720497859390194346761 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1433656657250887 / 2000000000000000 : ℝ)) (q :=
      (716843128613503 / 1000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_624_3 :
    Uω (aρ 3) (bρ 3) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(3395841553661085159127 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7120663699973947 / 10000000000000000 : ℝ) ≤
      (-(3395841553661085159127 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7120663699973947 / 10000000000000000 : ℝ) =
            (7120663699973947 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7120663699973947 / 5000000000000000 : ℝ) ≤
            (3535630249338914840873 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7120144220282269 / 10000000000000000 : ℝ)) (q :=
      (7120663699973947 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_624_4 :
    Uω (aρ 4) (bρ 4) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(3507788028088219534127 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14082789802503379 / 20000000000000000 : ℝ) ≤
      (-(3507788028088219534127 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14082789802503379 / 20000000000000000 : ℝ) =
            (14082789802503379 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14082789802503379 / 10000000000000000 : ℝ) ≤
            (3423683774911780465873 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3519950401951377 / 5000000000000000 : ℝ)) (q :=
      (14082789802503379 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_624_5 :
    Uω (aρ 5) (bρ 5) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(3680462797695905282609 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6920851512263107 / 10000000000000000 : ℝ) ≤
      (-(3680462797695905282609 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6920851512263107 / 10000000000000000 : ℝ) =
            (6920851512263107 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6920851512263107 / 5000000000000000 : ℝ) ≤
            (3251009005304094717391 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6917003945260589 / 10000000000000000 : ℝ)) (q :=
      (6920851512263107 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_624_6 :
    Uω (aρ 6) (bρ 6) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(1966423481665302052459 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6748365965551843 / 10000000000000000 : ℝ) ≤
      (-(1966423481665302052459 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6748365965551843 / 10000000000000000 : ℝ) =
            (6748365965551843 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6748365965551843 / 5000000000000000 : ℝ) ≤
            (1499312419834697947541 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6739273226978061 / 10000000000000000 : ℝ)) (q :=
      (6748365965551843 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_624_7 :
    Uω (aρ 7) (bρ 7) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(2143241501416554488787 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2605555928203611 / 4000000000000000 : ℝ) ≤
      (-(2143241501416554488787 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2605555928203611 / 4000000000000000 : ℝ) =
            (2605555928203611 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2605555928203611 / 2000000000000000 : ℝ) ≤
            (1322494400083445511213 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (649398231765243 / 1000000000000000 : ℝ)) (q :=
      (2605555928203611 / 4000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_624_8 :
    Uω (aρ 8) (bρ 8) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(4764829573210770707701 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12419270215629507 / 20000000000000000 : ℝ) ≤
      (-(4764829573210770707701 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12419270215629507 / 20000000000000000 : ℝ) =
            (12419270215629507 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12419270215629507 / 10000000000000000 : ℝ) ≤
            (2166642229789229292299 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3084507271801941 / 5000000000000000 : ℝ)) (q :=
      (12419270215629507 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_624_9 :
    Uω (aρ 9) (bρ 9) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(5392879496913676081697 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5831633460616669 / 10000000000000000 : ℝ) ≤
      (-(5392879496913676081697 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5831633460616669 / 10000000000000000 : ℝ) =
            (5831633460616669 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5831633460616669 / 5000000000000000 : ℝ) ≤
            (1538592306086323918303 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5753976877567713 / 10000000000000000 : ℝ)) (q :=
      (5831633460616669 / 10000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_624_10 :
    Uω (aρ 10) (bρ 10) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(1549319150378315990693 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2690454805563697 / 5000000000000000 : ℝ) ≤
      (-(1549319150378315990693 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2690454805563697 / 5000000000000000 : ℝ) =
            (2690454805563697 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2690454805563697 / 2500000000000000 : ℝ) ≤
            (183548800371684009307 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5241088212084163 / 10000000000000000 : ℝ)) (q :=
      (2690454805563697 / 5000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_624_11 :
    Uω (aρ 11) (bρ 11) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(7207459623385319839303 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9727785845026523 / 20000000000000000 : ℝ) ≤
      (-(7207459623385319839303 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9727785845026523 / 20000000000000000 : ℝ) =
            (9727785845026523 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9727785845026523 / 5000000000000000 : ℝ) ≤
            (6655483982614680160697 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2312765730530449 / 5000000000000000 : ℝ)) (q :=
      (9727785845026523 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_624_12 :
    Uω (aρ 12) (bρ 12) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(1691851121799353991287 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8583199208577703 / 20000000000000000 : ℝ) ≤
      (-(1691851121799353991287 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8583199208577703 / 20000000000000000 : ℝ) =
            (8583199208577703 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8583199208577703 / 5000000000000000 : ℝ) ≤
            (1080737599400646008713 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1952322460648539 / 5000000000000000 : ℝ)) (q :=
      (8583199208577703 / 20000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_624_13 :
    Uω (aρ 13) (bρ 13) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(2501478072666182089101 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1838310021227563 / 5000000000000000 : ℝ) ≤
      (-(2501478072666182089101 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1838310021227563 / 5000000000000000 : ℝ) =
            (1838310021227563 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1838310021227563 / 1250000000000000 : ℝ) ≤
            (964257828833817910899 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3074067539224627 / 10000000000000000 : ℝ)) (q :=
      (1838310021227563 / 5000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_624_14 :
    Uω (aρ 14) (bρ 14) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(11962152448444704526753 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6046726360687117 / 20000000000000000 : ℝ) ≤
      (-(11962152448444704526753 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6046726360687117 / 20000000000000000 : ℝ) =
            (6046726360687117 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6046726360687117 / 5000000000000000 : ℝ) ≤
            (1900791157555295473247 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (527870275011623 / 2500000000000000 : ℝ)) (q :=
      (6046726360687117 / 20000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_624_15 :
    Uω (aρ 15) (bρ 15) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(14901054336295950917693 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4506977895184479 / 20000000000000000 : ℝ) ≤
      (-(14901054336295950917693 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (4506977895184479 / 20000000000000000 : ℝ) =
            (4506977895184479 / 2500000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4506977895184479 / 2500000000000000 : ℝ) ≤
            (5893361072704049082307 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (415652955979427 / 5000000000000000 : ℝ)) (q :=
      (4506977895184479 / 20000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_624_16 :
    Uω (aρ 16) (bρ 16) (11610952826577 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_624 :
    Uρ (11610952826577 / 16000000000000 : ℝ) ≤
      (-(2837864753785064472951 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11610952826577 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3295704933797769085771 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11610952826577 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(665796501209805653239 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11610952826577 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3395841553661085159127 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11610952826577 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3507788028088219534127 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11610952826577 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3680462797695905282609 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11610952826577 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1966423481665302052459 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11610952826577 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(2143241501416554488787 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11610952826577 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4764829573210770707701 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11610952826577 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5392879496913676081697 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11610952826577 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1549319150378315990693 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11610952826577 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(7207459623385319839303 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11610952826577 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1691851121799353991287 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11610952826577 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(2501478072666182089101 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11610952826577 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(11962152448444704526753 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11610952826577 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(14901054336295950917693 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11610952826577 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_624_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_625_1 :
    Uω (aρ 1) (bρ 1) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(3282471795757911769263 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5761479859975443 / 8000000000000000 : ℝ) ≤
      (-(3282471795757911769263 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5761479859975443 / 8000000000000000 : ℝ) =
            (5761479859975443 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5761479859975443 / 4000000000000000 : ℝ) ≤
            (3649000007242088230737 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (90022842210799 / 125000000000000 : ℝ)) (q :=
      (5761479859975443 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_625_2 :
    Uω (aρ 2) (bρ 2) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(1657852527543002467351 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5742364365647849 / 8000000000000000 : ℝ) ≤
      (-(1657852527543002467351 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5742364365647849 / 8000000000000000 : ℝ) =
            (5742364365647849 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5742364365647849 / 4000000000000000 : ℝ) ≤
            (1807883373956997532649 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1435561530710987 / 2000000000000000 : ℝ)) (q :=
      (5742364365647849 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_625_3 :
    Uω (aρ 3) (bρ 3) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(845618598796519162513 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28520753473823387 / 40000000000000000 : ℝ) ≤
      (-(845618598796519162513 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28520753473823387 / 40000000000000000 : ℝ) =
            (28520753473823387 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28520753473823387 / 20000000000000000 : ℝ) ≤
            (887249351953480837487 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3564834791348503 / 5000000000000000 : ℝ)) (q :=
      (28520753473823387 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_625_4 :
    Uω (aρ 4) (bρ 4) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(3494268611257336033207 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5640736715494749 / 8000000000000000 : ℝ) ≤
      (-(3494268611257336033207 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5640736715494749 / 8000000000000000 : ℝ) =
            (5640736715494749 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5640736715494749 / 4000000000000000 : ℝ) ≤
            (3437203191742663966793 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1409885763117437 / 2000000000000000 : ℝ)) (q :=
      (5640736715494749 / 8000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_625_5 :
    Uω (aρ 5) (bρ 5) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(458337918543920478139 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27721523108848051 / 40000000000000000 : ℝ) ≤
      (-(458337918543920478139 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27721523108848051 / 40000000000000000 : ℝ) =
            (27721523108848051 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27721523108848051 / 20000000000000000 : ℝ) ≤
            (408096056831079521861 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3463269250304669 / 5000000000000000 : ℝ)) (q :=
      (27721523108848051 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_625_6 :
    Uω (aρ 6) (bρ 6) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(3918724916650439724693 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27031611087384427 / 40000000000000000 : ℝ) ≤
      (-(3918724916650439724693 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27031611087384427 / 40000000000000000 : ℝ) =
            (27031611087384427 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27031611087384427 / 20000000000000000 : ℝ) ≤
            (3012746886349560275307 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3374411432508763 / 5000000000000000 : ℝ)) (q :=
      (27031611087384427 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_625_7 :
    Uω (aρ 7) (bρ 7) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(4271827966286515829487 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5218754358567231 / 8000000000000000 : ℝ) ≤
      (-(4271827966286515829487 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5218754358567231 / 8000000000000000 : ℝ) =
            (5218754358567231 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5218754358567231 / 4000000000000000 : ℝ) ≤
            (2659643836713484170513 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (650356459850339 / 1000000000000000 : ℝ)) (q :=
      (5218754358567231 / 8000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_625_8 :
    Uω (aρ 8) (bρ 8) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(2374701614773647720401 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4975377357387353 / 8000000000000000 : ℝ) ≤
      (-(2374701614773647720401 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4975377357387353 / 8000000000000000 : ℝ) =
            (4975377357387353 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4975377357387353 / 4000000000000000 : ℝ) ≤
            (1091034286726352279599 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1235732749378739 / 2000000000000000 : ℝ)) (q :=
      (4975377357387353 / 8000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_625_9 :
    Uω (aρ 9) (bρ 9) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(5376341562609795843151 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23365143027897899 / 40000000000000000 : ℝ) ≤
      (-(5376341562609795843151 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23365143027897899 / 40000000000000000 : ℝ) =
            (23365143027897899 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23365143027897899 / 20000000000000000 : ℝ) ≤
            (1555130240390204156849 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2881878747867131 / 5000000000000000 : ℝ)) (q :=
      (23365143027897899 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_625_10 :
    Uω (aρ 10) (bρ 10) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(6179122219677369954149 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (21562748770038979 / 40000000000000000 : ℝ) ≤
      (-(6179122219677369954149 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (21562748770038979 / 40000000000000000 : ℝ) =
            (21562748770038979 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (21562748770038979 / 20000000000000000 : ℝ) ≤
            (752349583322630045851 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2625559700149901 / 5000000000000000 : ℝ)) (q :=
      (21562748770038979 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_625_11 :
    Uω (aρ 11) (bρ 11) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(7186892955616715097121 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19495626493545693 / 40000000000000000 : ℝ) ≤
      (-(7186892955616715097121 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19495626493545693 / 40000000000000000 : ℝ) =
            (19495626493545693 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19495626493545693 / 10000000000000000 : ℝ) ≤
            (6676050650383284902879 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4636034888258159 / 10000000000000000 : ℝ)) (q :=
      (19495626493545693 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_625_12 :
    Uω (aρ 12) (bρ 12) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(8434899774897159942441 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17208259569819893 / 40000000000000000 : ℝ) ≤
      (-(8434899774897159942441 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17208259569819893 / 40000000000000000 : ℝ) =
            (17208259569819893 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17208259569819893 / 10000000000000000 : ℝ) ≤
            (5428043831102840057559 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3916051523080259 / 10000000000000000 : ℝ)) (q :=
      (17208259569819893 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_625_13 :
    Uω (aρ 13) (bρ 13) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(2493749297745844288991 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14752015750445453 / 40000000000000000 : ℝ) ≤
      (-(2493749297745844288991 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14752015750445453 / 40000000000000000 : ℝ) =
            (14752015750445453 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14752015750445453 / 10000000000000000 : ℝ) ≤
            (971986603754155711009 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3087311354988039 / 10000000000000000 : ℝ)) (q :=
      (14752015750445453 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_625_14 :
    Uω (aρ 14) (bρ 14) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(11917234953315698604143 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2429579132447089 / 8000000000000000 : ℝ) ≤
      (-(11917234953315698604143 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2429579132447089 / 8000000000000000 : ℝ) =
            (2429579132447089 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2429579132447089 / 2000000000000000 : ℝ) ≤
            (1945708652684301395857 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (425835719185607 / 2000000000000000 : ℝ)) (q :=
      (2429579132447089 / 8000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_625_15 :
    Uω (aρ 15) (bρ 15) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(739462680758528667917 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9115297916670169 / 40000000000000000 : ℝ) ≤
      (-(739462680758528667917 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9115297916670169 / 40000000000000000 : ℝ) =
            (9115297916670169 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9115297916670169 / 5000000000000000 : ℝ) ≤
            (300258089691471332083 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (872453000560397 / 10000000000000000 : ℝ)) (q :=
      (9115297916670169 / 40000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_625_16 :
    Uω (aρ 16) (bρ 16) (23252382371711 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_625 :
    Uρ (23252382371711 / 32000000000000 : ℝ) ≤
      (-(1413899734414673350401 / 2500000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23252382371711 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3282471795757911769263 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23252382371711 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1657852527543002467351 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23252382371711 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(845618598796519162513 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23252382371711 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3494268611257336033207 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23252382371711 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(458337918543920478139 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23252382371711 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3918724916650439724693 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23252382371711 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4271827966286515829487 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23252382371711 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(2374701614773647720401 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23252382371711 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5376341562609795843151 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23252382371711 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6179122219677369954149 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23252382371711 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(7186892955616715097121 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23252382371711 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(8434899774897159942441 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23252382371711 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(2493749297745844288991 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23252382371711 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(11917234953315698604143 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23252382371711 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(739462680758528667917 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23252382371711 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_625_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_626_1 :
    Uω (aρ 1) (bρ 1) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(3269256146281007372917 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7211373829165401 / 10000000000000000 : ℝ) ≤
      (-(3269256146281007372917 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7211373829165401 / 10000000000000000 : ℝ) =
            (7211373829165401 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7211373829165401 / 5000000000000000 : ℝ) ≤
            (3662215656718992627083 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1802837852676763 / 2500000000000000 : ℝ)) (q :=
      (7211373829165401 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_626_2 :
    Uω (aρ 2) (bρ 2) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(3302445210544198461269 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (449217476716509 / 625000000000000 : ℝ) ≤
      (-(3302445210544198461269 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (449217476716509 / 625000000000000 : ℝ) =
            (449217476716509 / 312500000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (449217476716509 / 312500000000000 : ℝ) ≤
            (3629026592455801538731 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3593666009907269 / 5000000000000000 : ℝ)) (q :=
      (449217476716509 / 625000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_626_3 :
    Uω (aρ 3) (bρ 3) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(842281270886748966641 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7139713035086143 / 10000000000000000 : ℝ) ≤
      (-(842281270886748966641 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7139713035086143 / 10000000000000000 : ℝ) =
            (7139713035086143 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7139713035086143 / 5000000000000000 : ℝ) ≤
            (890586679863251033359 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (892399367676067 / 1250000000000000 : ℝ)) (q :=
      (7139713035086143 / 10000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_626_4 :
    Uω (aρ 4) (bρ 4) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(3480767454931998022547 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14120893764074217 / 20000000000000000 : ℝ) ≤
      (-(3480767454931998022547 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14120893764074217 / 20000000000000000 : ℝ) =
            (14120893764074217 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14120893764074217 / 10000000000000000 : ℝ) ≤
            (3450704348068001977453 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7058956816375467 / 10000000000000000 : ℝ)) (q :=
      (14120893764074217 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_626_5 :
    Uω (aρ 5) (bρ 5) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(3652962826186939902803 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13879820055248543 / 20000000000000000 : ℝ) ≤
      (-(3652962826186939902803 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (13879820055248543 / 20000000000000000 : ℝ) =
            (13879820055248543 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13879820055248543 / 10000000000000000 : ℝ) ≤
            (3278508976813060097197 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6936073026884793 / 10000000000000000 : ℝ)) (q :=
      (13879820055248543 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_626_6 :
    Uω (aρ 6) (bρ 6) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(1952311419290875189301 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1353487908385273 / 2000000000000000 : ℝ) ≤
      (-(1952311419290875189301 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1353487908385273 / 2000000000000000 : ℝ) =
            (1353487908385273 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1353487908385273 / 1000000000000000 : ℝ) ≤
            (1513424482209124810699 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (337918621531449 / 500000000000000 : ℝ)) (q :=
      (1353487908385273 / 2000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_626_7 :
    Uω (aρ 7) (bρ 7) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(4257194506230267187757 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3266497995194277 / 5000000000000000 : ℝ) ≤
      (-(4257194506230267187757 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3266497995194277 / 5000000000000000 : ℝ) =
            (3266497995194277 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3266497995194277 / 2500000000000000 : ℝ) ≤
            (2674277296769732812243 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3256573354156679 / 5000000000000000 : ℝ)) (q :=
      (3266497995194277 / 5000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_626_8 :
    Uω (aρ 8) (bρ 8) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(4734000957894396568091 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12457616183312499 / 20000000000000000 : ℝ) ≤
      (-(4734000957894396568091 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (12457616183312499 / 20000000000000000 : ℝ) =
            (12457616183312499 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12457616183312499 / 10000000000000000 : ℝ) ≤
            (2197470845105603431909 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6188312562188749 / 10000000000000000 : ℝ)) (q :=
      (12457616183312499 / 20000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_626_9 :
    Uω (aρ 9) (bρ 9) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(2679915833401137352107 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11701875248542423 / 20000000000000000 : ℝ) ≤
      (-(2679915833401137352107 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11701875248542423 / 20000000000000000 : ℝ) =
            (11701875248542423 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11701875248542423 / 10000000000000000 : ℝ) ≤
            (785820068098862647893 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5773537255778673 / 10000000000000000 : ℝ)) (q :=
      (11701875248542423 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_626_10 :
    Uω (aρ 10) (bρ 10) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(6161002481746330224137 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10800927662522133 / 20000000000000000 : ℝ) ≤
      (-(6161002481746330224137 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10800927662522133 / 20000000000000000 : ℝ) =
            (10800927662522133 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10800927662522133 / 10000000000000000 : ℝ) ≤
            (770469321253669775863 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5261148703253383 / 10000000000000000 : ℝ)) (q :=
      (10800927662522133 / 20000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_626_11 :
    Uω (aρ 11) (bρ 11) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(7166372821784453306367 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (195356728538063 / 400000000000000 : ℝ) ≤
      (-(7166372821784453306367 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (195356728538063 / 400000000000000 : ℝ) =
            (195356728538063 / 100000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (195356728538063 / 100000000000000 : ℝ) ≤
            (6696570784215546693633 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (23232670469197 / 50000000000000 : ℝ)) (q :=
      (195356728538063 / 400000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11]) (by norm_num [bρ_11])
      (by norm_num) (by norm_num [aρ_11, bρ_11]) (by norm_num [aρ_11, bρ_11]) hlg

lemma U_626_12 :
    Uω (aρ 12) (bρ 12) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(4205307374925527529399 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (8625050328156639 / 20000000000000000 : ℝ) ≤
      (-(4205307374925527529399 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (8625050328156639 / 20000000000000000 : ℝ) =
            (8625050328156639 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (8625050328156639 / 5000000000000000 : ℝ) ≤
            (2726164428074472470601 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3927448091777889 / 10000000000000000 : ℝ)) (q :=
      (8625050328156639 / 20000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_626_13 :
    Uω (aρ 13) (bρ 13) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(497210714502570725607 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7398748350124519 / 20000000000000000 : ℝ) ≤
      (-(497210714502570725607 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7398748350124519 / 20000000000000000 : ℝ) =
            (7398748350124519 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7398748350124519 / 5000000000000000 : ℝ) ≤
            (195936465797429274393 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3100527855340769 / 10000000000000000 : ℝ)) (q :=
      (7398748350124519 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_626_14 :
    Uω (aρ 14) (bρ 14) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(5936344091881768530959 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6101065662292823 / 20000000000000000 : ℝ) ≤
      (-(5936344091881768530959 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6101065662292823 / 20000000000000000 : ℝ) =
            (6101065662292823 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6101065662292823 / 5000000000000000 : ℝ) ≤
            (995127711118231469041 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2146772452554073 / 10000000000000000 : ℝ)) (q :=
      (6101065662292823 / 20000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_626_15 :
    Uω (aρ 15) (bρ 15) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(14682499387665634183519 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2303282209888357 / 10000000000000000 : ℝ) ≤
      (-(14682499387665634183519 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (2303282209888357 / 10000000000000000 : ℝ) =
            (2303282209888357 / 1250000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2303282209888357 / 1250000000000000 : ℝ) ≤
            (6111916021334365816481 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (227961121863241 / 2500000000000000 : ℝ)) (q :=
      (2303282209888357 / 10000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_626_16 :
    Uω (aρ 16) (bρ 16) (5820714772567 / 8000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_626 :
    Uρ (5820714772567 / 8000000000000 : ℝ) ≤
      (-(5635669807423770572593 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (5820714772567 / 8000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3269256146281007372917 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (5820714772567 / 8000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3302445210544198461269 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (5820714772567 / 8000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(842281270886748966641 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (5820714772567 / 8000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3480767454931998022547 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (5820714772567 / 8000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3652962826186939902803 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (5820714772567 / 8000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1952311419290875189301 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (5820714772567 / 8000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4257194506230267187757 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (5820714772567 / 8000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4734000957894396568091 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (5820714772567 / 8000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2679915833401137352107 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (5820714772567 / 8000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(6161002481746330224137 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (5820714772567 / 8000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(7166372821784453306367 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (5820714772567 / 8000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(4205307374925527529399 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (5820714772567 / 8000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) * (-(497210714502570725607 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (5820714772567 / 8000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(5936344091881768530959 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (5820714772567 / 8000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(14682499387665634183519 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (5820714772567 / 8000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_626_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_627_1 :
    Uω (aρ 1) (bρ 1) (932533432353 / 1280000000000 : ℝ) ≤
      (-(3256057939202933221281 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28883591333133169 / 40000000000000000 : ℝ) ≤
      (-(3256057939202933221281 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28883591333133169 / 40000000000000000 : ℝ) =
            (28883591333133169 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28883591333133169 / 20000000000000000 : ℝ) ≤
            (3675413863797066778719 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1805218861098443 / 2500000000000000 : ℝ)) (q :=
      (28883591333133169 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_627_2 :
    Uω (aρ 2) (bρ 2) (932533432353 / 1280000000000 : ℝ) ≤
      (-(3289202925789912456111 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28788015189400381 / 40000000000000000 : ℝ) ≤
      (-(3289202925789912456111 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28788015189400381 / 40000000000000000 : ℝ) =
            (28788015189400381 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28788015189400381 / 20000000000000000 : ℝ) ≤
            (3642268877210087543889 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3598428192518689 / 5000000000000000 : ℝ)) (q :=
      (28788015189400381 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_627_3 :
    Uω (aρ 3) (bρ 3) (932533432353 / 1280000000000 : ℝ) ≤
      (-(671158714228988945661 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28596950799488947 / 40000000000000000 : ℝ) ≤
      (-(671158714228988945661 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28596950799488947 / 40000000000000000 : ℝ) =
            (28596950799488947 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28596950799488947 / 20000000000000000 : ℝ) ≤
            (715135646371011054339 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7148720296431661 / 10000000000000000 : ℝ)) (q :=
      (28596950799488947 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_627_4 :
    Uω (aρ 4) (bρ 4) (932533432353 / 1280000000000 : ℝ) ≤
      (-(3467284509829511449131 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28279891457118949 / 40000000000000000 : ℝ) ≤
      (-(3467284509829511449131 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28279891457118949 / 40000000000000000 : ℝ) =
            (28279891457118949 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28279891457118949 / 20000000000000000 : ℝ) ≤
            (3464187293170488550869 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3534242403155831 / 5000000000000000 : ℝ)) (q :=
      (28279891457118949 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_627_5 :
    Uω (aρ 5) (bρ 5) (932533432353 / 1280000000000 : ℝ) ≤
      (-(1819620589572607906299 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27797757054238993 / 40000000000000000 : ℝ) ≤
      (-(1819620589572607906299 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27797757054238993 / 40000000000000000 : ℝ) =
            (27797757054238993 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27797757054238993 / 20000000000000000 : ℝ) ≤
            (1646115311927392093701 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1736401881051671 / 2500000000000000 : ℝ)) (q :=
      (27797757054238993 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_627_6 :
    Uω (aρ 6) (bρ 6) (932533432353 / 1280000000000 : ℝ) ≤
      (-(243158792036402207847 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27107905103783649 / 40000000000000000 : ℝ) ≤
      (-(243158792036402207847 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27107905103783649 / 40000000000000000 : ℝ) =
            (27107905103783649 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27107905103783649 / 20000000000000000 : ℝ) ≤
            (190058195651097792153 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1691980481029753 / 2500000000000000 : ℝ)) (q :=
      (27107905103783649 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_627_7 :
    Uω (aρ 7) (bρ 7) (932533432353 / 1280000000000 : ℝ) ≤
      (-(4242582558841379302559 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26170195789697881 / 40000000000000000 : ℝ) ≤
      (-(4242582558841379302559 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (26170195789697881 / 40000000000000000 : ℝ) =
            (26170195789697881 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26170195789697881 / 20000000000000000 : ℝ) ≤
            (2688889244158620697441 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (203835270244879 / 312500000000000 : ℝ)) (q :=
      (26170195789697881 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_627_8 :
    Uω (aρ 8) (bρ 8) (932533432353 / 1280000000000 : ℝ) ≤
      (-(4718622682281668301957 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24953577173947831 / 40000000000000000 : ℝ) ≤
      (-(4718622682281668301957 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24953577173947831 / 40000000000000000 : ℝ) =
            (24953577173947831 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24953577173947831 / 20000000000000000 : ℝ) ≤
            (2212849120718331698043 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6197960991301103 / 10000000000000000 : ℝ)) (q :=
      (24953577173947831 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_627_9 :
    Uω (aρ 9) (bρ 9) (932533432353 / 1280000000000 : ℝ) ≤
      (-(2671674856068678912033 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (937694250349367 / 1600000000000000 : ℝ) ≤
      (-(2671674856068678912033 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (937694250349367 / 1600000000000000 : ℝ) =
            (937694250349367 / 800000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (937694250349367 / 800000000000000 : ℝ) ≤
            (794061045431321087967 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (231332646482171 / 400000000000000 : ℝ)) (q :=
      (937694250349367 / 1600000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_627_10 :
    Uω (aρ 10) (bρ 10) (932533432353 / 1280000000000 : ℝ) ≤
      (-(1535729312323613446291 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4328191626209523 / 8000000000000000 : ℝ) ≤
      (-(1535729312323613446291 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (4328191626209523 / 8000000000000000 : ℝ) =
            (4328191626209523 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4328191626209523 / 4000000000000000 : ℝ) ≤
            (197138638426386553709 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1054235226341199 / 2000000000000000 : ℝ)) (q :=
      (4328191626209523 / 8000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_627_11 :
    Uω (aρ 11) (bρ 11) (932533432353 / 1280000000000 : ℝ) ≤
      (-(3572949496635842197997 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (19575710827940307 / 40000000000000000 : ℝ) ≤
      (-(3572949496635842197997 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (19575710827940307 / 40000000000000000 : ℝ) =
            (19575710827940307 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 14
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (19575710827940307 / 10000000000000000 : ℝ) ≤
            (3358522306364157802003 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4657029106357341 / 10000000000000000 : ℝ)) (q :=
      (19575710827940307 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_627_12 :
    Uω (aρ 12) (bρ 12) (932533432353 / 1280000000000 : ℝ) ≤
      (-(262075001932125642291 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3458384370162619 / 8000000000000000 : ℝ) ≤
      (-(262075001932125642291 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3458384370162619 / 8000000000000000 : ℝ) =
            (3458384370162619 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3458384370162619 / 2000000000000000 : ℝ) ≤
            (171141985755374357709 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (787766942895747 / 2000000000000000 : ℝ)) (q :=
      (3458384370162619 / 8000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_627_13 :
    Uω (aρ 13) (bρ 13) (932533432353 / 1280000000000 : ℝ) ≤
      (-(2478390548579272769413 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14842923714890069 / 40000000000000000 : ℝ) ≤
      (-(2478390548579272769413 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (14842923714890069 / 40000000000000000 : ℝ) =
            (14842923714890069 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14842923714890069 / 10000000000000000 : ℝ) ≤
            (987345352920727230587 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1556858694056111 / 5000000000000000 : ℝ)) (q :=
      (14842923714890069 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_627_14 :
    Uω (aρ 14) (bρ 14) (932533432353 / 1280000000000 : ℝ) ≤
      (-(11828503971903031566869 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12256164763485383 / 40000000000000000 : ℝ) ≤
      (-(11828503971903031566869 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12256164763485383 / 40000000000000000 : ℝ) =
            (12256164763485383 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12256164763485383 / 10000000000000000 : ℝ) ≤
            (2034439634096968433131 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2164265197454879 / 10000000000000000 : ℝ)) (q :=
      (12256164763485383 / 40000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_627_15 :
    Uω (aρ 15) (bρ 15) (932533432353 / 1280000000000 : ℝ) ≤
      (-(1458017506958502499819 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9307885521012117 / 40000000000000000 : ℝ) ≤
      (-(1458017506958502499819 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (9307885521012117 / 40000000000000000 : ℝ) =
            (9307885521012117 / 5000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9307885521012117 / 5000000000000000 : ℝ) ≤
            (621424033941497500181 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (474849426816623 / 5000000000000000 : ℝ)) (q :=
      (9307885521012117 / 40000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_627_16 :
    Uω (aρ 16) (bρ 16) (932533432353 / 1280000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_627 :
    Uρ (932533432353 / 1280000000000 : ℝ) ≤
      (-(5615922790488704981441 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (932533432353 / 1280000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3256057939202933221281 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (932533432353 / 1280000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3289202925789912456111 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (932533432353 / 1280000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(671158714228988945661 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (932533432353 / 1280000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3467284509829511449131 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (932533432353 / 1280000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1819620589572607906299 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (932533432353 / 1280000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(243158792036402207847 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (932533432353 / 1280000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4242582558841379302559 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (932533432353 / 1280000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4718622682281668301957 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (932533432353 / 1280000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2671674856068678912033 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (932533432353 / 1280000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1535729312323613446291 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (932533432353 / 1280000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3572949496635842197997 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (932533432353 / 1280000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(262075001932125642291 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (932533432353 / 1280000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(2478390548579272769413 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (932533432353 / 1280000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(11828503971903031566869 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (932533432353 / 1280000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(1458017506958502499819 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (932533432353 / 1280000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_627_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
