/-
Copyright (c) 2026 Moritz Firsching. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Moritz Firsching
-/

module

public import LeanPool.Zeta5Irrational.Table.UpperCertificate

/-! # Certified arcsine potential bounds (U53) -/

public section

open Finset

namespace Zeta5Irrational

lemma U_640_1 :
    Uω (aρ 1) (bρ 1) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(617209565778762565663 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14689419759675083 / 20000000000000000 : ℝ) ≤
      (-(617209565778762565663 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14689419759675083 / 20000000000000000 : ℝ) =
            (14689419759675083 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14689419759675083 / 10000000000000000 : ℝ) ≤
            (769084794821237434337 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3672343934182229 / 5000000000000000 : ℝ)) (q :=
      (14689419759675083 / 20000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_640_2 :
    Uω (aρ 2) (bρ 2) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(1559315139434144244523 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (732081795961533 / 1000000000000000 : ℝ) ≤
      (-(1559315139434144244523 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (732081795961533 / 1000000000000000 : ℝ) =
            (732081795961533 / 500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (732081795961533 / 500000000000000 : ℝ) ≤
            (1906420762065855755477 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1464134608086007 / 2000000000000000 : ℝ)) (q :=
      (732081795961533 / 1000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_640_3 :
    Uω (aρ 3) (bρ 3) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(796020581195767598923 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14546116355132353 / 20000000000000000 : ℝ) ≤
      (-(796020581195767598923 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14546116355132353 / 20000000000000000 : ℝ) =
            (14546116355132353 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14546116355132353 / 10000000000000000 : ℝ) ≤
            (936847369554232401077 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (56816793614701 / 78125000000000 : ℝ)) (q :=
      (14546116355132353 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_640_4 :
    Uω (aρ 4) (bρ 4) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(3293641379290378129919 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3596905074737841 / 5000000000000000 : ℝ) ≤
      (-(3293641379290378129919 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3596905074737841 / 5000000000000000 : ℝ) =
            (3596905074737841 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3596905074737841 / 2500000000000000 : ℝ) ≤
            (3637830423709621870081 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7192347707565739 / 10000000000000000 : ℝ)) (q :=
      (3596905074737841 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_640_5 :
    Uω (aρ 5) (bρ 5) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(3462554103321312357713 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7073318039984403 / 10000000000000000 : ℝ) ≤
      (-(3462554103321312357713 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7073318039984403 / 10000000000000000 : ℝ) =
            (7073318039984403 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7073318039984403 / 5000000000000000 : ℝ) ≤
            (3468917699678687642287 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7069553407918181 / 10000000000000000 : ℝ)) (q :=
      (7073318039984403 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_640_6 :
    Uω (aρ 6) (bρ 6) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(1854629608987680224327 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6900950604875963 / 10000000000000000 : ℝ) ≤
      (-(1854629608987680224327 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6900950604875963 / 10000000000000000 : ℝ) =
            (6900950604875963 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6900950604875963 / 5000000000000000 : ℝ) ≤
            (1611106292512319775673 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6892058912841301 / 10000000000000000 : ℝ)) (q :=
      (6900950604875963 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_640_7 :
    Uω (aρ 7) (bρ 7) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(4054556366412365688859 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13333459616691127 / 20000000000000000 : ℝ) ≤
      (-(4054556366412365688859 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (13333459616691127 / 20000000000000000 : ℝ) =
            (13333459616691127 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13333459616691127 / 10000000000000000 : ℝ) ≤
            (2876915436587634311141 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3323639350270251 / 5000000000000000 : ℝ)) (q :=
      (13333459616691127 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_640_8 :
    Uω (aρ 8) (bρ 8) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(141276713247013046609 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (318149887404509 / 500000000000000 : ℝ) ≤
      (-(141276713247013046609 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (318149887404509 / 500000000000000 : ℝ) =
            (318149887404509 / 250000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (318149887404509 / 250000000000000 : ℝ) ≤
            (75331780596736953391 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1264671246273947 / 2000000000000000 : ℝ)) (q :=
      (318149887404509 / 500000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_640_9 :
    Uω (aρ 9) (bρ 9) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(160361986765208395623 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (11972039814806983 / 20000000000000000 : ℝ) ≤
      (-(160361986765208395623 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (11972039814806983 / 20000000000000000 : ℝ) =
            (11972039814806983 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (11972039814806983 / 10000000000000000 : ℝ) ≤
            (56246507078541604377 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2955183089178179 / 5000000000000000 : ℝ)) (q :=
      (11972039814806983 / 20000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_640_10 :
    Uω (aρ 10) (bρ 10) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(1477721945264326746369 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5537240736205787 / 10000000000000000 : ℝ) ≤
      (-(1477721945264326746369 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5537240736205787 / 10000000000000000 : ℝ) =
            (5537240736205787 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5537240736205787 / 5000000000000000 : ℝ) ≤
            (255146005485673253631 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5401366869455949 / 10000000000000000 : ℝ)) (q :=
      (5537240736205787 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_640_11 :
    Uω (aρ 11) (bρ 11) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(430240760642288933031 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10047733194381673 / 20000000000000000 : ℝ) ≤
      (-(430240760642288933031 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (10047733194381673 / 20000000000000000 : ℝ) =
            (10047733194381673 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10047733194381673 / 10000000000000000 : ℝ) ≤
            (2976227045211066969 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (599136902203881 / 1250000000000000 : ℝ)) (q :=
      (10047733194381673 / 20000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_640_12 :
    Uω (aρ 12) (bρ 12) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(4038902029818474039807 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1114616417328769 / 2500000000000000 : ℝ) ≤
      (-(4038902029818474039807 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1114616417328769 / 2500000000000000 : ℝ) =
            (1114616417328769 / 625000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1114616417328769 / 625000000000000 : ℝ) ≤
            (2892569773181525960193 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4085993458564527 / 10000000000000000 : ℝ)) (q :=
      (1114616417328769 / 2500000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_640_13 :
    Uω (aρ 13) (bρ 13) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(9526396211055741483633 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (192860759814833 / 500000000000000 : ℝ) ≤
      (-(9526396211055741483633 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (192860759814833 / 500000000000000 : ℝ) =
            (192860759814833 / 125000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (192860759814833 / 125000000000000 : ℝ) ≤
            (4336547394944258516367 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (656574850824539 / 2000000000000000 : ℝ)) (q :=
      (192860759814833 / 500000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13]) (by norm_num [bρ_13])
      (by norm_num) (by norm_num [aρ_13, bρ_13]) (by norm_num [aρ_13, bρ_13]) hlg

lemma U_640_14 :
    Uω (aρ 14) (bρ 14) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(11283870676060941852289 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3235547074773687 / 10000000000000000 : ℝ) ≤
      (-(11283870676060941852289 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3235547074773687 / 10000000000000000 : ℝ) =
            (3235547074773687 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3235547074773687 / 2500000000000000 : ℝ) ≤
            (2579072929939058147711 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2383465296121749 / 10000000000000000 : ℝ)) (q :=
      (3235547074773687 / 10000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_640_15 :
    Uω (aρ 15) (bρ 15) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(3376112697703459964891 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5182498075348999 / 20000000000000000 : ℝ) ≤
      (-(3376112697703459964891 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5182498075348999 / 20000000000000000 : ℝ) =
            (5182498075348999 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5182498075348999 / 5000000000000000 : ℝ) ≤
            (89623203796540035109 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (677221249669187 / 5000000000000000 : ℝ)) (q :=
      (5182498075348999 / 20000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_640_16 :
    Uω (aρ 16) (bρ 16) (11854766575033 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_640 :
    Uρ (11854766575033 / 16000000000000 : ℝ) ≤
      (-(1074206850063200334523 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11854766575033 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(617209565778762565663 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11854766575033 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1559315139434144244523 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11854766575033 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(796020581195767598923 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11854766575033 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3293641379290378129919 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11854766575033 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3462554103321312357713 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11854766575033 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1854629608987680224327 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11854766575033 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(4054556366412365688859 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11854766575033 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(141276713247013046609 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11854766575033 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(160361986765208395623 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11854766575033 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1477721945264326746369 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11854766575033 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(430240760642288933031 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11854766575033 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(4038902029818474039807 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11854766575033 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(9526396211055741483633 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11854766575033 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(11283870676060941852289 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11854766575033 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(3376112697703459964891 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11854766575033 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_640_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_641_1 :
    Uω (aρ 1) (bρ 1) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(3073089068670948228763 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29416935531569081 / 40000000000000000 : ℝ) ≤
      (-(3073089068670948228763 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (29416935531569081 / 40000000000000000 : ℝ) =
            (29416935531569081 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29416935531569081 / 20000000000000000 : ℝ) ≤
            (3858382734329051771237 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7354211899924853 / 10000000000000000 : ℝ)) (q :=
      (29416935531569081 / 40000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_641_2 :
    Uω (aρ 2) (bρ 2) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(3105629036471363676813 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5864273697963929 / 8000000000000000 : ℝ) ≤
      (-(3105629036471363676813 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5864273697963929 / 8000000000000000 : ℝ) =
            (5864273697963929 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5864273697963929 / 4000000000000000 : ℝ) ≤
            (3825842766528636323187 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1466039478312027 / 2000000000000000 : ℝ)) (q :=
      (5864273697963929 / 8000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_641_3 :
    Uω (aρ 3) (bρ 3) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(1585497554256626544711 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29130331269156021 / 40000000000000000 : ℝ) ≤
      (-(1585497554256626544711 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (29130331269156021 / 40000000000000000 : ℝ) =
            (29130331269156021 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29130331269156021 / 20000000000000000 : ℝ) ≤
            (1880238347243373455289 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7282074887578323 / 10000000000000000 : ℝ)) (q :=
      (29130331269156021 / 40000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_641_4 :
    Uω (aρ 4) (bρ 4) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(3280408326324041502759 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28813344232007867 / 40000000000000000 : ℝ) ≤
      (-(3280408326324041502759 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28813344232007867 / 40000000000000000 : ℝ) =
            (28813344232007867 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28813344232007867 / 20000000000000000 : ℝ) ≤
            (3651063476675958497241 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3600937775034623 / 5000000000000000 : ℝ)) (q :=
      (28813344232007867 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_641_5 :
    Uω (aρ 5) (bρ 5) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(1724545680045968091771 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28331388317403481 / 40000000000000000 : ℝ) ≤
      (-(1724545680045968091771 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28331388317403481 / 40000000000000000 : ℝ) =
            (28331388317403481 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28331388317403481 / 20000000000000000 : ℝ) ≤
            (1741190221454031908229 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7079087512102053 / 10000000000000000 : ℝ)) (q :=
      (28331388317403481 / 40000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_641_6 :
    Uω (aρ 6) (bρ 6) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(3695450016234095153087 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27641947398671501 / 40000000000000000 : ℝ) ≤
      (-(3695450016234095153087 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27641947398671501 / 40000000000000000 : ℝ) =
            (27641947398671501 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27641947398671501 / 20000000000000000 : ℝ) ≤
            (3236021786765904846913 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6901607427876063 / 10000000000000000 : ℝ)) (q :=
      (27641947398671501 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_641_7 :
    Uω (aρ 7) (bρ 7) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(808047810240227746469 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26705126446929301 / 40000000000000000 : ℝ) ≤
      (-(808047810240227746469 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (26705126446929301 / 40000000000000000 : ℝ) =
            (26705126446929301 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26705126446929301 / 20000000000000000 : ℝ) ≤
            (578246550359772253531 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6656858332764963 / 10000000000000000 : ℝ)) (q :=
      (26705126446929301 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_641_8 :
    Uω (aρ 8) (bρ 8) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(4505804715333577953633 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5098065070943721 / 8000000000000000 : ℝ) ≤
      (-(4505804715333577953633 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5098065070943721 / 8000000000000000 : ℝ) =
            (5098065070943721 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5098065070943721 / 4000000000000000 : ℝ) ≤
            (2425667087666422046367 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1266599887599923 / 2000000000000000 : ℝ)) (q :=
      (5098065070943721 / 8000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_641_9 :
    Uω (aρ 9) (bρ 9) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(5115482859176546188077 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (23982662367503569 / 40000000000000000 : ℝ) ≤
      (-(5115482859176546188077 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (23982662367503569 / 40000000000000000 : ℝ) =
            (23982662367503569 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (23982662367503569 / 20000000000000000 : ℝ) ≤
            (1815988943823453811923 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5920133572752097 / 10000000000000000 : ℝ)) (q :=
      (23982662367503569 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_641_10 :
    Uω (aρ 10) (bρ 10) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(736658945086993470021 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (22188015433787531 / 40000000000000000 : ℝ) ≤
      (-(736658945086993470021 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (22188015433787531 / 40000000000000000 : ℝ) =
            (22188015433787531 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (22188015433787531 / 20000000000000000 : ℝ) ≤
            (129775030288006529979 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2705684569694539 / 5000000000000000 : ℝ)) (q :=
      (22188015433787531 / 40000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_641_11 :
    Uω (aρ 11) (bρ 11) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(6864003581606836853937 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20135392664314169 / 40000000000000000 : ℝ) ≤
      (-(6864003581606836853937 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20135392664314169 / 40000000000000000 : ℝ) =
            (20135392664314169 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20135392664314169 / 20000000000000000 : ℝ) ≤
            (67468221393163146063 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4803534380857397 / 10000000000000000 : ℝ)) (q :=
      (20135392664314169 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_641_12 :
    Uω (aρ 12) (bρ 12) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(4027263637795985554169 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (715016900979913 / 1600000000000000 : ℝ) ≤
      (-(4027263637795985554169 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (715016900979913 / 1600000000000000 : ℝ) =
            (715016900979913 / 400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (715016900979913 / 400000000000000 : ℝ) ≤
            (2904208165204014445831 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (163889976305369 / 400000000000000 : ℝ)) (q :=
      (715016900979913 / 1600000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12]) (by norm_num [bρ_12])
      (by norm_num) (by norm_num [aρ_12, bρ_12]) (by norm_num [aρ_12, bρ_12]) hlg

lemma U_641_13 :
    Uω (aρ 13) (bρ 13) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(9497441751319171954421 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (15473598955246807 / 40000000000000000 : ℝ) ≤
      (-(9497441751319171954421 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (15473598955246807 / 40000000000000000 : ℝ) =
            (15473598955246807 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (15473598955246807 / 10000000000000000 : ℝ) ≤
            (4365501854680828045579 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (823929841150929 / 2500000000000000 : ℝ)) (q :=
      (15473598955246807 / 40000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_641_14 :
    Uω (aρ 14) (bρ 14) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(1124404824568891011653 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (12993829994981327 / 40000000000000000 : ℝ) ≤
      (-(1124404824568891011653 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (12993829994981327 / 40000000000000000 : ℝ) =
            (12993829994981327 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (12993829994981327 / 10000000000000000 : ℝ) ≤
            (261889536031108988347 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (299970271189497 / 1250000000000000 : ℝ)) (q :=
      (12993829994981327 / 40000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_641_15 :
    Uω (aρ 15) (bρ 15) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(13434819948548071133851 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10437420347172571 / 40000000000000000 : ℝ) ≤
      (-(13434819948548071133851 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10437420347172571 / 40000000000000000 : ℝ) =
            (10437420347172571 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10437420347172571 / 10000000000000000 : ℝ) ≤
            (428123657451928866149 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (690565311513299 / 5000000000000000 : ℝ)) (q :=
      (10437420347172571 / 40000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_641_16 :
    Uω (aρ 16) (bρ 16) (23740009868623 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_641 :
    Uρ (23740009868623 / 32000000000000 : ℝ) ≤
      (-(2676446975214992581051 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23740009868623 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3073089068670948228763 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23740009868623 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3105629036471363676813 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23740009868623 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1585497554256626544711 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23740009868623 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3280408326324041502759 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23740009868623 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1724545680045968091771 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23740009868623 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3695450016234095153087 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23740009868623 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(808047810240227746469 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23740009868623 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4505804715333577953633 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23740009868623 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5115482859176546188077 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23740009868623 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(736658945086993470021 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23740009868623 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6864003581606836853937 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23740009868623 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(4027263637795985554169 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23740009868623 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(9497441751319171954421 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23740009868623 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(1124404824568891011653 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23740009868623 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(13434819948548071133851 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23740009868623 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_641_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_642_1 :
    Uω (aρ 1) (bρ 1) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(3060147079763797147191 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (589100630869861 / 800000000000000 : ℝ) ≤
      (-(3060147079763797147191 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (589100630869861 / 800000000000000 : ℝ) =
            (589100630869861 / 400000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (589100630869861 / 400000000000000 : ℝ) ≤
            (3871324723236202852809 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (294549437253511 / 400000000000000 : ℝ)) (q :=
      (589100630869861 / 800000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_642_2 :
    Uω (aρ 2) (bρ 2) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(3092644676025192306147 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14679732569611667 / 20000000000000000 : ℝ) ≤
      (-(3092644676025192306147 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14679732569611667 / 20000000000000000 : ℝ) =
            (14679732569611667 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14679732569611667 / 10000000000000000 : ℝ) ≤
            (3838827126974807693853 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7339721741712917 / 10000000000000000 : ℝ)) (q :=
      (14679732569611667 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_642_3 :
    Uω (aρ 3) (bρ 3) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(3157924999766053070299 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14584214910548139 / 20000000000000000 : ℝ) ≤
      (-(3157924999766053070299 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14584214910548139 / 20000000000000000 : ℝ) =
            (14584214910548139 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14584214910548139 / 10000000000000000 : ℝ) ≤
            (3773546803233946929701 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7291600188999389 / 10000000000000000 : ℝ)) (q :=
      (14584214910548139 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_642_4 :
    Uω (aρ 4) (bρ 4) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(1633596384335385696813 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3606430980709437 / 5000000000000000 : ℝ) ≤
      (-(1633596384335385696813 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3606430980709437 / 5000000000000000 : ℝ) =
            (3606430980709437 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3606430980709437 / 2500000000000000 : ℝ) ≤
            (1832139517164614303187 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3605701691176999 / 5000000000000000 : ℝ)) (q :=
      (3606430980709437 / 5000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_642_5 :
    Uω (aρ 5) (bρ 5) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(1717823368121241994069 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7092376105100347 / 10000000000000000 : ℝ) ≤
      (-(1717823368121241994069 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7092376105100347 / 10000000000000000 : ℝ) =
            (7092376105100347 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7092376105100347 / 5000000000000000 : ℝ) ≤
            (1747912533378758005931 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (886077698631493 / 1250000000000000 : ℝ)) (q :=
      (7092376105100347 / 10000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_642_6 :
    Uω (aρ 6) (bρ 6) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(736331981307432108431 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2768009224239201 / 4000000000000000 : ℝ) ≤
      (-(736331981307432108431 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2768009224239201 / 4000000000000000 : ℝ) =
            (2768009224239201 / 2000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2768009224239201 / 2000000000000000 : ℝ) ≤
            (649962379292567891569 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1382231175037451 / 2000000000000000 : ℝ)) (q :=
      (2768009224239201 / 4000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_642_7 :
    Uω (aρ 7) (bρ 7) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(805188464903322653011 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (267433333414867 / 400000000000000 : ℝ) ≤
      (-(805188464903322653011 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (267433333414867 / 400000000000000 : ℝ) =
            (267433333414867 / 200000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (267433333414867 / 200000000000000 : ℝ) ≤
            (581105895696677346989 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (33332189027473 / 50000000000000 : ℝ)) (q :=
      (267433333414867 / 400000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_642_8 :
    Uω (aρ 8) (bρ 8) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(4490777505587620117577 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6382164749112121 / 10000000000000000 : ℝ) ≤
      (-(4490777505587620117577 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6382164749112121 / 10000000000000000 : ℝ) =
            (6382164749112121 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6382164749112121 / 5000000000000000 : ℝ) ≤
            (2440694297412379882423 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1585660571078873 / 2500000000000000 : ℝ)) (q :=
      (6382164749112121 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_642_9 :
    Uω (aρ 9) (bρ 9) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(2549704341422734584063 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6005310880397129 / 10000000000000000 : ℝ) ≤
      (-(2549704341422734584063 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6005310880397129 / 10000000000000000 : ℝ) =
            (6005310880397129 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6005310880397129 / 5000000000000000 : ℝ) ≤
            (916031560077265415937 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1482475043811377 / 2500000000000000 : ℝ)) (q :=
      (6005310880397129 / 10000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_642_10 :
    Uω (aρ 10) (bρ 10) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(5875687868970487449787 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2778383059672791 / 5000000000000000 : ℝ) ≤
      (-(5875687868970487449787 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2778383059672791 / 5000000000000000 : ℝ) =
            (2778383059672791 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2778383059672791 / 2500000000000000 : ℝ) ≤
            (1055783934029512550213 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2710684843318707 / 5000000000000000 : ℝ)) (q :=
      (2778383059672791 / 5000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_642_11 :
    Uω (aρ 11) (bρ 11) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(3422099036893664444543 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5043827837360799 / 10000000000000000 : ℝ) ≤
      (-(3422099036893664444543 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5043827837360799 / 10000000000000000 : ℝ) =
            (5043827837360799 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5043827837360799 / 5000000000000000 : ℝ) ≤
            (43636864606335555457 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (300873109304553 / 625000000000000 : ℝ)) (q :=
      (5043827837360799 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_642_12 :
    Uω (aρ 12) (bρ 12) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(31372321582058323511 / 39062500000000000000 : ℝ)) := by
  have hlg :
    Real.log (4479241212954563 / 10000000000000000 : ℝ) ≤
      (-(31372321582058323511 / 39062500000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4479241212954563 / 10000000000000000 : ℝ) =
            (4479241212954563 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4479241212954563 / 2500000000000000 : ℝ) ≤
            (22779801878879176489 / 39062500000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (128390518648293 / 312500000000000 : ℝ)) (q :=
      (4479241212954563 / 10000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_642_13 :
    Uω (aρ 13) (bρ 13) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(4734299912291785360331 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7759146108497097 / 20000000000000000 : ℝ) ≤
      (-(4734299912291785360331 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7759146108497097 / 20000000000000000 : ℝ) =
            (7759146108497097 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7759146108497097 / 5000000000000000 : ℝ) ≤
            (2197171890708214639669 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3308542020928347 / 10000000000000000 : ℝ)) (q :=
      (7759146108497097 / 20000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_642_14 :
    Uω (aρ 14) (bρ 14) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(2240898948388567398827 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (407666466324277 / 1250000000000000 : ℝ) ≤
      (-(2240898948388567398827 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (407666466324277 / 1250000000000000 : ℝ) =
            (407666466324277 / 312500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (407666466324277 / 312500000000000 : ℝ) ≤
            (531689772811432601173 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1207993329332341 / 5000000000000000 : ℝ)) (q :=
      (407666466324277 / 1250000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14]) (by norm_num [bρ_14])
      (by norm_num) (by norm_num [aρ_14, bρ_14]) (by norm_num [aρ_14, bρ_14]) hlg

lemma U_642_15 :
    Uω (aρ 15) (bρ 15) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(13366510929828003237353 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5254480704081081 / 20000000000000000 : ℝ) ≤
      (-(13366510929828003237353 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (5254480704081081 / 20000000000000000 : ℝ) =
            (5254480704081081 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5254480704081081 / 5000000000000000 : ℝ) ≤
            (496432676171996762647 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1407377178972331 / 10000000000000000 : ℝ)) (q :=
      (5254480704081081 / 20000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_642_16 :
    Uω (aρ 16) (bρ 16) (1188524329359 / 1600000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_642 :
    Uρ (1188524329359 / 1600000000000 : ℝ) ≤
      (-(666854306635595554443 / 1250000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (1188524329359 / 1600000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3060147079763797147191 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (1188524329359 / 1600000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3092644676025192306147 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (1188524329359 / 1600000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3157924999766053070299 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (1188524329359 / 1600000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1633596384335385696813 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (1188524329359 / 1600000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1717823368121241994069 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (1188524329359 / 1600000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(736331981307432108431 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (1188524329359 / 1600000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(805188464903322653011 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (1188524329359 / 1600000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4490777505587620117577 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (1188524329359 / 1600000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2549704341422734584063 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (1188524329359 / 1600000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5875687868970487449787 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (1188524329359 / 1600000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3422099036893664444543 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (1188524329359 / 1600000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(31372321582058323511 / 39062500000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (1188524329359 / 1600000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4734299912291785360331 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (1188524329359 / 1600000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(2240898948388567398827 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (1188524329359 / 1600000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(13366510929828003237353 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (1188524329359 / 1600000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_642_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_643_1 :
    Uω (aρ 1) (bρ 1) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(1523610909408552015951 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5898625511024643 / 8000000000000000 : ℝ) ≤
      (-(1523610909408552015951 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5898625511024643 / 8000000000000000 : ℝ) =
            (5898625511024643 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5898625511024643 / 4000000000000000 : ℝ) ≤
            (1942124992091447984049 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1474651992520759 / 2000000000000000 : ℝ)) (q :=
      (5898625511024643 / 8000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_643_2 :
    Uω (aρ 2) (bρ 2) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(1539838576871448098047 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29397561786679987 / 40000000000000000 : ℝ) ≤
      (-(1539838576871448098047 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (29397561786679987 / 40000000000000000 : ℝ) =
            (29397561786679987 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29397561786679987 / 20000000000000000 : ℝ) ≤
            (1925897324628551901953 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7349246090892181 / 10000000000000000 : ℝ)) (q :=
      (29397561786679987 / 40000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_643_3 :
    Uω (aρ 3) (bρ 3) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(628974390773593105421 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5841305673222537 / 8000000000000000 : ℝ) ≤
      (-(628974390773593105421 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5841305673222537 / 8000000000000000 : ℝ) =
            (5841305673222537 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5841305673222537 / 4000000000000000 : ℝ) ≤
            (757319969826406894579 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (730112548695853 / 1000000000000000 : ℝ)) (q :=
      (5841305673222537 / 8000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_643_4 :
    Uω (aρ 4) (bρ 4) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(813498665028040558633 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28889551438986517 / 40000000000000000 : ℝ) ≤
      (-(813498665028040558633 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28889551438986517 / 40000000000000000 : ℝ) =
            (28889551438986517 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28889551438986517 / 20000000000000000 : ℝ) ≤
            (919369285721959441367 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3610465602230223 / 5000000000000000 : ℝ)) (q :=
      (28889551438986517 / 40000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_643_5 :
    Uω (aρ 5) (bρ 5) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(1711110091506825365049 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5681524093830163 / 8000000000000000 : ℝ) ≤
      (-(1711110091506825365049 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5681524093830163 / 8000000000000000 : ℝ) =
            (5681524093830163 / 4000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5681524093830163 / 4000000000000000 : ℝ) ≤
            (1754625809993174634951 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1419631127775519 / 2000000000000000 : ℝ)) (q :=
      (5681524093830163 / 8000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_643_6 :
    Uω (aρ 6) (bρ 6) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(3667888836031086007881 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (27718236951226001 / 40000000000000000 : ℝ) ≤
      (-(3667888836031086007881 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (27718236951226001 / 40000000000000000 : ℝ) =
            (27718236951226001 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (27718236951226001 / 20000000000000000 : ℝ) ≤
            (3263582966968913992119 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1730176063763797 / 2500000000000000 : ℝ)) (q :=
      (27718236951226001 / 40000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_643_7 :
    Uω (aρ 7) (bρ 7) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(501458265861246567413 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (26781539918427609 / 40000000000000000 : ℝ) ≤
      (-(501458265861246567413 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (26781539918427609 / 40000000000000000 : ℝ) =
            (26781539918427609 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (26781539918427609 / 20000000000000000 : ℝ) ≤
            (364975709513753432587 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (834502139926999 / 1250000000000000 : ℝ)) (q :=
      (26781539918427609 / 40000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_643_8 :
    Uω (aρ 8) (bρ 8) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(4475773124241223698507 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (25566991920832123 / 40000000000000000 : ℝ) ≤
      (-(4475773124241223698507 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (25566991920832123 / 40000000000000000 : ℝ) =
            (25566991920832123 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (25566991920832123 / 20000000000000000 : ℝ) ≤
            (2455698678758776301493 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6352284771958249 / 10000000000000000 : ℝ)) (q :=
      (25566991920832123 / 40000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_643_9 :
    Uω (aρ 9) (bρ 9) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(1270840239499814070163 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (24059823099681563 / 40000000000000000 : ℝ) ≤
      (-(1270840239499814070163 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (24059823099681563 / 40000000000000000 : ℝ) =
            (24059823099681563 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (24059823099681563 / 20000000000000000 : ℝ) ≤
            (462027711250185929837 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5939665989742969 / 10000000000000000 : ℝ)) (q :=
      (24059823099681563 / 40000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_643_10 :
    Uω (aρ 10) (bρ 10) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(292906829020823116481 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (890644403785559 / 1600000000000000 : ℝ) ≤
      (-(292906829020823116481 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (890644403785559 / 1600000000000000 : ℝ) =
            (890644403785559 / 800000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (890644403785559 / 800000000000000 : ℝ) ≤
            (53666761129176883519 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (217254740828667 / 400000000000000 : ℝ)) (q :=
      (890644403785559 / 1600000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10]) (by norm_num [bρ_10])
      (by norm_num) (by norm_num [aρ_10, bρ_10]) (by norm_num [aρ_10, bρ_10]) hlg

lemma U_643_11 :
    Uω (aρ 11) (bρ 11) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(106631803823411271099 / 156250000000000000000 : ℝ)) := by
  have hlg :
    Real.log (20215222493405561 / 40000000000000000 : ℝ) ≤
      (-(106631803823411271099 / 156250000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (20215222493405561 / 40000000000000000 : ℝ) =
            (20215222493405561 / 20000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (20215222493405561 / 20000000000000000 : ℝ) ≤
            (1672443098463728901 / 156250000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (603050168288121 / 1250000000000000 : ℝ)) (q :=
      (20215222493405561 / 40000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_643_12 :
    Uω (aρ 12) (bρ 12) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(1601632961928138856129 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17958489802713691 / 40000000000000000 : ℝ) ≤
      (-(1601632961928138856129 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17958489802713691 / 40000000000000000 : ℝ) =
            (17958489802713691 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17958489802713691 / 10000000000000000 : ℝ) ≤
            (1170955759271861143871 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4119735097644033 / 10000000000000000 : ℝ)) (q :=
      (17958489802713691 / 40000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_643_13 :
    Uω (aρ 13) (bρ 13) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(4719934683011539956371 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3112588218111867 / 8000000000000000 : ℝ) ≤
      (-(4719934683011539956371 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3112588218111867 / 8000000000000000 : ℝ) =
            (3112588218111867 / 2000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3112588218111867 / 2000000000000000 : ℝ) ≤
            (2211537119988460043629 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (664268496632371 / 2000000000000000 : ℝ)) (q :=
      (3112588218111867 / 8000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_643_14 :
    Uω (aρ 14) (bρ 14) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(2791301348886200293647 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13096681978477213 / 40000000000000000 : ℝ) ≤
      (-(2791301348886200293647 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (13096681978477213 / 40000000000000000 : ℝ) =
            (13096681978477213 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13096681978477213 / 10000000000000000 : ℝ) ≤
            (674434552613799706353 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1216070106082897 / 5000000000000000 : ℝ)) (q :=
      (13096681978477213 / 40000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_643_15 :
    Uω (aρ 15) (bρ 15) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(13299454215022681784837 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (10579667853113777 / 40000000000000000 : ℝ) ≤
      (-(13299454215022681784837 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (10579667853113777 / 40000000000000000 : ℝ) =
            (10579667853113777 / 10000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (10579667853113777 / 10000000000000000 : ℝ) ≤
            (563489390977318215163 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (358301606724769 / 2500000000000000 : ℝ)) (q :=
      (10579667853113777 / 40000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_643_16 :
    Uω (aρ 16) (bρ 16) (23800963305737 / 32000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_643 :
    Uρ (23800963305737 / 32000000000000 : ℝ) ≤
      (-(5316853278250076301219 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (23800963305737 / 32000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1523610909408552015951 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (23800963305737 / 32000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1539838576871448098047 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (23800963305737 / 32000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(628974390773593105421 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (23800963305737 / 32000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(813498665028040558633 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (23800963305737 / 32000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1711110091506825365049 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (23800963305737 / 32000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3667888836031086007881 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (23800963305737 / 32000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(501458265861246567413 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (23800963305737 / 32000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4475773124241223698507 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (23800963305737 / 32000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(1270840239499814070163 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (23800963305737 / 32000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(292906829020823116481 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (23800963305737 / 32000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(106631803823411271099 / 156250000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (23800963305737 / 32000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1601632961928138856129 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (23800963305737 / 32000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(4719934683011539956371 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (23800963305737 / 32000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(2791301348886200293647 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (23800963305737 / 32000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(13299454215022681784837 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (23800963305737 / 32000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_643_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_644_1 :
    Uω (aρ 1) (bρ 1) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(3034313242643511466231 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7382805891615179 / 10000000000000000 : ℝ) ≤
      (-(3034313242643511466231 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7382805891615179 / 10000000000000000 : ℝ) =
            (7382805891615179 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7382805891615179 / 5000000000000000 : ℝ) ≤
            (3897158560356488533769 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7382783993723483 / 10000000000000000 : ℝ)) (q :=
      (7382805891615179 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_644_2 :
    Uω (aρ 2) (bρ 2) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(766681606501934609241 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14717829216098583 / 20000000000000000 : ℝ) ≤
      (-(766681606501934609241 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14717829216098583 / 20000000000000000 : ℝ) =
            (14717829216098583 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14717829216098583 / 10000000000000000 : ℝ) ≤
            (966186344248065390759 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1839692609775427 / 2500000000000000 : ℝ)) (q :=
      (14717829216098583 / 20000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_644_3 :
    Uω (aρ 3) (bρ 3) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(3131835926320268809229 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14622313452116153 / 20000000000000000 : ℝ) ≤
      (-(3131835926320268809229 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14622313452116153 / 20000000000000000 : ℝ) =
            (14622313452116153 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14622313452116153 / 10000000000000000 : ℝ) ≤
            (3799635876679731190771 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3655325390734639 / 5000000000000000 : ℝ)) (q :=
      (14622313452116153 / 20000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_644_4 :
    Uω (aρ 4) (bρ 4) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(810203488653197127289 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14463827506010701 / 20000000000000000 : ℝ) ≤
      (-(810203488653197127289 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14463827506010701 / 20000000000000000 : ℝ) =
            (14463827506010701 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14463827506010701 / 10000000000000000 : ℝ) ≤
            (922664462096802872711 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3615229508214413 / 5000000000000000 : ℝ)) (q :=
      (14463827506010701 / 20000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_644_5 :
    Uω (aρ 5) (bρ 5) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(852202912960722596749 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (14222868231935033 / 20000000000000000 : ℝ) ≤
      (-(852202912960722596749 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (14222868231935033 / 20000000000000000 : ℝ) =
            (14222868231935033 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (14222868231935033 / 10000000000000000 : ℝ) ≤
            (880665037789277403251 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3553844830844079 / 5000000000000000 : ℝ)) (q :=
      (14222868231935033 / 20000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_644_6 :
    Uω (aρ 6) (bρ 6) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(3654136752082123200103 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6939095381432753 / 10000000000000000 : ℝ) ≤
      (-(3654136752082123200103 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6939095381432753 / 10000000000000000 : ℝ) =
            (6939095381432753 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6939095381432753 / 5000000000000000 : ℝ) ≤
            (3277335050917876799897 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6930252567758631 / 10000000000000000 : ℝ)) (q :=
      (6939095381432753 / 10000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_644_7 :
    Uω (aρ 7) (bρ 7) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(3997410399111135964581 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (13409873089558651 / 20000000000000000 : ℝ) ≤
      (-(3997410399111135964581 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (13409873089558651 / 20000000000000000 : ℝ) =
            (13409873089558651 / 10000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (13409873089558651 / 10000000000000000 : ℝ) ≤
            (2934061403888864035419 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (13057805225023 / 19531250000000 : ℝ)) (q :=
      (13409873089558651 / 20000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_644_8 :
    Uω (aρ 8) (bρ 8) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(178431660047890653203 / 400000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3200665516391409 / 5000000000000000 : ℝ) ≤
      (-(178431660047890653203 / 400000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3200665516391409 / 5000000000000000 : ℝ) =
            (3200665516391409 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3200665516391409 / 2500000000000000 : ℝ) ≤
            (98827212072109346797 / 400000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6361926902558761 / 10000000000000000 : ℝ)) (q :=
      (3200665516391409 / 5000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_644_9 :
    Uω (aρ 9) (bρ 9) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(633417449450731358873 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1204920055477177 / 2000000000000000 : ℝ) ≤
      (-(633417449450731358873 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1204920055477177 / 2000000000000000 : ℝ) =
            (1204920055477177 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1204920055477177 / 1000000000000000 : ℝ) ≤
            (233016525924268641127 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1189886204024979 / 2000000000000000 : ℝ)) (q :=
      (1204920055477177 / 2000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_644_10 :
    Uω (aρ 10) (bρ 10) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(2920308785161509705411 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5576288076111443 / 10000000000000000 : ℝ) ≤
      (-(2920308785161509705411 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5576288076111443 / 10000000000000000 : ℝ) =
            (5576288076111443 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5576288076111443 / 5000000000000000 : ℝ) ≤
            (545427116338490294589 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5441365651071011 / 10000000000000000 : ℝ)) (q :=
      (5576288076111443 / 10000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_644_11 :
    Uω (aρ 11) (bρ 11) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(3402357746865413340039 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5063781536253397 / 10000000000000000 : ℝ) ≤
      (-(3402357746865413340039 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (5063781536253397 / 10000000000000000 : ℝ) =
            (5063781536253397 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5063781536253397 / 5000000000000000 : ℝ) ≤
            (63378154634586659961 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4834829197559919 / 10000000000000000 : ℝ)) (q :=
      (5063781536253397 / 10000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_644_12 :
    Uω (aρ 12) (bρ 12) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(3992539167654871337849 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (4499999379751123 / 10000000000000000 : ℝ) ≤
      (-(3992539167654871337849 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (4499999379751123 / 10000000000000000 : ℝ) =
            (4499999379751123 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (4499999379751123 / 2500000000000000 : ℝ) ≤
            (2938932635345128662151 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4130964981240371 / 10000000000000000 : ℝ)) (q :=
      (4499999379751123 / 10000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_644_13 :
    Uω (aρ 13) (bρ 13) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(9411249327571361579049 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1950943260898971 / 5000000000000000 : ℝ) ≤
      (-(9411249327571361579049 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1950943260898971 / 5000000000000000 : ℝ) =
            (1950943260898971 / 1250000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1950943260898971 / 1250000000000000 : ℝ) ≤
            (4451694278428638420951 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3334121006929009 / 10000000000000000 : ℝ)) (q :=
      (1950943260898971 / 5000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_644_14 :
    Uω (aρ 14) (bρ 14) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(5563087789113514828389 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6573948985756573 / 20000000000000000 : ℝ) ≤
      (-(5563087789113514828389 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (6573948985756573 / 20000000000000000 : ℝ) =
            (6573948985756573 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6573948985756573 / 5000000000000000 : ℝ) ≤
            (1368384013886485171611 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1224112117067349 / 5000000000000000 : ℝ)) (q :=
      (6573948985756573 / 20000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_644_15 :
    Uω (aρ 15) (bρ 15) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(13233586213666000565321 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2662396004972763 / 10000000000000000 : ℝ) ≤
      (-(13233586213666000565321 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (2662396004972763 / 10000000000000000 : ℝ) =
            (2662396004972763 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2662396004972763 / 2500000000000000 : ℝ) ≤
            (629357392333999434679 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1458640535738651 / 10000000000000000 : ℝ)) (q :=
      (2662396004972763 / 10000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_644_16 :
    Uω (aρ 16) (bρ 16) (11915720012147 / 16000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_644 :
    Uρ (11915720012147 / 16000000000000 : ℝ) ≤
      (-(2649474067190841539383 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (11915720012147 / 16000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(3034313242643511466231 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (11915720012147 / 16000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(766681606501934609241 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (11915720012147 / 16000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3131835926320268809229 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (11915720012147 / 16000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(810203488653197127289 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (11915720012147 / 16000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(852202912960722596749 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (11915720012147 / 16000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3654136752082123200103 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (11915720012147 / 16000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3997410399111135964581 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (11915720012147 / 16000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(178431660047890653203 / 400000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (11915720012147 / 16000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(633417449450731358873 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (11915720012147 / 16000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2920308785161509705411 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (11915720012147 / 16000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3402357746865413340039 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (11915720012147 / 16000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(3992539167654871337849 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (11915720012147 / 16000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(9411249327571361579049 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (11915720012147 / 16000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(5563087789113514828389 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (11915720012147 / 16000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(13233586213666000565321 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (11915720012147 / 16000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_644_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_645_1 :
    Uω (aρ 1) (bρ 1) (746637295669 / 1000000000000 : ℝ) ≤
      (-(1504272986350256580489 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7401853897065559 / 10000000000000000 : ℝ) ≤
      (-(1504272986350256580489 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (7401853897065559 / 10000000000000000 : ℝ) =
            (7401853897065559 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7401853897065559 / 5000000000000000 : ℝ) ≤
            (1961462915149743419511 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3700916027763059 / 5000000000000000 : ℝ)) (q :=
      (7401853897065559 / 10000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1]) (by norm_num [bρ_1])
      (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_645_2 :
    Uω (aρ 2) (bρ 2) (746637295669 / 1000000000000 : ℝ) ≤
      (-(3040875180557327393003 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1475592585872157 / 2000000000000000 : ℝ) ≤
      (-(3040875180557327393003 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1475592585872157 / 2000000000000000 : ℝ) =
            (1475592585872157 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1475592585872157 / 1000000000000000 : ℝ) ≤
            (3890596622442672606997 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (737781913262657 / 1000000000000000 : ℝ)) (q :=
      (1475592585872157 / 2000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_645_3 :
    Uω (aρ 3) (bρ 3) (746637295669 / 1000000000000 : ℝ) ≤
      (-(388226843643701977613 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1466041197994437 / 2000000000000000 : ℝ) ≤
      (-(388226843643701977613 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1466041197994437 / 2000000000000000 : ℝ) =
            (1466041197994437 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1466041197994437 / 1000000000000000 : ℝ) ≤
            (478207131731298022387 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (732970136019937 / 1000000000000000 : ℝ)) (q :=
      (1466041197994437 / 2000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_645_4 :
    Uω (aρ 4) (bρ 4) (746637295669 / 1000000000000 : ℝ) ≤
      (-(1607252284779575578089 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (580077241951651 / 800000000000000 : ℝ) ≤
      (-(1607252284779575578089 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (580077241951651 / 800000000000000 : ℝ) =
            (580077241951651 / 400000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (580077241951651 / 400000000000000 : ℝ) ≤
            (1858483616720424421911 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (289980584404451 / 400000000000000 : ℝ)) (q :=
      (580077241951651 / 800000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4]) (by norm_num [bρ_4])
      (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_645_5 :
    Uω (aρ 5) (bρ 5) (746637295669 / 1000000000000 : ℝ) ≤
      (-(3382048462402861285543 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (142609841460427 / 200000000000000 : ℝ) ≤
      (-(3382048462402861285543 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (142609841460427 / 200000000000000 : ℝ) =
            (142609841460427 / 100000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (142609841460427 / 100000000000000 : ℝ) ≤
            (3549423340597138714457 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (71267576266977 / 100000000000000 : ℝ)) (q :=
      (142609841460427 / 200000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5]) (by norm_num [bρ_5])
      (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_645_6 :
    Uω (aρ 6) (bρ 6) (746637295669 / 1000000000000 : ℝ) ≤
      (-(3626689334411872943689 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3479083784246109 / 5000000000000000 : ℝ) ≤
      (-(3626689334411872943689 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (3479083784246109 / 5000000000000000 : ℝ) =
            (3479083784246109 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3479083784246109 / 2500000000000000 : ℝ) ≤
            (3304782468588127056311 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1737337248194859 / 2500000000000000 : ℝ)) (q :=
      (3479083784246109 / 5000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6]) (by norm_num [bρ_6])
      (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_645_7 :
    Uω (aρ 7) (bρ 7) (746637295669 / 1000000000000 : ℝ) ≤
      (-(496120014692653319329 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (420252464955703 / 625000000000000 : ℝ) ≤
      (-(496120014692653319329 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (420252464955703 / 625000000000000 : ℝ) =
            (420252464955703 / 312500000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (420252464955703 / 312500000000000 : ℝ) ≤
            (370313960682346680671 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (838094264392187 / 1250000000000000 : ℝ)) (q :=
      (420252464955703 / 625000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_645_8 :
    Uω (aρ 8) (bρ 8) (746637295669 / 1000000000000 : ℝ) ≤
      (-(4430896251256838405569 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6420496605605981 / 10000000000000000 : ℝ) ≤
      (-(4430896251256838405569 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6420496605605981 / 10000000000000000 : ℝ) =
            (6420496605605981 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6420496605605981 / 5000000000000000 : ℝ) ≤
            (2500575551743161594431 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3190605049553481 / 5000000000000000 : ℝ)) (q :=
      (6420496605605981 / 10000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8]) (by norm_num [bρ_8])
      (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_645_9 :
    Uω (aρ 9) (bρ 9) (746637295669 / 1000000000000 : ℝ) ≤
      (-(2517687802170217421033 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (6043888113840151 / 10000000000000000 : ℝ) ≤
      (-(2517687802170217421033 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (6043888113840151 / 10000000000000000 : ℝ) =
            (6043888113840151 / 5000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (6043888113840151 / 5000000000000000 : ℝ) ≤
            (948048099329782578967 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2984479371967651 / 5000000000000000 : ℝ)) (q :=
      (6043888113840151 / 10000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9]) (by norm_num [bρ_9])
      (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_645_10 :
    Uω (aρ 10) (bρ 10) (746637295669 / 1000000000000 : ℝ) ≤
      (-(2902837945202620132743 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (2797903322069447 / 5000000000000000 : ℝ) ≤
      (-(2902837945202620132743 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (2797903322069447 / 5000000000000000 : ℝ) =
            (2797903322069447 / 2500000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (2797903322069447 / 2500000000000000 : ℝ) ≤
            (562897956297379867257 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1365338709506947 / 2500000000000000 : ℝ)) (q :=
      (2797903322069447 / 5000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_645_11 :
    Uω (aρ 11) (bρ 11) (746637295669 / 1000000000000 : ℝ) ≤
      (-(1691350707796066750917 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1016745558211633 / 2000000000000000 : ℝ) ≤
      (-(1691350707796066750917 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (1016745558211633 / 2000000000000000 : ℝ) =
            (1016745558211633 / 1000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 3
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1016745558211633 / 1000000000000000 : ℝ) ≤
            (41517242953933249083 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (485567375807133 / 1000000000000000 : ℝ)) (q :=
      (1016745558211633 / 2000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_645_12 :
    Uω (aρ 12) (bρ 12) (746637295669 / 1000000000000 : ℝ) ≤
      (-(3969546476480306766289 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (9041480903424091 / 20000000000000000 : ℝ) ≤
      (-(3969546476480306766289 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (9041480903424091 / 20000000000000000 : ℝ) =
            (9041480903424091 / 5000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (9041480903424091 / 5000000000000000 : ℝ) ≤
            (2961925326519693233711 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4153399176064091 / 10000000000000000 : ℝ)) (q :=
      (9041480903424091 / 20000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_645_13 :
    Uω (aρ 13) (bρ 13) (746637295669 / 1000000000000 : ℝ) ≤
      (-(935433640031612922849 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (1569662645146701 / 4000000000000000 : ℝ) ≤
      (-(935433640031612922849 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (1569662645146701 / 4000000000000000 : ℝ) =
            (1569662645146701 / 1000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (1569662645146701 / 1000000000000000 : ℝ) ≤
            (450860720568387077151 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (671922647993701 / 2000000000000000 : ℝ)) (q :=
      (1569662645146701 / 4000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_645_14 :
    Uω (aρ 14) (bρ 14) (746637295669 / 1000000000000 : ℝ) ≤
      (-(1104887668831840048521 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (3312480894648137 / 10000000000000000 : ℝ) ≤
      (-(1104887668831840048521 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (3312480894648137 / 10000000000000000 : ℝ) =
            (3312480894648137 / 2500000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (3312480894648137 / 2500000000000000 : ℝ) ≤
            (281406691768159951479 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1240094544288137 / 5000000000000000 : ℝ)) (q :=
      (3312480894648137 / 10000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_645_15 :
    Uω (aρ 15) (bρ 15) (746637295669 / 1000000000000 : ℝ) ≤
      (-(6552593809832138435991 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (67420030040337 / 250000000000000 : ℝ) ≤
      (-(6552593809832138435991 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (67420030040337 / 250000000000000 : ℝ) = (67420030040337 / 62500000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (67420030040337 / 62500000000000 : ℝ) ≤
            (378877993167861564009 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (37710074498049 / 250000000000000 : ℝ)) (q :=
      (67420030040337 / 250000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15]) (by norm_num [bρ_15])
      (by norm_num) (by norm_num [aρ_15, bρ_15]) (by norm_num [aρ_15, bρ_15]) hlg

lemma U_645_16 :
    Uω (aρ 16) (bρ 16) (746637295669 / 1000000000000 : ℝ) ≤
      (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
  by rw [Uω_of_mem (by norm_num [aρ_16]) (by norm_num [bρ_16])]; exact Lmid_16

lemma U_645 :
    Uρ (746637295669 / 1000000000000 : ℝ) ≤
      (-(5263357591767758389913 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (746637295669 / 1000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1504272986350256580489 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (746637295669 / 1000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3040875180557327393003 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (746637295669 / 1000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(388226843643701977613 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (746637295669 / 1000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1607252284779575578089 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (746637295669 / 1000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3382048462402861285543 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (746637295669 / 1000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3626689334411872943689 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (746637295669 / 1000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(496120014692653319329 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (746637295669 / 1000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4430896251256838405569 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (746637295669 / 1000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2517687802170217421033 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (746637295669 / 1000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2902837945202620132743 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (746637295669 / 1000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1691350707796066750917 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (746637295669 / 1000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(3969546476480306766289 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (746637295669 / 1000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(935433640031612922849 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (746637295669 / 1000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(1104887668831840048521 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (746637295669 / 1000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(6552593809832138435991 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (746637295669 / 1000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(419641552645073499393 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_645_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_646_1 :
    Uω (aρ 1) (bρ 1) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(2992023359028118615229 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (949004006820246619 / 1280000000000000000 : ℝ) ≤
      (-(2992023359028118615229 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (949004006820246619 / 1280000000000000000 : ℝ) =
            (949004006820246619 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (949004006820246619 / 640000000000000000 : ℝ) ≤
            (3939448443971881384771 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7414071997801871 / 10000000000000000 : ℝ)) (q :=
      (949004006820246619 / 1280000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_646_2 :
    Uω (aρ 2) (bρ 2) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3024298834984676636863 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (37837839552948499 / 51200000000000000 : ℝ) ≤
      (-(3024298834984676636863 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (37837839552948499 / 51200000000000000 : ℝ) =
            (37837839552948499 / 25600000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (37837839552948499 / 25600000000000000 : ℝ) ≤
            (3907172968015323363137 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (295602379164641 / 400000000000000 : ℝ)) (q :=
      (37837839552948499 / 51200000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2]) (by norm_num [bρ_2])
      (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_646_3 :
    Uω (aρ 3) (bρ 3) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3089129675859665067647 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (187966635556047583 / 256000000000000000 : ℝ) ≤
      (-(3089129675859665067647 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (187966635556047583 / 256000000000000000 : ℝ) =
            (187966635556047583 / 128000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (187966635556047583 / 128000000000000000 : ℝ) ≤
            (3842342127140334932353 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1468388582582347 / 2000000000000000 : ℝ)) (q :=
      (187966635556047583 / 256000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_646_4 :
    Uω (aρ 4) (bρ 4) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3197635102305245452937 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (929690603533680987 / 1280000000000000000 : ℝ) ≤
      (-(3197635102305245452937 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (929690603533680987 / 1280000000000000000 : ℝ) =
            (929690603533680987 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (929690603533680987 / 640000000000000000 : ℝ) ≤
            (3733836700694754547063 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7261759371374283 / 10000000000000000 : ℝ)) (q :=
      (929690603533680987 / 1280000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_646_5 :
    Uω (aρ 5) (bρ 5) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3364888680715927873629 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (914270508277011163 / 1280000000000000000 : ℝ) ≤
      (-(3364888680715927873629 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (914270508277011163 / 1280000000000000000 : ℝ) =
            (914270508277011163 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (914270508277011163 / 640000000000000000 : ℝ) ≤
            (3566583122284072126371 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7139010302323817 / 10000000000000000 : ℝ)) (q :=
      (914270508277011163 / 1280000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_646_6 :
    Uω (aρ 6) (bρ 6) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(902272973128295129753 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (892214136760683483 / 1280000000000000000 : ℝ) ≤
      (-(902272973128295129753 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (892214136760683483 / 1280000000000000000 : ℝ) =
            (892214136760683483 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (892214136760683483 / 640000000000000000 : ℝ) ≤
            (830594977621704870247 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6961619872521197 / 10000000000000000 : ℝ)) (q :=
      (892214136760683483 / 1280000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_646_7 :
    Uω (aρ 7) (bρ 7) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3950721346605848420679 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (172449649957237919 / 256000000000000000 : ℝ) ≤
      (-(3950721346605848420679 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (172449649957237919 / 256000000000000000 : ℝ) =
            (172449649957237919 / 128000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (172449649957237919 / 128000000000000000 : ℝ) ≤
            (2980750456394151579321 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (671706426930473 / 1000000000000000 : ℝ)) (q :=
      (172449649957237919 / 256000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_646_8 :
    Uω (aρ 8) (bρ 8) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(1102933434446520637007 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (823399895872270299 / 1280000000000000000 : ℝ) ≤
      (-(1102933434446520637007 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (823399895872270299 / 1280000000000000000 : ℝ) =
            (823399895872270299 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (823399895872270299 / 640000000000000000 : ℝ) ≤
            (629934516303479362993 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6393600390739741 / 10000000000000000 : ℝ)) (q :=
      (823399895872270299 / 1280000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_646_9 :
    Uω (aρ 9) (bρ 9) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(5014891254244500333307 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (775204008300344347 / 1280000000000000000 : ℝ) ≤
      (-(5014891254244500333307 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (775204008300344347 / 1280000000000000000 : ℝ) =
            (775204008300344347 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (775204008300344347 / 640000000000000000 : ℝ) ≤
            (1916580548755499666693 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2990752637894199 / 5000000000000000 : ℝ)) (q :=
      (775204008300344347 / 1280000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_646_10 :
    Uω (aρ 10) (bρ 10) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(2891645207438468629941 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (28714737430711059 / 51200000000000000 : ℝ) ≤
      (-(2891645207438468629941 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (28714737430711059 / 51200000000000000 : ℝ) =
            (28714737430711059 / 25600000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (28714737430711059 / 25600000000000000 : ℝ) ≤
            (574090694061531370059 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (218967839538481 / 400000000000000 : ℝ)) (q :=
      (28714737430711059 / 51200000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_646_11 :
    Uω (aρ 11) (bρ 11) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(6740230160113358478249 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (652357249560574811 / 1280000000000000000 : ℝ) ≤
      (-(6740230160113358478249 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (652357249560574811 / 1280000000000000000 : ℝ) =
            (652357249560574811 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (652357249560574811 / 640000000000000000 : ℝ) ≤
            (191241642886641521751 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4869060330179499 / 10000000000000000 : ℝ)) (q :=
      (652357249560574811 / 1280000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_646_12 :
    Uω (aρ 12) (bρ 12) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3954837198590898932649 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (580359603050208539 / 1280000000000000000 : ℝ) ≤
      (-(3954837198590898932649 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (580359603050208539 / 1280000000000000000 : ℝ) =
            (580359603050208539 / 320000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (580359603050208539 / 320000000000000000 : ℝ) ≤
            (2976634604409101067351 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2083898600070013 / 5000000000000000 : ℝ)) (q :=
      (580359603050208539 / 1280000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_646_13 :
    Uω (aρ 13) (bρ 13) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(9317992342333403447889 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (100824180191920607 / 256000000000000000 : ℝ) ≤
      (-(9317992342333403447889 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (100824180191920607 / 256000000000000000 : ℝ) =
            (100824180191920607 / 64000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (100824180191920607 / 64000000000000000 : ℝ) ≤
            (4544951263666596552111 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (675189844313863 / 2000000000000000 : ℝ)) (q :=
      (100824180191920607 / 256000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_646_14 :
    Uω (aρ 14) (bρ 14) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(10999728173947622292111 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (85217313779522783 / 256000000000000000 : ℝ) ≤
      (-(10999728173947622292111 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (85217313779522783 / 256000000000000000 : ℝ) =
            (85217313779522783 / 64000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (85217313779522783 / 64000000000000000 : ℝ) ≤
            (2863215432052377707889 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (500118013629147 / 2000000000000000 : ℝ)) (q :=
      (85217313779522783 / 256000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_646_15 :
    Uω (aρ 15) (bρ 15) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3256218652869368476347 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (347974045552011739 / 1280000000000000000 : ℝ) ≤
      (-(3256218652869368476347 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (347974045552011739 / 1280000000000000000 : ℝ) =
            (347974045552011739 / 320000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (347974045552011739 / 320000000000000000 : ℝ) ≤
            (209517248630631523653 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1539655168285701 / 10000000000000000 : ℝ)) (q :=
      (347974045552011739 / 1280000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_646_16 :
    Uω (aρ 16) (bρ 16) (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(3195214162855050481337 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (259046679374740763 / 1280000000000000000 : ℝ) ≤
      (-(3195214162855050481337 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (259046679374740763 / 1280000000000000000 : ℝ) =
            (259046679374740763 / 160000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (259046679374740763 / 160000000000000000 : ℝ) ≤
            (963668918944949518663 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (151268361637921 / 5000000000000000 : ℝ)) (q :=
      (259046679374740763 / 1280000000000000000 : ℝ)) (by norm_num [aρ_16, bρ_16])
      (by norm_num [bρ_16]) (by norm_num) (by norm_num [aρ_16, bρ_16])
      (by norm_num [aρ_16, bρ_16]) hlg

lemma U_646 :
    Uρ (765809953469387 / 1024000000000000 : ℝ) ≤
      (-(2617905894506130104443 / 5000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (765809953469387 / 1024000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2992023359028118615229 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) *
        Uω (aρ 2) (bρ 2) (765809953469387 / 1024000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3024298834984676636863 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) *
        Uω (aρ 3) (bρ 3) (765809953469387 / 1024000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3089129675859665067647 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (765809953469387 / 1024000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3197635102305245452937 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (765809953469387 / 1024000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3364888680715927873629 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) *
        Uω (aρ 6) (bρ 6) (765809953469387 / 1024000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(902272973128295129753 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) *
        Uω (aρ 7) (bρ 7) (765809953469387 / 1024000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3950721346605848420679 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) *
        Uω (aρ 8) (bρ 8) (765809953469387 / 1024000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(1102933434446520637007 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (765809953469387 / 1024000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(5014891254244500333307 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) *
        Uω (aρ 10) (bρ 10) (765809953469387 / 1024000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2891645207438468629941 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) *
        Uω (aρ 11) (bρ 11) (765809953469387 / 1024000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(6740230160113358478249 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) *
        Uω (aρ 12) (bρ 12) (765809953469387 / 1024000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(3954837198590898932649 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) *
        Uω (aρ 13) (bρ 13) (765809953469387 / 1024000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(9317992342333403447889 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) *
        Uω (aρ 14) (bρ 14) (765809953469387 / 1024000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(10999728173947622292111 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (765809953469387 / 1024000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(3256218652869368476347 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) *
        Uω (aρ 16) (bρ 16) (765809953469387 / 1024000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) *
        (-(3195214162855050481337 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_646_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_647_1 :
    Uω (aρ 1) (bρ 1) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(2975528000166417994777 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (475285357400443739 / 640000000000000000 : ℝ) ≤
      (-(2975528000166417994777 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (475285357400443739 / 640000000000000000 : ℝ) =
            (475285357400443739 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (475285357400443739 / 320000000000000000 : ℝ) ≤
            (3955943802833582005223 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3713155969919951 / 5000000000000000 : ℝ)) (q :=
      (475285357400443739 / 640000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_647_2 :
    Uω (aρ 2) (bρ 2) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(3007749922533249645921 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (473756361294213403 / 640000000000000000 : ℝ) ≤
      (-(3007749922533249645921 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (473756361294213403 / 640000000000000000 : ℝ) =
            (473756361294213403 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (473756361294213403 / 320000000000000000 : ℝ) ≤
            (3923721880466750354079 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1850574956007551 / 2500000000000000 : ℝ)) (q :=
      (473756361294213403 / 640000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_647_3 :
    Uω (aρ 3) (bρ 3) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(3072472399178550156159 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (470699994242783899 / 640000000000000000 : ℝ) ≤
      (-(3072472399178550156159 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (470699994242783899 / 640000000000000000 : ℝ) =
            (470699994242783899 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (470699994242783899 / 320000000000000000 : ℝ) ≤
            (3858999403821449843841 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (919273057502879 / 1250000000000000 : ℝ)) (q :=
      (470699994242783899 / 640000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_647_4 :
    Uω (aρ 4) (bρ 4) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(3180794056339040181553 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (465628809445522491 / 640000000000000000 : ℝ) ≤
      (-(3180794056339040181553 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (465628809445522491 / 640000000000000000 : ℝ) =
            (465628809445522491 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (465628809445522491 / 320000000000000000 : ℝ) ≤
            (3750677746660959818447 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7274004116173613 / 10000000000000000 : ℝ)) (q :=
      (465628809445522491 / 640000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_647_5 :
    Uω (aρ 5) (bρ 5) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(1673879162526766033253 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (457919014200195963 / 640000000000000000 : ℝ) ≤
      (-(1673879162526766033253 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (457919014200195963 / 640000000000000000 : ℝ) =
            (457919014200195963 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (457919014200195963 / 320000000000000000 : ℝ) ≤
            (1791856738973233966747 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7151262934092159 / 10000000000000000 : ℝ)) (q :=
      (457919014200195963 / 640000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_647_6 :
    Uω (aρ 6) (bρ 6) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(1795762720630881838427 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (446891408889576027 / 640000000000000000 : ℝ) ≤
      (-(1795762720630881838427 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (446891408889576027 / 640000000000000000 : ℝ) =
            (446891408889576027 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (446891408889576027 / 320000000000000000 : ℝ) ≤
            (1669973180869118161573 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3486945321637643 / 5000000000000000 : ℝ)) (q :=
      (446891408889576027 / 640000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_647_7 :
    Uω (aρ 7) (bρ 7) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(983128992591838766227 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (431909717466452347 / 640000000000000000 : ℝ) ≤
      (-(983128992591838766227 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (431909717466452347 / 640000000000000000 : ℝ) =
            (431909717466452347 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (431909717466452347 / 320000000000000000 : ℝ) ≤
            (749738958158161233773 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6729374167062671 / 10000000000000000 : ℝ)) (q :=
      (431909717466452347 / 640000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_647_8 :
    Uω (aρ 8) (bρ 8) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(4392608322960627458259 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (412488094606284123 / 640000000000000000 : ℝ) ≤
      (-(4392608322960627458259 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (412488094606284123 / 640000000000000000 : ℝ) =
            (412488094606284123 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (412488094606284123 / 320000000000000000 : ℝ) ≤
            (2538863480039372541741 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3202995052011207 / 5000000000000000 : ℝ)) (q :=
      (412488094606284123 / 640000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_647_9 :
    Uω (aρ 9) (bρ 9) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(998889964806808706123 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (388395128435461531 / 640000000000000000 : ℝ) ≤
      (-(998889964806808706123 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (388395128435461531 / 640000000000000000 : ℝ) =
            (388395128435461531 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (388395128435461531 / 320000000000000000 : ℝ) ≤
            (387404395793191293877 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (374628158721513 / 625000000000000 : ℝ)) (q :=
      (388395128435461531 / 640000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_647_10 :
    Uω (aρ 10) (bρ 10) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(5760957383230505686231 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (359736722593189947 / 640000000000000000 : ℝ) ≤
      (-(5760957383230505686231 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (359736722593189947 / 640000000000000000 : ℝ) =
            (359736722593189947 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (359736722593189947 / 320000000000000000 : ℝ) ≤
            (1170514419769494313769 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5487034390468221 / 10000000000000000 : ℝ)) (q :=
      (359736722593189947 / 640000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_647_11 :
    Uω (aρ 11) (bρ 11) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(3357563293086641684171 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (326998478334935771 / 640000000000000000 : ℝ) ≤
      (-(3357563293086641684171 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (326998478334935771 / 640000000000000000 : ℝ) =
            (326998478334935771 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (326998478334935771 / 320000000000000000 : ℝ) ≤
            (108172608413358315829 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (2441220441801389 / 5000000000000000 : ℝ)) (q :=
      (326998478334935771 / 640000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_647_12 :
    Uω (aρ 12) (bρ 12) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(1970089311762010817417 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58206354853245951 / 128000000000000000 : ℝ) ≤
      (-(1970089311762010817417 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58206354853245951 / 128000000000000000 : ℝ) =
            (58206354853245951 / 32000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58206354853245951 / 32000000000000000 : ℝ) ≤
            (1495646589737989182583 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (836436295628143 / 2000000000000000 : ℝ)) (q :=
      (58206354853245951 / 128000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_647_13 :
    Uω (aρ 13) (bρ 13) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(1856364708443179756327 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (252973773579265531 / 640000000000000000 : ℝ) ≤
      (-(1856364708443179756327 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (252973773579265531 / 640000000000000000 : ℝ) =
            (252973773579265531 / 160000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (252973773579265531 / 160000000000000000 : ℝ) ≤
            (916224012756820243673 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3392250698268083 / 10000000000000000 : ℝ)) (q :=
      (252973773579265531 / 640000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_647_14 :
    Uω (aρ 14) (bρ 14) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(10950977982772224991237 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (42816882045091679 / 128000000000000000 : ℝ) ≤
      (-(10950977982772224991237 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (42816882045091679 / 128000000000000000 : ℝ) =
            (42816882045091679 / 32000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (42816882045091679 / 32000000000000000 : ℝ) ≤
            (2911965623227775008763 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (252088537850661 / 1000000000000000 : ℝ)) (q :=
      (42816882045091679 / 128000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_647_15 :
    Uω (aρ 15) (bρ 15) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(80913513290171031217 / 62500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (7014476874257139 / 25600000000000000 : ℝ) ≤
      (-(80913513290171031217 / 62500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (7014476874257139 / 25600000000000000 : ℝ) =
            (7014476874257139 / 6400000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (7014476874257139 / 6400000000000000 : ℝ) ≤
            (5729884247328968783 / 62500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (62815235775577 / 400000000000000 : ℝ)) (q :=
      (7014476874257139 / 25600000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_647_16 :
    Uω (aρ 16) (bρ 16) (383531658086859 / 512000000000000 : ℝ) ≤
      (-(7820519683689689857467 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (5357451598432147 / 25600000000000000 : ℝ) ≤
      (-(7820519683689689857467 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (5357451598432147 / 25600000000000000 : ℝ) =
            (5357451598432147 / 3200000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (5357451598432147 / 3200000000000000 : ℝ) ≤
            (2576688020810310142533 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (8564030983223 / 200000000000000 : ℝ)) (q :=
      (5357451598432147 / 25600000000000000 : ℝ)) (by norm_num [aρ_16, bρ_16])
      (by norm_num [bρ_16]) (by norm_num) (by norm_num [aρ_16, bρ_16])
      (by norm_num [aρ_16, bρ_16]) hlg

lemma U_647 :
    Uρ (383531658086859 / 512000000000000 : ℝ) ≤
      (-(5211206336518075658923 / 10000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (383531658086859 / 512000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(2975528000166417994777 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (383531658086859 / 512000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(3007749922533249645921 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (383531658086859 / 512000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3072472399178550156159 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (383531658086859 / 512000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3180794056339040181553 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (383531658086859 / 512000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1673879162526766033253 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (383531658086859 / 512000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1795762720630881838427 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (383531658086859 / 512000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(983128992591838766227 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (383531658086859 / 512000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4392608322960627458259 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (383531658086859 / 512000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(998889964806808706123 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) *
        Uω (aρ 10) (bρ 10) (383531658086859 / 512000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5760957383230505686231 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) *
        Uω (aρ 11) (bρ 11) (383531658086859 / 512000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3357563293086641684171 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) *
        Uω (aρ 12) (bρ 12) (383531658086859 / 512000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1970089311762010817417 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) *
        Uω (aρ 13) (bρ 13) (383531658086859 / 512000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(1856364708443179756327 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) *
        Uω (aρ 14) (bρ 14) (383531658086859 / 512000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(10950977982772224991237 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (383531658086859 / 512000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) * (-(80913513290171031217 / 62500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) *
        Uω (aρ 16) (bρ 16) (383531658086859 / 512000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) *
        (-(7820519683689689857467 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_647_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_648_1 :
    Uω (aρ 1) (bρ 1) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(1479529903173407912513 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (190427484553277853 / 256000000000000000 : ℝ) ≤
      (-(1479529903173407912513 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (190427484553277853 / 256000000000000000 : ℝ) =
            (190427484553277853 / 128000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (190427484553277853 / 128000000000000000 : ℝ) ≤
            (1986205998326592087487 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1487710376328277 / 2000000000000000 : ℝ)) (q :=
      (190427484553277853 / 256000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_648_2 :
    Uω (aρ 2) (bρ 2) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(1495614176274166129169 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (949079456252822801 / 1280000000000000000 : ℝ) ≤
      (-(1495614176274166129169 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (949079456252822801 / 1280000000000000000 : ℝ) =
            (949079456252822801 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (949079456252822801 / 640000000000000000 : ℝ) ≤
            (1970121725225833870831 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7414540167376909 / 10000000000000000 : ℝ)) (q :=
      (949079456252822801 / 1280000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_648_3 :
    Uω (aρ 3) (bρ 3) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(1527921413315886781817 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (942966798834216401 / 1280000000000000000 : ℝ) ≤
      (-(1527921413315886781817 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (942966798834216401 / 1280000000000000000 : ℝ) =
            (942966798834216401 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (942966798834216401 / 640000000000000000 : ℝ) ≤
            (1937814488184113218183 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (230200812548787 / 312500000000000 : ℝ)) (q :=
      (942966798834216401 / 1280000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_648_4 :
    Uω (aρ 4) (bρ 4) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(1581990668008304209843 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (932824633200045713 / 1280000000000000000 : ℝ) ≤
      (-(1581990668008304209843 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (932824633200045713 / 1280000000000000000 : ℝ) =
            (932824633200045713 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (932824633200045713 / 640000000000000000 : ℝ) ≤
            (1883745233491695790157 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7286248844592267 / 10000000000000000 : ℝ)) (q :=
      (932824633200045713 / 1280000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_648_5 :
    Uω (aρ 5) (bρ 5) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(3330657294562922625271 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (917405545731278097 / 1280000000000000000 : ℝ) ≤
      (-(3330657294562922625271 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (917405545731278097 / 1280000000000000000 : ℝ) =
            (917405545731278097 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (917405545731278097 / 640000000000000000 : ℝ) ≤
            (3600814508437077374729 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7163515522227773 / 10000000000000000 : ℝ)) (q :=
      (917405545731278097 / 1280000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_648_6 :
    Uω (aρ 6) (bρ 6) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(714797974284375681511 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (895351491859164177 / 1280000000000000000 : ℝ) ≤
      (-(714797974284375681511 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (895351491859164177 / 1280000000000000000 : ℝ) =
            (895351491859164177 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (895351491859164177 / 640000000000000000 : ℝ) ≤
            (671496386315624318489 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6986161305615993 / 10000000000000000 : ℝ)) (q :=
      (895351491859164177 / 1280000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_648_7 :
    Uω (aρ 7) (bρ 7) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(489292983258718903463 / 1250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (865390603759317137 / 1280000000000000000 : ℝ) ≤
      (-(489292983258718903463 / 1250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (865390603759317137 / 1280000000000000000 : ℝ) =
            (865390603759317137 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (865390603759317137 / 640000000000000000 : ℝ) ≤
            (377140992116281096537 / 1250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6741683809815883 / 10000000000000000 : ℝ)) (q :=
      (865390603759317137 / 1280000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_648_8 :
    Uω (aρ 8) (bρ 8) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(4373519861695254145247 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (826552445752811537 / 1280000000000000000 : ℝ) ≤
      (-(4373519861695254145247 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (826552445752811537 / 1280000000000000000 : ℝ) =
            (826552445752811537 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (826552445752811537 / 640000000000000000 : ℝ) ≤
            (2557951941304745854753 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6418379242304233 / 10000000000000000 : ℝ)) (q :=
      (826552445752811537 / 1280000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_648_9 :
    Uω (aρ 9) (bρ 9) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(2487025564965771604759 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (778376424791792401 / 1280000000000000000 : ℝ) ≤
      (-(2487025564965771604759 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (778376424791792401 / 1280000000000000000 : ℝ) =
            (778376424791792401 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (778376424791792401 / 640000000000000000 : ℝ) ≤
            (978710336534228395241 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6006594543148309 / 10000000000000000 : ℝ)) (q :=
      (778376424791792401 / 1280000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_648_10 :
    Uω (aρ 10) (bρ 10) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(1434669134801156281813 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (721078279937399953 / 1280000000000000000 : ℝ) ≤
      (-(1434669134801156281813 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (721078279937399953 / 1280000000000000000 : ℝ) =
            (721078279937399953 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (721078279937399953 / 640000000000000000 : ℝ) ≤
            (298198815948843718187 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5499870063293427 / 10000000000000000 : ℝ)) (q :=
      (721078279937399953 / 1280000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_648_11 :
    Uω (aρ 11) (bρ 11) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(3345045850188347560643 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (655636281741624337 / 1280000000000000000 : ℝ) ≤
      (-(3345045850188347560643 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (655636281741624337 / 1280000000000000000 : ℝ) =
            (655636281741624337 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (655636281741624337 / 640000000000000000 : ℝ) ≤
            (120690051311652439357 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4895815467689433 / 10000000000000000 : ℝ)) (q :=
      (655636281741624337 / 1280000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_648_12 :
    Uω (aρ 12) (bρ 12) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(245348147203090920197 / 312500000000000000000 : ℝ)) := by
  have hlg :
    Real.log (116753324662457309 / 256000000000000000 : ℝ) ≤
      (-(245348147203090920197 / 312500000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (116753324662457309 / 256000000000000000 : ℝ) =
            (116753324662457309 / 64000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (116753324662457309 / 64000000000000000 : ℝ) ≤
            (187868840484409079803 / 312500000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (419655215141603 / 1000000000000000 : ℝ)) (q :=
      (116753324662457309 / 256000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_648_13 :
    Uω (aρ 13) (bρ 13) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(9245827955184049930021 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (507772016727975633 / 1280000000000000000 : ℝ) ≤
      (-(9245827955184049930021 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (507772016727975633 / 1280000000000000000 : ℝ) =
            (507772016727975633 / 320000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (507772016727975633 / 320000000000000000 : ℝ) ≤
            (4617115650815950069979 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (852129541282793 / 2500000000000000 : ℝ)) (q :=
      (507772016727975633 / 1280000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_648_14 :
    Uω (aρ 14) (bρ 14) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(10902617715487759439317 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (86048894243380189 / 256000000000000000 : ℝ) ≤
      (-(10902617715487759439317 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (86048894243380189 / 256000000000000000 : ℝ) =
            (86048894243380189 / 64000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (86048894243380189 / 64000000000000000 : ℝ) ≤
            (2960325890512240560683 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (254107755156563 / 1000000000000000 : ℝ)) (q :=
      (86048894243380189 / 256000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_648_15 :
    Uω (aρ 15) (bρ 15) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(12868962730306120814047 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (353441888679318097 / 1280000000000000000 : ℝ) ≤
      (-(12868962730306120814047 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (353441888679318097 / 1280000000000000000 : ℝ) =
            (353441888679318097 / 320000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 5
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (353441888679318097 / 320000000000000000 : ℝ) ≤
            (993980875693879185953 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (800305238415449 / 5000000000000000 : ℝ)) (q :=
      (353441888679318097 / 1280000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_648_16 :
    Uω (aρ 16) (bρ 16) (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(3076834627347482851323 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (274842454963529489 / 1280000000000000000 : ℝ) ≤
      (-(3076834627347482851323 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (274842454963529489 / 1280000000000000000 : ℝ) =
            (274842454963529489 / 160000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (274842454963529489 / 160000000000000000 : ℝ) ≤
            (1082048454452517148677 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (524865976531701 / 10000000000000000 : ℝ)) (q :=
      (274842454963529489 / 1280000000000000000 : ℝ)) (by norm_num [aρ_16, bρ_16])
      (by norm_num [bρ_16]) (by norm_num) (by norm_num [aρ_16, bρ_16])
      (by norm_num [aρ_16, bρ_16]) hlg

lemma U_648 :
    Uρ (768316678878049 / 1024000000000000 : ℝ) ≤
      (-(1037435107378750881219 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (768316678878049 / 1024000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1479529903173407912513 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) *
        Uω (aρ 2) (bρ 2) (768316678878049 / 1024000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1495614176274166129169 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) *
        Uω (aρ 3) (bρ 3) (768316678878049 / 1024000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1527921413315886781817 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (768316678878049 / 1024000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1581990668008304209843 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (768316678878049 / 1024000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3330657294562922625271 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) *
        Uω (aρ 6) (bρ 6) (768316678878049 / 1024000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(714797974284375681511 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) *
        Uω (aρ 7) (bρ 7) (768316678878049 / 1024000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(489292983258718903463 / 1250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) *
        Uω (aρ 8) (bρ 8) (768316678878049 / 1024000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4373519861695254145247 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (768316678878049 / 1024000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2487025564965771604759 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) *
        Uω (aρ 10) (bρ 10) (768316678878049 / 1024000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(1434669134801156281813 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) *
        Uω (aρ 11) (bρ 11) (768316678878049 / 1024000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(3345045850188347560643 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) *
        Uω (aρ 12) (bρ 12) (768316678878049 / 1024000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) * (-(245348147203090920197 / 312500000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) *
        Uω (aρ 13) (bρ 13) (768316678878049 / 1024000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(9245827955184049930021 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) *
        Uω (aρ 14) (bρ 14) (768316678878049 / 1024000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(10902617715487759439317 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (768316678878049 / 1024000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(12868962730306120814047 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) *
        Uω (aρ 16) (bρ 16) (768316678878049 / 1024000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) *
        (-(3076834627347482851323 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_648_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_649_1 :
    Uω (aρ 1) (bρ 1) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(1471309344121746862427 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (238426032679206651 / 320000000000000000 : ℝ) ≤
      (-(1471309344121746862427 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (238426032679206651 / 320000000000000000 : ℝ) =
            (238426032679206651 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (238426032679206651 / 160000000000000000 : ℝ) ≤
            (1994426557378253137573 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3725395911603743 / 5000000000000000 : ℝ)) (q :=
      (238426032679206651 / 320000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_649_2 :
    Uω (aρ 2) (bρ 2) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(2974734034823848649063 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (237661547454349131 / 320000000000000000 : ℝ) ≤
      (-(2974734034823848649063 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (237661547454349131 / 320000000000000000 : ℝ) =
            (237661547454349131 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (237661547454349131 / 160000000000000000 : ℝ) ≤
            (3956737768176151350937 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7426780509163891 / 10000000000000000 : ℝ)) (q :=
      (237661547454349131 / 320000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_649_3 :
    Uω (aρ 3) (bρ 3) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(3039240866205603229829 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (47226680441397951 / 64000000000000000 : ℝ) ≤
      (-(3039240866205603229829 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (47226680441397951 / 64000000000000000 : ℝ) =
            (47226680441397951 / 32000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (47226680441397951 / 32000000000000000 : ℝ) ≤
            (3892230936794396770171 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (737866753755393 / 1000000000000000 : ℝ)) (q :=
      (47226680441397951 / 64000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3]) (by norm_num [bρ_3])
      (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_649_4 :
    Uω (aρ 4) (bρ 4) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(1573598423088097864679 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (233597911616489947 / 320000000000000000 : ℝ) ≤
      (-(1573598423088097864679 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (233597911616489947 / 320000000000000000 : ℝ) =
            (233597911616489947 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (233597911616489947 / 160000000000000000 : ℝ) ≤
            (1892137478411902135321 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1824623389178173 / 2500000000000000 : ℝ)) (q :=
      (233597911616489947 / 320000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_649_5 :
    Uω (aρ 5) (bρ 5) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(82839637222737004547 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (229743265070993531 / 320000000000000000 : ℝ) ≤
      (-(82839637222737004547 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (229743265070993531 / 320000000000000000 : ℝ) =
            (229743265070993531 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (229743265070993531 / 160000000000000000 : ℝ) ≤
            (90447157852262995453 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3587884033477083 / 5000000000000000 : ℝ)) (q :=
      (229743265070993531 / 320000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_649_6 :
    Uω (aρ 6) (bρ 6) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(3556485074335744005427 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (224230039759304091 / 320000000000000000 : ℝ) ≤
      (-(3556485074335744005427 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (224230039759304091 / 320000000000000000 : ℝ) =
            (224230039759304091 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (224230039759304091 / 160000000000000000 : ℝ) ≤
            (3374986728664255994573 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (874803982514197 / 1250000000000000 : ℝ)) (q :=
      (224230039759304091 / 320000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_649_7 :
    Uω (aρ 7) (bρ 7) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(3896204911636402043661 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (43348087817733087 / 64000000000000000 : ℝ) ≤
      (-(3896204911636402043661 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (43348087817733087 / 64000000000000000 : ℝ) =
            (43348087817733087 / 32000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (43348087817733087 / 32000000000000000 : ℝ) ≤
            (3035266891363597956339 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (337699659947933 / 500000000000000 : ℝ)) (q :=
      (43348087817733087 / 64000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_649_8 :
    Uω (aρ 8) (bρ 8) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(4354468209763952836931 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (207032166426422683 / 320000000000000000 : ℝ) ≤
      (-(4354468209763952836931 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (207032166426422683 / 320000000000000000 : ℝ) =
            (207032166426422683 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (207032166426422683 / 160000000000000000 : ℝ) ≤
            (2577003593236047163069 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (803845976113561 / 1250000000000000 : ℝ)) (q :=
      (207032166426422683 / 320000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_649_9 :
    Uω (aρ 9) (bρ 9) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(990738997872693485211 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (194990628141794779 / 320000000000000000 : ℝ) ≤
      (-(990738997872693485211 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (194990628141794779 / 320000000000000000 : ℝ) =
            (194990628141794779 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (194990628141794779 / 160000000000000000 : ℝ) ≤
            (395555362727306514789 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1504784323619811 / 2500000000000000 : ℝ)) (q :=
      (194990628141794779 / 320000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_649_10 :
    Uω (aρ 10) (bρ 10) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(142911190712137077017 / 250000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (180670735310228651 / 320000000000000000 : ℝ) ≤
      (-(142911190712137077017 / 250000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (180670735310228651 / 320000000000000000 : ℝ) =
            (180670735310228651 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (180670735310228651 / 160000000000000000 : ℝ) ≤
            (30375604362862922983 / 250000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5512703026001361 / 10000000000000000 : ℝ)) (q :=
      (180670735310228651 / 320000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_649_11 :
    Uω (aρ 11) (bρ 11) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(1666281274396531617289 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (164318806974575771 / 320000000000000000 : ℝ) ≤
      (-(1666281274396531617289 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (164318806974575771 / 320000000000000000 : ℝ) =
            (164318806974575771 / 160000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (164318806974575771 / 160000000000000000 : ℝ) ≤
            (66586676353468382711 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (613648016403507 / 1250000000000000 : ℝ)) (q :=
      (164318806974575771 / 320000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_649_12 :
    Uω (aρ 12) (bρ 12) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(1955506001388691126887 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (29273441815204607 / 64000000000000000 : ℝ) ≤
      (-(1955506001388691126887 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (29273441815204607 / 64000000000000000 : ℝ) =
            (29273441815204607 / 16000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (29273441815204607 / 16000000000000000 : ℝ) ≤
            (1510229900111308873113 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (421090935925351 / 1000000000000000 : ℝ)) (q :=
      (29273441815204607 / 64000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_649_13 :
    Uω (aρ 13) (bρ 13) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(9210003576042587965751 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (127398585171176907 / 320000000000000000 : ℝ) ≤
      (-(9210003576042587965751 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (127398585171176907 / 320000000000000000 : ℝ) =
            (127398585171176907 / 80000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (127398585171176907 / 80000000000000000 : ℝ) ≤
            (4652940029957412034249 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3424752106795627 / 10000000000000000 : ℝ)) (q :=
      (127398585171176907 / 320000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_649_14 :
    Uω (aρ 14) (bρ 14) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(2170927853472496869607 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (108078419329204123 / 320000000000000000 : ℝ) ≤
      (-(2170927853472496869607 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (108078419329204123 / 320000000000000000 : ℝ) =
            (108078419329204123 / 80000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (108078419329204123 / 80000000000000000 : ℝ) ≤
            (601660867727503130393 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (160073064169833 / 625000000000000 : ℝ)) (q :=
      (108078419329204123 / 320000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_649_15 :
    Uω (aρ 15) (bρ 15) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(12793196732551274176083 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17806497336238479 / 64000000000000000 : ℝ) ≤
      (-(12793196732551274176083 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (17806497336238479 / 64000000000000000 : ℝ) =
            (17806497336238479 / 16000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17806497336238479 / 16000000000000000 : ℝ) ≤
            (1069746873448725823917 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (326074302726319 / 2000000000000000 : ℝ)) (q :=
      (17806497336238479 / 64000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_649_16 :
    Uω (aρ 16) (bρ 16) (38478502079119 / 51200000000000 : ℝ) ≤
      (-(758390116236913319073 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (70213511395988331 / 320000000000000000 : ℝ) ≤
      (-(758390116236913319073 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (70213511395988331 / 320000000000000000 : ℝ) =
            (70213511395988331 / 40000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 12
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (70213511395988331 / 40000000000000000 : ℝ) ≤
            (281330654213086680927 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (606557209816341 / 10000000000000000 : ℝ)) (q :=
      (70213511395988331 / 320000000000000000 : ℝ)) (by norm_num [aρ_16, bρ_16])
      (by norm_num [bρ_16]) (by norm_num) (by norm_num [aρ_16, bρ_16])
      (by norm_num [aρ_16, bρ_16]) hlg

lemma U_649 :
    Uρ (38478502079119 / 51200000000000 : ℝ) ≤
      (-(161359119069458724063 / 312500000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (38478502079119 / 51200000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1471309344121746862427 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (38478502079119 / 51200000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2974734034823848649063 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (38478502079119 / 51200000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(3039240866205603229829 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (38478502079119 / 51200000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(1573598423088097864679 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (38478502079119 / 51200000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) * (-(82839637222737004547 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (38478502079119 / 51200000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(3556485074335744005427 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (38478502079119 / 51200000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(3896204911636402043661 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (38478502079119 / 51200000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4354468209763952836931 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (38478502079119 / 51200000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(990738997872693485211 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) * Uω (aρ 10) (bρ 10) (38478502079119 / 51200000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) * (-(142911190712137077017 / 250000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) * Uω (aρ 11) (bρ 11) (38478502079119 / 51200000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1666281274396531617289 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) * Uω (aρ 12) (bρ 12) (38478502079119 / 51200000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(1955506001388691126887 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) * Uω (aρ 13) (bρ 13) (38478502079119 / 51200000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(9210003576042587965751 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) * Uω (aρ 14) (bρ 14) (38478502079119 / 51200000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(2170927853472496869607 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) * Uω (aρ 15) (bρ 15) (38478502079119 / 51200000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(12793196732551274176083 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) * Uω (aρ 16) (bρ 16) (38478502079119 / 51200000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(758390116236913319073 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_649_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_650_1 :
    Uω (aρ 1) (bρ 1) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(1463102278485251628801 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (955270838652273607 / 1280000000000000000 : ℝ) ≤
      (-(1463102278485251628801 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (955270838652273607 / 1280000000000000000 : ℝ) =
            (955270838652273607 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (955270838652273607 / 640000000000000000 : ℝ) ≤
            (2002633623014748371199 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7463031764539363 / 10000000000000000 : ℝ)) (q :=
      (955270838652273607 / 1280000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_650_2 :
    Uω (aρ 2) (bρ 2) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(1479133439799703354753 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (952212923282640711 / 1280000000000000000 : ℝ) ≤
      (-(1479133439799703354753 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (952212923282640711 / 1280000000000000000 : ℝ) =
            (952212923282640711 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (952212923282640711 / 640000000000000000 : ℝ) ≤
            (1986602461700296645247 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7439020849398849 / 10000000000000000 : ℝ)) (q :=
      (952212923282640711 / 1280000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_650_3 :
    Uω (aρ 3) (bρ 3) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(1511333213172008917413 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (946100418468559111 / 1280000000000000000 : ℝ) ≤
      (-(1511333213172008917413 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (946100418468559111 / 1280000000000000000 : ℝ) =
            (946100418468559111 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (946100418468559111 / 640000000000000000 : ℝ) ≤
            (1954402688327991082587 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (923863633503603 / 1250000000000000 : ℝ)) (q :=
      (946100418468559111 / 1280000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_650_4 :
    Uω (aρ 4) (bρ 4) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(3130440492134986453193 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (187191731738805659 / 256000000000000000 : ℝ) ≤
      (-(3130440492134986453193 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (187191731738805659 / 256000000000000000 : ℝ) =
            (187191731738805659 / 128000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (187191731738805659 / 128000000000000000 : ℝ) ≤
            (3801031310865013546807 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (365536912630839 / 500000000000000 : ℝ)) (q :=
      (187191731738805659 / 256000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_650_5 :
    Uω (aρ 5) (bρ 5) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(1648271404136584240029 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (920540572072686919 / 1280000000000000000 : ℝ) ≤
      (-(1648271404136584240029 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (920540572072686919 / 1280000000000000000 : ℝ) =
            (920540572072686919 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (920540572072686919 / 640000000000000000 : ℝ) ≤
            (1817464497363415759971 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7188020568493321 / 10000000000000000 : ℝ)) (q :=
      (920540572072686919 / 1280000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_650_6 :
    Uω (aρ 6) (bρ 6) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(1769505470959731984053 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (179697763869909851 / 256000000000000000 : ℝ) ≤
      (-(1769505470959731984053 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (179697763869909851 / 256000000000000000 : ℝ) =
            (179697763869909851 / 128000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (179697763869909851 / 128000000000000000 : ℝ) ≤
            (1696230430540268015947 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1402140461466859 / 2000000000000000 : ℝ)) (q :=
      (179697763869909851 / 256000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_650_7 :
    Uω (aρ 7) (bρ 7) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(387809898566500223647 / 1000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (173706578561504411 / 256000000000000000 : ℝ) ≤
      (-(387809898566500223647 / 1000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (173706578561504411 / 256000000000000000 : ℝ) =
            (173706578561504411 / 128000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (173706578561504411 / 128000000000000000 : ℝ) ≤
            (305337281733499776353 / 1000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (84578779198439 / 125000000000000 : ℝ)) (q :=
      (173706578561504411 / 256000000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7])
      (by norm_num [bρ_7]) (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_650_8 :
    Uω (aρ 8) (bρ 8) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(867090644758616515783 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (829704849282250631 / 1280000000000000000 : ℝ) ≤
      (-(867090644758616515783 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (829704849282250631 / 1280000000000000000 : ℝ) =
            (829704849282250631 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (829704849282250631 / 640000000000000000 : ℝ) ≤
            (519203715841383484217 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3221577903566377 / 5000000000000000 : ℝ)) (q :=
      (829704849282250631 / 1280000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_650_9 :
    Uω (aρ 9) (bρ 9) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(4933381220949565653991 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (781548520697065799 / 1280000000000000000 : ℝ) ≤
      (-(4933381220949565653991 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (781548520697065799 / 1280000000000000000 : ℝ) =
            (781548520697065799 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (781548520697065799 / 640000000000000000 : ℝ) ≤
            (1998090582050434346009 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6031678801349241 / 10000000000000000 : ℝ)) (q :=
      (781548520697065799 / 1280000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_650_10 :
    Uω (aρ 10) (bρ 10) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(2847135199343223354549 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (724287430305411079 / 1280000000000000000 : ℝ) ≤
      (-(2847135199343223354549 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (724287430305411079 / 1280000000000000000 : ℝ) =
            (724287430305411079 / 640000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (724287430305411079 / 640000000000000000 : ℝ) ≤
            (618600702156776645451 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1381383324368659 / 2500000000000000 : ℝ)) (q :=
      (724287430305411079 / 1280000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_650_11 :
    Uω (aρ 11) (bρ 11) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(1328045275292720239523 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (131782759645416603 / 256000000000000000 : ℝ) ≤
      (-(1328045275292720239523 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (131782759645416603 / 256000000000000000 : ℝ) =
            (131782759645416603 / 128000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (131782759645416603 / 128000000000000000 : ℝ) ≤
            (58249085307279760477 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (61531836530697 / 125000000000000 : ℝ)) (q :=
      (131782759645416603 / 256000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_650_12 :
    Uω (aρ 12) (bρ 12) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(7793006360136964195467 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (587170196292819527 / 1280000000000000000 : ℝ) ≤
      (-(7793006360136964195467 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (587170196292819527 / 1280000000000000000 : ℝ) =
            (587170196292819527 / 320000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (587170196292819527 / 320000000000000000 : ℝ) ≤
            (6069937245863035804533 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4225253238917893 / 10000000000000000 : ℝ)) (q :=
      (587170196292819527 / 1280000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_650_13 :
    Uω (aρ 13) (bρ 13) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(9174348438106759670099 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (511414549396843719 / 1280000000000000000 : ℝ) ≤
      (-(9174348438106759670099 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (511414549396843719 / 1280000000000000000 : ℝ) =
            (511414549396843719 / 320000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (511414549396843719 / 320000000000000000 : ℝ) ≤
            (4688595167893240329901 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3440952997763271 / 10000000000000000 : ℝ)) (q :=
      (511414549396843719 / 1280000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_650_14 :
    Uω (aρ 14) (bρ 14) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(10807034813892791887537 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (86875317848878747 / 256000000000000000 : ℝ) ≤
      (-(10807034813892791887537 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (86875317848878747 / 256000000000000000 : ℝ) =
            (86875317848878747 / 64000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (86875317848878747 / 64000000000000000 : ℝ) ≤
            (3055908792107208112463 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (8066131735707 / 31250000000000 : ℝ)) (q :=
      (86875317848878747 / 256000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_650_15 :
    Uω (aρ 15) (bρ 15) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(12718791257063904718547 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (358789631010213383 / 1280000000000000000 : ℝ) ≤
      (-(12718791257063904718547 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (358789631010213383 / 1280000000000000000 : ℝ) =
            (358789631010213383 / 320000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (358789631010213383 / 320000000000000000 : ℝ) ≤
            (1144152348936095281453 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (414922302608043 / 2500000000000000 : ℝ)) (q :=
      (358789631010213383 / 1280000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_650_16 :
    Uω (aρ 16) (bρ 16) (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(936083213417966146663 / 625000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (57250953781302043 / 256000000000000000 : ℝ) ≤
      (-(936083213417966146663 / 625000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (57250953781302043 / 256000000000000000 : ℝ) =
            (57250953781302043 / 32000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (57250953781302043 / 32000000000000000 : ℝ) ≤
            (363567749644533853337 / 625000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (67870364157181 / 1000000000000000 : ℝ)) (q :=
      (57250953781302043 / 256000000000000000 : ℝ)) (by norm_num [aρ_16, bρ_16])
      (by norm_num [bρ_16]) (by norm_num) (by norm_num [aρ_16, bρ_16])
      (by norm_num [aρ_16, bρ_16]) hlg

lemma U_650 :
    Uρ (770823404286711 / 1024000000000000 : ℝ) ≤
      (-(1028013062888184996239 / 2000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (770823404286711 / 1024000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1463102278485251628801 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) *
        Uω (aρ 2) (bρ 2) (770823404286711 / 1024000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(1479133439799703354753 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) *
        Uω (aρ 3) (bρ 3) (770823404286711 / 1024000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(1511333213172008917413 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (770823404286711 / 1024000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3130440492134986453193 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (770823404286711 / 1024000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(1648271404136584240029 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) *
        Uω (aρ 6) (bρ 6) (770823404286711 / 1024000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(1769505470959731984053 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) *
        Uω (aρ 7) (bρ 7) (770823404286711 / 1024000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(387809898566500223647 / 1000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) *
        Uω (aρ 8) (bρ 8) (770823404286711 / 1024000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(867090644758616515783 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (770823404286711 / 1024000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(4933381220949565653991 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) *
        Uω (aρ 10) (bρ 10) (770823404286711 / 1024000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(2847135199343223354549 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) *
        Uω (aρ 11) (bρ 11) (770823404286711 / 1024000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) *
        (-(1328045275292720239523 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) *
        Uω (aρ 12) (bρ 12) (770823404286711 / 1024000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(7793006360136964195467 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) *
        Uω (aρ 13) (bρ 13) (770823404286711 / 1024000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(9174348438106759670099 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) *
        Uω (aρ 14) (bρ 14) (770823404286711 / 1024000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(10807034813892791887537 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (770823404286711 / 1024000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(12718791257063904718547 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) *
        Uω (aρ 16) (bρ 16) (770823404286711 / 1024000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) * (-(936083213417966146663 / 625000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_650_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

lemma U_651_1 :
    Uω (aρ 1) (bρ 1) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(1454908662039441301187 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (478418773286401937 / 640000000000000000 : ℝ) ≤
      (-(1454908662039441301187 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (478418773286401937 / 640000000000000000 : ℝ) =
            (478418773286401937 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (478418773286401937 / 320000000000000000 : ℝ) ≤
            (2010827239460558698813 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3737635852819083 / 5000000000000000 : ℝ)) (q :=
      (478418773286401937 / 640000000000000000 : ℝ)) (by norm_num [aρ_1, bρ_1])
      (by norm_num [bρ_1]) (by norm_num) (by norm_num [aρ_1, bρ_1]) (by norm_num [aρ_1, bρ_1]) hlg

lemma U_651_2 :
    Uω (aρ 2) (bρ 2) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(2941826797557366372611 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (476889828324522417 / 640000000000000000 : ℝ) ≤
      (-(2941826797557366372611 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (476889828324522417 / 640000000000000000 : ℝ) =
            (476889828324522417 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (476889828324522417 / 320000000000000000 : ℝ) ≤
            (3989645005442633627389 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7451261188089431 / 10000000000000000 : ℝ)) (q :=
      (476889828324522417 / 640000000000000000 : ℝ)) (by norm_num [aρ_2, bρ_2])
      (by norm_num [bρ_2]) (by norm_num) (by norm_num [aρ_2, bρ_2]) (by norm_num [aρ_2, bρ_2]) hlg

lemma U_651_3 :
    Uω (aρ 3) (bρ 3) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(150305970797283732639 / 500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (473833613878884241 / 640000000000000000 : ℝ) ≤
      (-(150305970797283732639 / 500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (473833613878884241 / 640000000000000000 : ℝ) =
            (473833613878884241 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (473833613878884241 / 320000000000000000 : ℝ) ≤
            (196267619352716267361 / 500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (3701575296506619 / 5000000000000000 : ℝ)) (q :=
      (473833613878884241 / 640000000000000000 : ℝ)) (by norm_num [aρ_3, bρ_3])
      (by norm_num [bρ_3]) (by norm_num) (by norm_num [aρ_3, bρ_3]) (by norm_num [aρ_3, bρ_3]) hlg

lemma U_651_4 :
    Uω (aρ 4) (bρ 4) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(3113712179685890930111 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (468762834944728689 / 640000000000000000 : ℝ) ≤
      (-(3113712179685890930111 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (468762834944728689 / 640000000000000000 : ℝ) =
            (468762834944728689 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 10
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (468762834944728689 / 320000000000000000 : ℝ) ≤
            (3817759623314109069889 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7322982932385877 / 10000000000000000 : ℝ)) (q :=
      (468762834944728689 / 640000000000000000 : ℝ)) (by norm_num [aρ_4, bρ_4])
      (by norm_num [bρ_4]) (by norm_num) (by norm_num [aρ_4, bρ_4]) (by norm_num [aρ_4, bρ_4]) hlg

lemma U_651_5 :
    Uω (aρ 5) (bρ 5) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(3279529153345017258651 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (461054040555763377 / 640000000000000000 : ℝ) ≤
      (-(3279529153345017258651 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (461054040555763377 / 640000000000000000 : ℝ) =
            (461054040555763377 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (461054040555763377 / 320000000000000000 : ℝ) ≤
            (3651942649654982741349 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7200273027065711 / 10000000000000000 : ℝ)) (q :=
      (461054040555763377 / 640000000000000000 : ℝ)) (by norm_num [aρ_5, bρ_5])
      (by norm_num [bρ_5]) (by norm_num) (by norm_num [aρ_5, bρ_5]) (by norm_num [aρ_5, bρ_5]) hlg

lemma U_651_6 :
    Uω (aρ 6) (bρ 6) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(880391841664744773029 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (450028736416075057 / 640000000000000000 : ℝ) ≤
      (-(880391841664744773029 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (450028736416075057 / 640000000000000000 : ℝ) =
            (450028736416075057 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (450028736416075057 / 320000000000000000 : ℝ) ≤
            (852476109085255226971 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (7022972647840451 / 10000000000000000 : ℝ)) (q :=
      (450028736416075057 / 640000000000000000 : ℝ)) (by norm_num [aρ_6, bρ_6])
      (by norm_num [bρ_6]) (by norm_num) (by norm_num [aρ_6, bρ_6]) (by norm_num [aρ_6, bρ_6]) hlg

lemma U_651_7 :
    Uω (aρ 7) (bρ 7) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(772005193484518130031 / 2000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (17402080264116729 / 25600000000000000 : ℝ) ≤
      (-(772005193484518130031 / 2000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (17402080264116729 / 25600000000000000 : ℝ) =
            (17402080264116729 / 12800000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (17402080264116729 / 12800000000000000 : ℝ) ≤
            (614289167115481869969 / 2000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (67786112219393 / 100000000000000 : ℝ)) (q :=
      (17402080264116729 / 25600000000000000 : ℝ)) (by norm_num [aρ_7, bρ_7]) (by norm_num [bρ_7])
      (by norm_num) (by norm_num [aρ_7, bρ_7]) (by norm_num [aρ_7, bρ_7]) hlg

lemma U_651_8 :
    Uω (aρ 8) (bρ 8) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(4316474761254591827999 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (83128099669190653 / 128000000000000000 : ℝ) ≤
      (-(4316474761254591827999 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (83128099669190653 / 128000000000000000 : ℝ) =
            (83128099669190653 / 64000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 8
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (83128099669190653 / 64000000000000000 : ℝ) ≤
            (2614997041745408172001 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1291108648049829 / 2000000000000000 : ℝ)) (q :=
      (83128099669190653 / 128000000000000000 : ℝ)) (by norm_num [aρ_8, bρ_8])
      (by norm_num [bρ_8]) (by norm_num) (by norm_num [aρ_8, bρ_8]) (by norm_num [aρ_8, bρ_8]) hlg

lemma U_651_9 :
    Uω (aρ 9) (bρ 9) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(2456554822246143235107 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (391567224838617969 / 640000000000000000 : ℝ) ≤
      (-(2456554822246143235107 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (391567224838617969 / 640000000000000000 : ℝ) =
            (391567224838617969 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 7
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (391567224838617969 / 320000000000000000 : ℝ) ≤
            (1009181079253856764893 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (6044219071504917 / 10000000000000000 : ℝ)) (q :=
      (391567224838617969 / 640000000000000000 : ℝ)) (by norm_num [aρ_9, bρ_9])
      (by norm_num [bρ_9]) (by norm_num) (by norm_num [aρ_9, bρ_9]) (by norm_num [aρ_9, bρ_9]) hlg

lemma U_651_10 :
    Uω (aρ 10) (bρ 10) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(5672144599328013069273 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (362945874163962929 / 640000000000000000 : ℝ) ≤
      (-(5672144599328013069273 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (362945874163962929 / 640000000000000000 : ℝ) =
            (362945874163962929 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (362945874163962929 / 320000000000000000 : ℝ) ≤
            (1259327203671986930727 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (5538360896416947 / 10000000000000000 : ℝ)) (q :=
      (362945874163962929 / 640000000000000000 : ℝ)) (by norm_num [aρ_10, bρ_10])
      (by norm_num [bρ_10]) (by norm_num) (by norm_num [aρ_10, bρ_10])
      (by norm_num [aρ_10, bρ_10]) hlg

lemma U_651_11 :
    Uω (aρ 11) (bρ 11) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(66153951394211009971 / 100000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (330275997890179633 / 640000000000000000 : ℝ) ≤
      (-(66153951394211009971 / 100000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 1
        (show
          (330275997890179633 / 640000000000000000 : ℝ) =
            (330275997890179633 / 320000000000000000 : ℝ) / 2 ^ 1
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 4
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (330275997890179633 / 320000000000000000 : ℝ) ≤
            (3160766635788990029 / 100000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (4935903889066219 / 10000000000000000 : ℝ)) (q :=
      (330275997890179633 / 640000000000000000 : ℝ)) (by norm_num [aρ_11, bρ_11])
      (by norm_num [bρ_11]) (by norm_num) (by norm_num [aρ_11, bρ_11])
      (by norm_num [aρ_11, bρ_11]) hlg

lemma U_651_12 :
    Uω (aρ 12) (bρ 12) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(7764087011892156874073 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (58887071193642237 / 128000000000000000 : ℝ) ≤
      (-(7764087011892156874073 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (58887071193642237 / 128000000000000000 : ℝ) =
            (58887071193642237 / 32000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (58887071193642237 / 32000000000000000 : ℝ) ≤
            (6098856594107843125927 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (847916785137941 / 2000000000000000 : ℝ)) (q :=
      (58887071193642237 / 128000000000000000 : ℝ)) (by norm_num [aρ_12, bρ_12])
      (by norm_num [bρ_12]) (by norm_num) (by norm_num [aρ_12, bρ_12])
      (by norm_num [aρ_12, bρ_12]) hlg

lemma U_651_13 :
    Uω (aρ 13) (bρ 13) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(2284715153041468922039 / 2500000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (51323267260200061 / 128000000000000000 : ℝ) ≤
      (-(2284715153041468922039 / 2500000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (51323267260200061 / 128000000000000000 : ℝ) =
            (51323267260200061 / 32000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 11
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (51323267260200061 / 32000000000000000 : ℝ) ≤
            (1181020748458531077961 / 2500000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (691424260536873 / 2000000000000000 : ℝ)) (q :=
      (51323267260200061 / 128000000000000000 : ℝ)) (by norm_num [aρ_13, bρ_13])
      (by norm_num [bρ_13]) (by norm_num) (by norm_num [aρ_13, bρ_13])
      (by norm_num [aρ_13, bρ_13]) hlg

lemma U_651_14 :
    Uω (aρ 14) (bρ 14) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(10759796797346239902829 / 10000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (218216676070397777 / 640000000000000000 : ℝ) ≤
      (-(10759796797346239902829 / 10000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (218216676070397777 / 640000000000000000 : ℝ) =
            (218216676070397777 / 160000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 9
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (218216676070397777 / 160000000000000000 : ℝ) ≤
            (3103146808653760097171 / 10000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (650264801380759 / 2500000000000000 : ℝ)) (q :=
      (218216676070397777 / 640000000000000000 : ℝ)) (by norm_num [aρ_14, bρ_14])
      (by norm_num [bρ_14]) (by norm_num) (by norm_num [aρ_14, bρ_14])
      (by norm_num [aρ_14, bρ_14]) hlg

lemma U_651_15 :
    Uω (aρ 15) (bρ 15) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(252913589034511244197 / 200000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (180711209722183089 / 640000000000000000 : ℝ) ≤
      (-(252913589034511244197 / 200000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 2
        (show
          (180711209722183089 / 640000000000000000 : ℝ) =
            (180711209722183089 / 160000000000000000 : ℝ) / 2 ^ 2
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 6
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (180711209722183089 / 160000000000000000 : ℝ) ≤
            (24345283085488755803 / 200000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (1688586659556327 / 10000000000000000 : ℝ)) (q :=
      (180711209722183089 / 640000000000000000 : ℝ)) (by norm_num [aρ_15, bρ_15])
      (by norm_num [bρ_15]) (by norm_num) (by norm_num [aρ_15, bρ_15])
      (by norm_num [aρ_15, bρ_15]) hlg

lemma U_651_16 :
    Uω (aρ 16) (bρ 16) (386038383495521 / 512000000000000 : ℝ) ≤
      (-(7402636371640588000721 / 5000000000000000000000 : ℝ)) := by
  have hlg :
    Real.log (145611323094618033 / 640000000000000000 : ℝ) ≤
      (-(7402636371640588000721 / 5000000000000000000000 : ℝ)) := by
    have h :=
      log_le_of_split_neg 3
        (show
          (145611323094618033 / 640000000000000000 : ℝ) =
            (145611323094618033 / 80000000000000000 : ℝ) / 2 ^ 3
          by norm_num)
        (by norm_num)
        (log_le_of_ge_one (by norm_num) 13
            (by simp only [Finset.sum_range_succ, Finset.sum_range_zero]; norm_num) :
          Real.log (145611323094618033 / 80000000000000000 : ℝ) ≤
            (2994571332859411999279 / 5000000000000000000000 : ℝ))
    linarith only [h, Real.log_two_gt_d9]
  exact
    Uω_le_right_certificate (s := (744086853954919 / 10000000000000000 : ℝ)) (q :=
      (145611323094618033 / 640000000000000000 : ℝ)) (by norm_num [aρ_16, bρ_16])
      (by norm_num [bρ_16]) (by norm_num) (by norm_num [aρ_16, bρ_16])
      (by norm_num [aρ_16, bρ_16]) hlg

lemma U_651 :
    Uρ (386038383495521 / 512000000000000 : ℝ) ≤
      (-(511684876669522631533 / 1000000000000000000000 : ℝ)) := by
  rw [Uρ_expand, cρ_1, cρ_2, cρ_3, cρ_4, cρ_5, cρ_6, cρ_7, cρ_8, cρ_9, cρ_10, cρ_11, cρ_12, cρ_13,
    cρ_14, cρ_15, cρ_16]
  have hm1 :
    (525779809 / 50000000000 : ℝ) * Uω (aρ 1) (bρ 1) (386038383495521 / 512000000000000 : ℝ) ≤
      (525779809 / 50000000000 : ℝ) * (-(1454908662039441301187 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_1 (by norm_num)
  have hm2 :
    (29471737793 / 1000000000000 : ℝ) * Uω (aρ 2) (bρ 2) (386038383495521 / 512000000000000 : ℝ) ≤
      (29471737793 / 1000000000000 : ℝ) *
        (-(2941826797557366372611 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_2 (by norm_num)
  have hm3 :
    (42934365099 / 1000000000000 : ℝ) * Uω (aρ 3) (bρ 3) (386038383495521 / 512000000000000 : ℝ) ≤
      (42934365099 / 1000000000000 : ℝ) *
        (-(150305970797283732639 / 500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_3 (by norm_num)
  have hm4 :
    (29102115983 / 500000000000 : ℝ) * Uω (aρ 4) (bρ 4) (386038383495521 / 512000000000000 : ℝ) ≤
      (29102115983 / 500000000000 : ℝ) *
        (-(3113712179685890930111 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_4 (by norm_num)
  have hm5 :
    (6903762131 / 100000000000 : ℝ) * Uω (aρ 5) (bρ 5) (386038383495521 / 512000000000000 : ℝ) ≤
      (6903762131 / 100000000000 : ℝ) *
        (-(3279529153345017258651 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_5 (by norm_num)
  have hm6 :
    (78873099189 / 1000000000000 : ℝ) * Uω (aρ 6) (bρ 6) (386038383495521 / 512000000000000 : ℝ) ≤
      (78873099189 / 1000000000000 : ℝ) *
        (-(880391841664744773029 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_6 (by norm_num)
  have hm7 :
    (84856120711 / 1000000000000 : ℝ) * Uω (aρ 7) (bρ 7) (386038383495521 / 512000000000000 : ℝ) ≤
      (84856120711 / 1000000000000 : ℝ) *
        (-(772005193484518130031 / 2000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_7 (by norm_num)
  have hm8 :
    (88396082127 / 1000000000000 : ℝ) * Uω (aρ 8) (bρ 8) (386038383495521 / 512000000000000 : ℝ) ≤
      (88396082127 / 1000000000000 : ℝ) *
        (-(4316474761254591827999 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_8 (by norm_num)
  have hm9 :
    (706427057 / 8000000000 : ℝ) * Uω (aρ 9) (bρ 9) (386038383495521 / 512000000000000 : ℝ) ≤
      (706427057 / 8000000000 : ℝ) * (-(2456554822246143235107 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_9 (by norm_num)
  have hm10 :
    (17094464251 / 200000000000 : ℝ) *
        Uω (aρ 10) (bρ 10) (386038383495521 / 512000000000000 : ℝ) ≤
      (17094464251 / 200000000000 : ℝ) *
        (-(5672144599328013069273 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_10 (by norm_num)
  have hm11 :
    (39449592119 / 500000000000 : ℝ) *
        Uω (aρ 11) (bρ 11) (386038383495521 / 512000000000000 : ℝ) ≤
      (39449592119 / 500000000000 : ℝ) * (-(66153951394211009971 / 100000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_11 (by norm_num)
  have hm12 :
    (35176735959 / 500000000000 : ℝ) *
        Uω (aρ 12) (bρ 12) (386038383495521 / 512000000000000 : ℝ) ≤
      (35176735959 / 500000000000 : ℝ) *
        (-(7764087011892156874073 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_12 (by norm_num)
  have hm13 :
    (11767795323 / 200000000000 : ℝ) *
        Uω (aρ 13) (bρ 13) (386038383495521 / 512000000000000 : ℝ) ≤
      (11767795323 / 200000000000 : ℝ) *
        (-(2284715153041468922039 / 2500000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_13 (by norm_num)
  have hm14 :
    (22210660553 / 500000000000 : ℝ) *
        Uω (aρ 14) (bρ 14) (386038383495521 / 512000000000000 : ℝ) ≤
      (22210660553 / 500000000000 : ℝ) *
        (-(10759796797346239902829 / 10000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_14 (by norm_num)
  have hm15 :
    (30462865791 / 1000000000000 : ℝ) *
        Uω (aρ 15) (bρ 15) (386038383495521 / 512000000000000 : ℝ) ≤
      (30462865791 / 1000000000000 : ℝ) *
        (-(252913589034511244197 / 200000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_15 (by norm_num)
  have hm16 :
    (5959622577 / 1000000000000 : ℝ) *
        Uω (aρ 16) (bρ 16) (386038383495521 / 512000000000000 : ℝ) ≤
      (5959622577 / 1000000000000 : ℝ) *
        (-(7402636371640588000721 / 5000000000000000000000 : ℝ)) :=
    mul_le_mul_of_nonneg_left U_651_16 (by norm_num)
  linarith only [hm1, hm2, hm3, hm4, hm5, hm6, hm7, hm8, hm9, hm10, hm11, hm12, hm13, hm14, hm15,
    hm16]

end Zeta5Irrational
